{"reviews": {"48932670": {"recommendationid": "48932670", "author": {"steamid": "76561198269455704", "num_games_owned": 29, "num_reviews": 27, "playtime_forever": 1345, "playtime_last_two_weeks": 0, "last_played": 1540593997}, "language": "english", "review": "Half-Life 2: Episode One was a good game as seen the results of City 17's HQ destruction, and the antlion invasion raiding the war-torn city as multiple forces fight against one another. I'd recommend having a lower price for this though due to it being one of the shortest of the series, but it is still a good game to buy and try out.", "timestamp_created": 1549910519, "timestamp_updated": 1549910519, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49351289": {"recommendationid": "49351289", "author": {"steamid": "76561198314116650", "num_games_owned": 49, "num_reviews": 14, "playtime_forever": 245, "playtime_last_two_weeks": 245, "last_played": 1551743434}, "language": "english", "review": "Nice !\nrich extension <3", "timestamp_created": 1551688574, "timestamp_updated": 1551688574, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40470848": {"recommendationid": "40470848", "author": {"steamid": "76561198120266850", "num_games_owned": 1505, "num_reviews": 141, "playtime_forever": 240, "playtime_last_two_weeks": 0, "last_played": 1499455440}, "language": "english", "review": "500 million people have died since Half Life 2 was released. \nMillions of people who will never see Half Life 3.\nHow many more people have to die, Gabe? \nHow many more millions until you do the right thing?", "timestamp_created": 1519850522, "timestamp_updated": 1519850522, "voted_up": true, "votes_up": 73, "votes_funny": 50, "weighted_vote_score": "0.870475947856903076", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32691680": {"recommendationid": "32691680", "author": {"steamid": "76561197991652472", "num_games_owned": 85, "num_reviews": 13, "playtime_forever": 1311, "playtime_last_two_weeks": 0, "last_played": 1498239587}, "language": "english", "review": "[h1]I give Half-Life 2: Episode One a 9.5/10[/h1]\n\nHalf-Life 2: Episode One takes place in the aftermath of Half-Life 2, you play as Gordon Freeman, an MIT graduate with a background involving the black mesa incident and a member of the human resistance. After the citadel's teleporter was destroyed, it started a chain reaction of chaos, and destruction to the once named, City 17. Now you and your partner, Alyx Vance must escape the ruins of city 17 before the citadel self-destructs, but that's easier said than done.\n[list]\n[*]The levels show the ruins of City 17 in a fun, and creative way\n[*]New Enemy thats proves a great challenge\n[*]More puzzles involving with the laws of physics and combat strategy\n[*]New \"boss battle\" scenarios with other creatures and/or vehicles\n[*]First game to heavy work with HDR (High Dynamic Range) lighting which proves to improve the Half-Life experience\n[*]Improved AI compared to Half-Life 2\n[*]Great soundtrack\n[/list]", "timestamp_created": 1498240960, "timestamp_updated": 1498241082, "voted_up": true, "votes_up": 69, "votes_funny": 3, "weighted_vote_score": "0.873681962490081787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32030070": {"recommendationid": "32030070", "author": {"steamid": "76561197979635569", "num_games_owned": 79, "num_reviews": 50, "playtime_forever": 644, "playtime_last_two_weeks": 0, "last_played": 1485303615}, "language": "english", "review": "Incredible Addition to HL2**\n\nThere is no way to undercut this DLC. It is absolutely phenomal and even a casual visitor (such as this reviewer) will likely relish every moment spent playing it, quirks and all. Any return to the Half Life universe is most welcome. This installment begins with the player loading in at precisely the moment HL2 ended. As you can imagine, this only helps deepen the immersion of the journey.\n\nThe story of Episode One is the driving force, and well it should be: storytelling seems to take on a new prominence, even for Valve. HL2 was one of the first games in recent memory that made so complete and compelling use of NPCs to really advance the story. The writing, direction and pacing of the story not only continues to be first rate: it actually gets better. That didn't seem possible given how utterly fantastic HL2 is, but Valve found a way to do it. Facial animations are unreal (remember, this DLC originally came out in 2005-6) and the voice acting is incredible. AND THIS IS A FREAKING SHOOTER. If this genre is supposed to inspire the feelz, shouldn't it be limited to excitement and anticipation? Not an emotional rollercoaster of tension, fear, relief, wonder and suspense?\n\nSpeaking of being a shooter, the level of difficulty is increased accordingly. While not insurmountable, those players who had been looking for more of a challegne should be pleased: Episode One returns players to a time when combat decisions matter. More use of the functions of the HEV suit (flashlight, oxygen, etc) and some good puzzles/lateral thinking help here, as well. Also, there is noticeably less ammunition. It's no longer possible to blast your way through EVERY problem encountered. A bit of finesse (or fleet-footedness) will be required.\n\n**But for all these changes, there were some struggles. At times, it feels as though Episode One shines a spotlight on some of the things HL2 struggled with. It was very cool to learn more about Alyx and watch her character develop. It was far less cool to watch her do virtually everything of consequence in the game. As a player, it's frustrating to have nearly every action (for story or game play progression) require NPC input. At this point, we've watched Gordon Freeman (the only 'theoretical physicist' who can single-handledly take out entire teams of Recon Marines, Delta Force-level goons, previously unknown armored alien vehicles like Striders and more) solve every problem thrown at him. To 'need' someone else to open every door for him, or tell him where to go seems a bit... contrived. Forced. Less fun. Advancing the goals of humanity was, until this point, a task left almost entirely in the hands of one person. But suddenly, someone else is required to help. It also seems a disservice to Alyx, as she is strong and capable. Does she really need Gordon to do these things? No, and that makes the relationship seem insincere at times. In those moments, it's not about seeing Gordon and Alyx struggle and grow together; it's about having a semi-emotional vehicle that attempts to justify itself as a means to shoe-horn the story forward. \n\nRegardless of the criticism offered in this review, it must be remembered that this content is still well worth the investment (in finances and time). That statement is true of any addition to the HL franchise, be it episodic, stand-alone or even only tangentially related (Portal, et al). Similarly, even with these few subjectively negative oberservations, Episode One is a part of one of the best, most powerful and enduring franchises in video game history. Not only that, but it is part of an amazing progression in storytelling, as well. Conceptually, the HL universe is compelling and completely engrossing. This DLC continues in that tradition beautifully... even if that beauty is marred by a miniscule, nigh-on microscopic blemish.\n\n8/10. Incredible. Episode One is head and shoulders better than many of its peers in the FPS genre. Peers that are full-fledged, core/base games that take tens of hours to complete, not a DLC/add-on that takes a mere handful of hours to play through.\n\nedit: 'not longer' is less awesome than 'no longer'. ;-)", "timestamp_created": 1496008953, "timestamp_updated": 1498781984, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.838833451271057129", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11960987": {"recommendationid": "11960987", "author": {"steamid": "76561198030080447", "num_games_owned": 881, "num_reviews": 90, "playtime_forever": 814, "playtime_last_two_weeks": 0, "last_played": 1415161319}, "language": "english", "review": "[i]Half-Life 2: Episode One 1[/i] was released a bit over 8 years ago, as the even then long-awaited expansion of the original, critically widely acclaimed game. Since it is part of the Orange Box, the Half-Life 2 Complete Edition and the Valve Complete Edition, chances are great you already own and have played the original [i]Half-Life 2[/i].\nThe good news: [i]Episode 1[/i] continues on the high level of level design and gameplay the original had set. There is however an important shift in focus, as the greater part of the game is played alongside Alyx, Gordon's female companion-in-arms. Alyx happily stands her own against the enemy hordes and doesn't need any sort of \"babysitting\" games wtih less well developed AI sometimes call for. She's been updated graphically as well (looking even better ;-)) since Episode 1 makes use of the High Dynamic Range lighting effects first tried out by Valve in [i]Half-Life 2: Lost Coast[/i]. However, compared to that playable tech-demo, environments in Episode 1 are a bit disappointing and don't always offer the best opportunities for the upgraded engine to shine. There are no wide-open vistas, and although the opening level in the Citadel is impressive, it also has a sort of repetitiveness that comes to the fore now and then.\n\nOn the other hand, gameplay-wise everything is as top-notch as it was in the original game, and the fact that you play alongside Alyx offers some interesting opportunities. There's even a Steam Achievement called \"One Bullet\" which gets unlocked by playing through the entire game (!!) using one single bullet. The rest of the kills/actions has to be made by using the Gravity Gun, which gets an upgrade during the early part of the game. This calls for clever thinking, and I tried to get it, only to find myself missing the shooting action after a couple of hours ;-).\n\nAll in all, Episode 1 is a good to very good expansion, continuing the story of the original game in a logical and interesting way. There's no reason at all not to give it a shot (...) when you've played the original [i]Half-Life 2[/i].\n\nOverall rating: 8/10", "timestamp_created": 1409687719, "timestamp_updated": 1409687719, "voted_up": true, "votes_up": 64, "votes_funny": 2, "weighted_vote_score": "0.840824425220489502", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "11399239": {"recommendationid": "11399239", "author": {"steamid": "76561198097868707", "num_games_owned": 144, "num_reviews": 5, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1387407713}, "language": "english", "review": "Alyx: It's a combine zombie, a zombine right\n\ngordon: ...\n\nAlyx: get it... a zombine...\n\nGordon: ...\n\nAlyx: ...", "timestamp_created": 1406263031, "timestamp_updated": 1406263143, "voted_up": true, "votes_up": 133, "votes_funny": 113, "weighted_vote_score": "0.872521042823791504", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12498838": {"recommendationid": "12498838", "author": {"steamid": "76561198048023896", "num_games_owned": 208, "num_reviews": 27, "playtime_forever": 287, "playtime_last_two_weeks": 0, "last_played": 1417104723}, "language": "english", "review": "Episode 1 continues where Half Life 2 ended.\n\nIt's the shortest one of them all and adds a few new things which I really like for instance Alyx can only see in the dark if you turn on the flashlight and point it in some direction.\n\nA must have for a Half-Life fan of course.", "timestamp_created": 1413376547, "timestamp_updated": 1413376547, "voted_up": true, "votes_up": 32, "votes_funny": 6, "weighted_vote_score": "0.767132937908172607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13838438": {"recommendationid": "13838438", "author": {"steamid": "76561198002506911", "num_games_owned": 3158, "num_reviews": 227, "playtime_forever": 497, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "Episode One picks up the story right around where Half-Life 2 ended.  Alyx and Dog are looking for you, and your job is to get the hell out of City 17 before it blows up.  There are a few enhancements to the gameplay, some new enemies, and a superb storyline that continues to expand the Half-Life universe.  A must play if you are a fan of the series, or if you're looking for a quick shooter.  The game itself is not long, but packs a punch in the short campaign that you play.", "timestamp_created": 1420411764, "timestamp_updated": 1420411764, "voted_up": true, "votes_up": 39, "votes_funny": 9, "weighted_vote_score": "0.797481238842010498", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "2380664": {"recommendationid": "2380664", "author": {"steamid": "76561198006581408", "num_games_owned": 250, "num_reviews": 154, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1415751047}, "language": "english", "review": "the exciting prequel to half life 2 episode 2", "timestamp_created": 1316741813, "timestamp_updated": 1385422578, "voted_up": true, "votes_up": 226, "votes_funny": 30, "weighted_vote_score": "0.818519830703735352", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42410977": {"recommendationid": "42410977", "author": {"steamid": "76561198005012314", "num_games_owned": 504, "num_reviews": 47, "playtime_forever": 1946, "playtime_last_two_weeks": 0, "last_played": 1527755591}, "language": "english", "review": "The release of this Episode signified a hope of something bigger coming in the near future. We got that with The Orange Box and Episode Two wouldn't have been possible without the evolution the Half-Life architecture went through in Episode One.\n\nIt's evident that this installment is mainly about Alyx, her emotions, reactions and her relationship with Gordon. In the beginning, she is delighted to find you amidst the rubble. She is given a lot of space to express her anxiety about going back inside the Citadel to delay the reactor's core's meltdown and whispers your name at the very end of the Episode.\n\nShe is your companion and will stand by your side through most of the game. Her AI and reactivity were improved a ton as she is very helpful, moves away when she gets in your way, and you can count on her during the more precarious situations. In the chapter Lowlife when you are left wandering through pitch black underground garages, you will have to cooperate with Alyx by using light sources like your flashlight to illuminate zombies so that she can shoot them.\n\nThere are no new weapons, just the good old Valve creativity. They added flares that can light zombies on fire. Antlions now spawn from burrows that can be sealed with car wrecks using the Gravity Gun and a new combination of an armored Combine soldier and a zombie dubbed Zombine is present. Graphically the game's lighting was drastically improved with the addition of HDR.\n\nThe overall mood of the game is again top-notch. The landmark of Citadel is now a looming threat of catastrophic proportions. City 17 is more ruined than ever. I spent a long time just brooding over the destroyed cityscape and listening to Dr. Kleiner's emergency broadcast turned motivational speech.\n\n\"For what the Combine fear the most is not any tangible human weapon, but our will, our intellect, our ability to respond selectively and rationally to every terror they turn against us. We place our firmest hope in the human spirit, even knowing how easily it may be shattered.\"\n\n9/10\n\n+ Alyx's emotional maturity and improved AI set a new milestone for video game companions, the true Half-Life atmosphere enhanced by apocalyptic imminence, Zombines and their distorted voices, excellent soundtrack, prepares the ground for the next Half-Life adventure\n- extremely short (can be beaten in under 3 hrs)", "timestamp_created": 1527794169, "timestamp_updated": 1527794169, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.720483243465423584", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16607148": {"recommendationid": "16607148", "author": {"steamid": "76561198003200788", "num_games_owned": 455, "num_reviews": 8, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1434866636}, "language": "english", "review": "ever since playing through Ravenholm in HL2, i thought, \"I'd really like a game where i have to use the gravity gun the ENTIRE TIME\". and behold, HL2E1 was brought down from the heavens upon me, and a task was bestowed: to fire one single boat through the whole game", "timestamp_created": 1434928514, "timestamp_updated": 1434928514, "voted_up": true, "votes_up": 21, "votes_funny": 14, "weighted_vote_score": "0.710506081581115723", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11908592": {"recommendationid": "11908592", "author": {"steamid": "76561198068530570", "num_games_owned": 536, "num_reviews": 13, "playtime_forever": 787, "playtime_last_two_weeks": 0, "last_played": 1461227006}, "language": "english", "review": "Well, First of all, I am very surprised that you are [i] actually [/i] going to read a review to buy this awesome Game. I bet you already know this is an installement for the Ledgendary game [i]'Half Life 2'[/i] So why bother reading a review? But if you still want to continue reading, Then be my guest.\n\n Back to the review.\n This is an AWESOME Game for a Game that has been released in the Year 2006 (June 1, 2006 to be precise, Oh, And By The Way, My Birthday is on June 29th!)  And yet, It still is. If you have Half Life 2 and dont have EP1, Trust me you are missing alot then. \n It is a hard Game, Especially because of the dark areas which happened to be filled with Zombies and God, (Or should I say Gordon? :P) knows what else. \n There are no new Weapons, But hey now, Who needs new Weapons when there are already plenty to choose from?\n The Game is a bit short, But reasonable, But the Story is mind blowing. I wont tell what happens in the story, As I might [i]accidently[/i] tell something that I'm not supposed to.\n\n Overall, I highly recommend this Game, Infact, The whole series to any Gamer. It doesnt matter whether you are a Beginner, Intermediate or an Advanced Player, You [i]will[/i] find this game very interesting to Play.", "timestamp_created": 1409319612, "timestamp_updated": 1413117710, "voted_up": true, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.708633482456207275", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39958242": {"recommendationid": "39958242", "author": {"steamid": "76561197997013831", "num_games_owned": 1968, "num_reviews": 49, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1516838513}, "language": "english", "review": "More of the same from the base game. Short, but interesting. It's a bit heartbreaking to play through the chapters these days knowing we'll likely never see the story continue.", "timestamp_created": 1518198710, "timestamp_updated": 1518198710, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.707783639430999756", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "7971012": {"recommendationid": "7971012", "author": {"steamid": "76561197985064967", "num_games_owned": 59, "num_reviews": 38, "playtime_forever": 905, "playtime_last_two_weeks": 0, "last_played": 1440972104}, "language": "english", "review": "In one way this is the worst of the Half Life franchise, but that said the Half Life series is one of my favourite ones and I still highly recommend this Episode.\n\nYou got nothing new from the moment you left your Buggy until the end of HL2 in this Episode, so a bit of \"platform strategy\" or vulgo \"recycling\" as we sadly know to well from other sequels, but still enjoyable.\n\nThere are not many novelties, but the ones like the \"Zombines\" and flares are welcome and add well to the existing HL2 world.\n\nGraphics are defo a step forward compared to HL2. As far as the story goes, this is really just a connection between HL2 and Episode 2 and nothing terribly new or exciting will be revealed, but by no means boring.\n\nYou got a bit of citadel and super gravity gun action, combined with a hint of Ravenholm in the dark, Sandtraps w/o pheromones and lots of City 17. \n\nBuy it.", "timestamp_created": 1386520459, "timestamp_updated": 1458180098, "voted_up": true, "votes_up": 45, "votes_funny": 0, "weighted_vote_score": "0.69709169864654541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37162105": {"recommendationid": "37162105", "author": {"steamid": "76561198036669862", "num_games_owned": 60, "num_reviews": 10, "playtime_forever": 933, "playtime_last_two_weeks": 0, "last_played": 1403272210}, "language": "english", "review": "Shorter than Half-Life 2 but still a nice continuation to the HL Story", "timestamp_created": 1511461813, "timestamp_updated": 1511461813, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.688574016094207764", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8830264": {"recommendationid": "8830264", "author": {"steamid": "76561198018660341", "num_games_owned": 388, "num_reviews": 82, "playtime_forever": 430, "playtime_last_two_weeks": 0, "last_played": 1391305196}, "language": "english", "review": "Half Life 2: Episode One continues after the events of Half Life 2. While no doubt it is fun and immersive, and let's be honest Co-oping along side Alex.....finally is out right fun. There is nothing really all that new from the first. It is shorter obviously than Half Life 2 and even Half life 2: Episode 2. In my opinion is the weakest of the series so far. It has the same enviroment only this time after the events of the destruction of the Citadel and how the city is hoping with the aftermath. If your a Half Life fan, you need to get this! I had so much fun tagging along side Alex through the entirety of the game. The only real negative I would give is that it's much shorter than Half Life 2 and Episode 2. Don't let that though be the deciding factor of whether or not you make the purchase. Trust me, it's very much worth it!", "timestamp_created": 1390576863, "timestamp_updated": 1390576863, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.712333559989929199", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32856601": {"recommendationid": "32856601", "author": {"steamid": "76561198134803040", "num_games_owned": 147, "num_reviews": 8, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1498541082}, "language": "english", "review": "baby sit alyx for 3 hours the game", "timestamp_created": 1498572992, "timestamp_updated": 1498572992, "voted_up": true, "votes_up": 21, "votes_funny": 20, "weighted_vote_score": "0.673273324966430664", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8376752": {"recommendationid": "8376752", "author": {"steamid": "76561198054241669", "num_games_owned": 241, "num_reviews": 1, "playtime_forever": 276, "playtime_last_two_weeks": 0, "last_played": 1388260827}, "language": "english", "review": "This is a good game for those looking for an extension to the Half Life 2 franchise. It doesn't feel like a crap dlc that's been rushed to simply bring the company in some extra cash. The game has had a considerable amount of thought put into it and it still feels like Half Life. It took me roughly 4 hours to complete this as there are some very challenging parts to this game and sometimes you just don't see what's in plain sight. Would recommend this game and looking forward to playing Episode 2.", "timestamp_created": 1388263638, "timestamp_updated": 1388263638, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.67783123254776001", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43382377": {"recommendationid": "43382377", "author": {"steamid": "76561198119431027", "num_games_owned": 102, "num_reviews": 23, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1530987018}, "language": "english", "review": "\"That makes them a Zombine, get it ? -Alyx\n\n\"Women are funny\" -Eric Cartman", "timestamp_created": 1530987434, "timestamp_updated": 1530987434, "voted_up": true, "votes_up": 12, "votes_funny": 13, "weighted_vote_score": "0.667458891868591309", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "3904836": {"recommendationid": "3904836", "author": {"steamid": "76561198028854369", "num_games_owned": 1382, "num_reviews": 31, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1343026800}, "language": "english", "review": "+ Great story\n+ Great set-pieces\n+ Alyx is the most human NPC ever\n\n- Not as good as HL2 and, definitely, not as spectacular as Episode 2!", "timestamp_created": 1371477288, "timestamp_updated": 1385410718, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.65878903865814209", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32921580": {"recommendationid": "32921580", "author": {"steamid": "76561198143817284", "num_games_owned": 316, "num_reviews": 2, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1498568780}, "language": "english", "review": "A classic.You should have played this by now.Just do it. Seriously.", "timestamp_created": 1498640294, "timestamp_updated": 1498640498, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.662921369075775146", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29905594": {"recommendationid": "29905594", "author": {"steamid": "76561198074927333", "num_games_owned": 759, "num_reviews": 37, "playtime_forever": 282, "playtime_last_two_weeks": 0, "last_played": 1486830101}, "language": "english", "review": "A little bit too short but great anyway", "timestamp_created": 1487008546, "timestamp_updated": 1487008546, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.705983459949493408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43194626": {"recommendationid": "43194626", "author": {"steamid": "76561198134023137", "num_games_owned": 62, "num_reviews": 16, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1530368858}, "language": "english", "review": "This took 21 trading cards and a week of saving up to buy this game. I also had to play that crap Salien game to get trading cards.\n-6 cents\n-12 cents\n-18 cents\n-24 cents\n-30 cents\n-36 cents\n-42 cents\n-48 cents\n-54 cents\n-60 cents\n-66 cents\nWas totally worth 21 trading cards, would do it again.\n", "timestamp_created": 1530384128, "timestamp_updated": 1530384128, "voted_up": true, "votes_up": 15, "votes_funny": 43, "weighted_vote_score": "0.683729112148284912", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12692371": {"recommendationid": "12692371", "author": {"steamid": "76561198133629922", "num_games_owned": 105, "num_reviews": 19, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1414593584}, "language": "english", "review": "The adventure didn't finished with blowing up Citadel. This game is the shortest and most exciting game I have ever seen in my life. In this episode Gordon and Alyx are running away and try to find a way to escape from City 17. There is no new equipment or new weapon. Also in this episode we will see Gordon and Alyx more close together. If you finished Half Life 2 already, you need to buy and play this game definitely.", "timestamp_created": 1414662666, "timestamp_updated": 1414662666, "voted_up": true, "votes_up": 18, "votes_funny": 8, "weighted_vote_score": "0.660212397575378418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10288633": {"recommendationid": "10288633", "author": {"steamid": "76561198029126609", "num_games_owned": 182, "num_reviews": 71, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1401409988}, "language": "english", "review": "If you enjoyed half life 2 you will enjoy this. While the first, second and fifth final chapters are abit lackluster and shallow the game is essentially more half life 2. Its enjoyabile, its cheap its short and continues the half life 2 story. While not as good as half life 2 it has all the action, variety and cleverness of the original.", "timestamp_created": 1401472057, "timestamp_updated": 1401472057, "voted_up": true, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.69524681568145752", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29122998": {"recommendationid": "29122998", "author": {"steamid": "76561198304060785", "num_games_owned": 192, "num_reviews": 32, "playtime_forever": 276, "playtime_last_two_weeks": 0, "last_played": 1484396457}, "language": "english", "review": "*At valve studios*\n\nGabe: Alright everyone! we need to make new stuff for steam and valve\n\nhow about a team fortress 2 update?\n\nMake a widescreen format?\n\nHow about we make half-life 3?\n\nGabe:GET THE HELL OUT !", "timestamp_created": 1483900080, "timestamp_updated": 1483900080, "voted_up": true, "votes_up": 24, "votes_funny": 30, "weighted_vote_score": "0.676721632480621338", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25084155": {"recommendationid": "25084155", "author": {"steamid": "76561198059434609", "num_games_owned": 155, "num_reviews": 29, "playtime_forever": 1901, "playtime_last_two_weeks": 0, "last_played": 1523838240}, "language": "english", "review": "Half-Life 2: Episode One begine right where Half-Life 2 ended, and continues the story of Dr.Gordon Freeman in City 17, however, this time, the priority remains to escape the city following the events of Half-Life 2.\n\nWith updated lighting and AI for deuteragonist Alyx Vance, and expanded usage for the Gravity Gun, Half-Life 2: Episode One continues Half-Life 2's usage of advanced graphics, physics, music and writing to create a game that is both rich in gameplay, plot, and emotion. Like its predecessor, it uses training techniques to allow for a more fluid experience, and utilizes the game's physics engine to a full. With excellent performances by its cast, it's able to greatly explain the story of Gordon and Alyx escaping City 17.\n\nWith an excellent soundtrack composed by Kelly Bailey, the game becomes even more action packed, and the act of blasting zombies in an infected hospital with a shotgun becomes far more enjoyable, and the scene of fighting infected Combine soldiers in the underground becomes more threatening.\n\nThe game also includes Developer commentary in the form of a commentary mode that allows the players to listen to the developers' thoughts on everything from map design to character and scene writing, and includes all variant of Valve Employee sharing their thoughts on the game.\n\nIf I had to say I had any issues with the game, I'd have to say that it's fairly short, while Half-Life 2 is around 12-15 hours long, Episode One is around 5 hours long. That's not to say it's a bad game for that, though, as the story and game runs at a certain pace that allows for it to be enjoyed to the fullest; Replaying the game with the knowledge of how short it is doesn't damage or reduce the enjoyment of playing it, as Valve injects a great deal of fun into the game so there aren't many moments or time that is wasted, and every minute is used to its fullest.\n\nIf you enjoyed Half-Life 2, and want more, I greatly suggest you buy the [url=http://store.steampowered.com/bundle/231/]Half-Life Complete[/url] Steam bundle, preferably during a Steam Seasonal Sale. The bundle consists of this game and every other Valve-released Half-Life title, and is an essential for a fan of Half-Life.", "timestamp_created": 1471920294, "timestamp_updated": 1471920294, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.652265548706054688", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12268194": {"recommendationid": "12268194", "author": {"steamid": "76561198018412369", "num_games_owned": 1116, "num_reviews": 96, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1533147707}, "language": "english", "review": "Half Life 2 Episode 1 came out 2 years after the release of Half Life 2. \n\nIt was called Episode for a reason though. It took me 3 hrs to complete as opposed to 15 hrs Half Life 2 provided. Gameplay wise it doesn't add anything new, so the story is the only fresh thing it can deliver.", "timestamp_created": 1411860964, "timestamp_updated": 1470391829, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.618494033813476563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42397080": {"recommendationid": "42397080", "author": {"steamid": "76561197998465267", "num_games_owned": 393, "num_reviews": 29, "playtime_forever": 1355, "playtime_last_two_weeks": 0, "last_played": 1536814551}, "language": "english", "review": "\"What Kind of Hospital Is This\" is the best OST. Oh, and this episode is absolutely outstanding. Go play it right now!", "timestamp_created": 1527738811, "timestamp_updated": 1527738811, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.666403591632843018", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32164068": {"recommendationid": "32164068", "author": {"steamid": "76561197994962667", "num_games_owned": 179, "num_reviews": 37, "playtime_forever": 707, "playtime_last_two_weeks": 0, "last_played": 1492351183}, "language": "english", "review": "Its HL2, More content is always a plus.", "timestamp_created": 1496533816, "timestamp_updated": 1496533816, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.672819077968597412", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40229853": {"recommendationid": "40229853", "author": {"steamid": "76561198362910986", "num_games_owned": 172, "num_reviews": 32, "playtime_forever": 815, "playtime_last_two_weeks": 0, "last_played": 1526135915}, "language": "english", "review": "haylayf güzel 0yun", "timestamp_created": 1519061168, "timestamp_updated": 1544664206, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.676128029823303223", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "2811436": {"recommendationid": "2811436", "author": {"steamid": "76561198012973159", "num_games_owned": 479, "num_reviews": 36, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1420629128}, "language": "english", "review": "Первый эпизод Half-Life 2 это практически идеальный аддон для шедевральной игры, в котором минимум инноваций соседничает со все тем же восхитительным геймплеем. Не зря многие считают первый эпизод отдельной игрой. Усилий разработчики вложили по максимуму и у них снова, в 2006 году получилось навести улыбку на лица всех фанатов серии. Всего один новый враг и одна новая технология HDR в первом эпизоде послужили отличным примером того, что когда талантливые люди делают с душой свое дело, у них все получается на все 100! Безупречный аддон и маст хев всем фанатам и просто любителям хороших игр.\n\nОценка 8,8/10", "timestamp_created": 1375163902, "timestamp_updated": 1375163902, "voted_up": true, "votes_up": 19, "votes_funny": 5, "weighted_vote_score": "0.672148287296295166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8034201": {"recommendationid": "8034201", "author": {"steamid": "76561197980453253", "num_games_owned": 109, "num_reviews": 14, "playtime_forever": 374, "playtime_last_two_weeks": 0, "last_played": 1268722800}, "language": "english", "review": "If Half Life 2 is awesome, this Episode One is awesome +1.\n\nIt's and excellent game, with great graphics, playability,...\n\nThe only problem of this game is when you arrive at the end. :o)", "timestamp_created": 1386976616, "timestamp_updated": 1386976616, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.621154606342315674", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34074743": {"recommendationid": "34074743", "author": {"steamid": "76561198134455418", "num_games_owned": 3272, "num_reviews": 152, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1548511773}, "language": "english", "review": "When Valve makes a great games in that time. \nHalf-Life 3 pls?", "timestamp_created": 1502081355, "timestamp_updated": 1502081355, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.641229748725891113", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18014836": {"recommendationid": "18014836", "author": {"steamid": "76561197969554875", "num_games_owned": 107, "num_reviews": 26, "playtime_forever": 1110, "playtime_last_two_weeks": 0, "last_played": 1421097446}, "language": "english", "review": "The story of Half-Life 2 continues with Episode One, a must-have for people (like me) who can't get enough of Half-Life 2.\n\nDig deeper into the operations of the Combine as you venture through new areas. With 18 hrs on record I can say there's enough gameplay time in this episode to keep you from socializing for a few days ( ͡° ͜ʖ ͡°)\n\n9/10", "timestamp_created": 1442147886, "timestamp_updated": 1442147886, "voted_up": true, "votes_up": 29, "votes_funny": 18, "weighted_vote_score": "0.686707079410552979", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12939449": {"recommendationid": "12939449", "author": {"steamid": "76561198076151054", "num_games_owned": 639, "num_reviews": 28, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1414580346}, "language": "english", "review": "Continuation of the epic series by valve.\n\nYou start off from where half life 2 ended and make your way through the scariest set of levels in the new trilogy(HL2 trilogy) so far.\n\nDefinitely a must play for all half-life and fps lovers. You just cant skip this game or any games in the half life series for that matter. Get them all and immerse yourself in the complex yet great plot!\n\n10/10", "timestamp_created": 1415988548, "timestamp_updated": 1416717944, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.616574108600616455", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12975619": {"recommendationid": "12975619", "author": {"steamid": "76561198042140572", "num_games_owned": 264, "num_reviews": 4, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1416177684}, "language": "english", "review": "She's waiting on the other side for you, Gordon! You lucky dog you!", "timestamp_created": 1416180881, "timestamp_updated": 1416180881, "voted_up": true, "votes_up": 48, "votes_funny": 41, "weighted_vote_score": "0.685155272483825684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18787918": {"recommendationid": "18787918", "author": {"steamid": "76561198043609914", "num_games_owned": 2360, "num_reviews": 398, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1445977784}, "language": "english", "review": "Half Life 2: Episode One is the direct sequel to Half Life 2, but is it worth the name ?\n\nHalf Life 2: Episode One begins as soon as Half Life 2 ends. We find ourselves in a bad place as the citadel is about to be destroyed and it's gonna take the entire city with it, so you need to escape before the city is destroyed. \n\nThis review will be incredibly short since this is pretty much Half Life 2, I'll just cover the cons and pros of the game.\n\nI want to say this was a bit disappointing playing this episode. Apart from the final mission, the entire game is kind of boring. \n\nThe gameplay is the same thing as in Half Life 2. There's no change whatsoever. There's nothing really new here it's basically the same game as Half Life 2.\n\nThe story is still great. But I think the events leading into what is Episode Two are far more interesting than the entire story of episode one.\n\nMy biggest problem with this game is probably the story. The game is kind of slow in pacing and it's a drag and not to mention it's also incredibly short. \n\nIt took me 2 hours to finish the entire game. There's pretty much no replay value after that. \n\nOverall my feelings towards this episode are still positive. This is as good as the previous Half Life titles, just the story is kind of boring, but apart from that it's a great game.\n\nFinal Rating:\n7/10 - Play it\n\nIf you liked this review please consider giving it a thumbs up and if you disliked the review post in the comments on what you disliked.\n\nFor more reviews follow Snort's Review curator page [url=http://steamcommunity.com/groups/snortsreviews#curation]here[/url] - follow for regular updates on reviews for other games!", "timestamp_created": 1446285425, "timestamp_updated": 1454102955, "voted_up": true, "votes_up": 58, "votes_funny": 3, "weighted_vote_score": "0.705435872077941895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18102341": {"recommendationid": "18102341", "author": {"steamid": "76561198014163253", "num_games_owned": 288, "num_reviews": 289, "playtime_forever": 453, "playtime_last_two_weeks": 0, "last_played": 1442614829}, "language": "english", "review": "[u][b]-Quick Review-[/b][/u]\nHalf-Life 2: Episode One was Developed by Valve Corporation and released 2006. Not much changed from Half-Life 2, this game is a continuation and starts right after the events of Half-Life 2.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=520555541\n\n\n[u][b]-Detailed breakdown review-[/b][/u]\n[b]Story:[/b] After the events that took place in Half-Life 2, Gordon and Alyx Vance are reunited and need to escape City 17. [spoiler]Unfortunately, they cannot escape before the Citadel's core detonates. So Alex and Gordon are forced to enter the Citadel to stabilize the core long enough for them to safely escape.[/spoiler]\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=520555575\n\n[b]Gameplay:[/b] There are only two changes to the core game: First, Alex's AI has been dramatically improved, so she is more helpful and not nearly as annoying as most NPC's that simply repeat the same phrases and actions. Second, you start the game with the Gravity Gun, which is utilized both in combat and puzzle solutions.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=520555594\n\n[b]Achievements:[/b] There are 13 achievements in Half-Life 2: Episode One. Five achievements are unlocked by just completing the game, the rest are achieved by special circumstances. [i](like... “beating the game firing exactly one bullet”, “not killing any stalkers”, or “killing an elite soldier with his own energy ball”)[/i]\nTo be honest, these achievements aren't very bad, this was a relatively easy 100% completed game, compared to others games.\n\n[b]Price:[/b] Half-Life 2: Episode One, is priced at $7.99, unfortunately the game is very short, and this price is a bit high for the amount of time it will take to play through the game. [i](You will probably spend about 5 or 6 hours to beat it)[/i]\nA far better alternative, is to purchase [url=http://store.steampowered.com/sub/469/]The Orange Box[/url] for $19.99, you will purchase: Half-Life 2, Half-Life 2: Episode one, Half Life 2: Episode Two, and Portal.\n\n[b]Conclusion:[/b] Story: Still very good, but unfortunately much shorter then Half-Life 2. Gameplay: Pretty much the same as Half-Life 2, the only difference is you use the Gravity gun much more, and much sooner. Achievements: Straightforward, fairly obtainable 100% completed game. Price: Over priced, wait for a sale, or purchase the Orange Box for the best value.\nI recommend this game to anyone who played Half-Life 2 and wants to continue the story of the Freeman...\n\n[b]Related reviews[/b]\nHere's the URL to see my review for [url=http://steamcommunity.com/id/atratzu/recommended/220] Half-Life 2[/url]\nHere's the URL to see my review for [url=steamcommunity.com/id/atratzu/recommended/420/] Half-Life 2: Episode Two[/url]\nHere's the URL to see my review for Half-Life 3 ...[i](...is what I would say if it was released yet *sob*)[/i]", "timestamp_created": 1442681322, "timestamp_updated": 1442877989, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.676658570766448975", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13526534": {"recommendationid": "13526534", "author": {"steamid": "76561198131348633", "num_games_owned": 176, "num_reviews": 28, "playtime_forever": 280, "playtime_last_two_weeks": 0, "last_played": 1415395303}, "language": "english", "review": "The Half-Life Series has left a legacy for a reason. Enough said. \n\nIf you're planning on buying the games individually, dont. Search the \"Orange Box\" on steam and buy it instead. You get the entire series plus Portal 1, and it comes out cheaper. The Orange Bundle was on sale yesterday for $5 on greenmangaming. Its normally 20 dollars however, which is still a pretty good deal. I think i bought it for $10. so yeah, the bundle can save you some money if you place it on your wishlist and buy it on sale.", "timestamp_created": 1419269333, "timestamp_updated": 1434512810, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.623607397079467773", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13232714": {"recommendationid": "13232714", "author": {"steamid": "76561198080466051", "num_games_owned": 196, "num_reviews": 71, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1397742462}, "language": "english", "review": "My internet cut off so I played the whole game offline.\n\n\nNeedless to say, I didn't get any acheivements and now im depressed.\n\n\ngaben/10", "timestamp_created": 1417738804, "timestamp_updated": 1424124143, "voted_up": true, "votes_up": 68, "votes_funny": 77, "weighted_vote_score": "0.656927883625030518", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27533696": {"recommendationid": "27533696", "author": {"steamid": "76561197984500025", "num_games_owned": 35, "num_reviews": 12, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "Way ahead of it's time. way way ahead. Classic. What more can I say?", "timestamp_created": 1480103554, "timestamp_updated": 1480103554, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.626815617084503174", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26326893": {"recommendationid": "26326893", "author": {"steamid": "76561197982295752", "num_games_owned": 109, "num_reviews": 969, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1435621568}, "language": "english", "review": "This is the continuation of the story from the end of Half-Life 2.\nThis is the classic Valve first person shooter single person campaign. If you buy one game on Steam, this and the Half Life 2 episodes should be it.\nThe classic story of Gordon Freeman.\n Exploreable environments and useable / moveable objects, voiceover actors with alternate conversations. Is linear but you can explore alittle of each map. Autosave works good.  Has a great story. \n", "timestamp_created": 1477872649, "timestamp_updated": 1477872649, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.627989351749420166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33119681": {"recommendationid": "33119681", "author": {"steamid": "76561198082734424", "num_games_owned": 205, "num_reviews": 83, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1485046641}, "language": "english", "review": "No new guns, very short game length, and a story that is basically just you + alyx escaping... Probably the weakest game in the series.\nHowever it's still half life 2 gameplay and a lot of fun.", "timestamp_created": 1498981942, "timestamp_updated": 1498981972, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.620962083339691162", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48657414": {"recommendationid": "48657414", "author": {"steamid": "76561198113542140", "num_games_owned": 869, "num_reviews": 8, "playtime_forever": 212, "playtime_last_two_weeks": 0, "last_played": 1495361669}, "language": "english", "review": "Better than artifact", "timestamp_created": 1548898422, "timestamp_updated": 1548898422, "voted_up": true, "votes_up": 8, "votes_funny": 3, "weighted_vote_score": "0.613224506378173828", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "7927441": {"recommendationid": "7927441", "author": {"steamid": "76561198047035486", "num_games_owned": 749, "num_reviews": 204, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1375008603}, "language": "english", "review": "Quite a good little journey. The whole thing made me almost feel like I was in an interactive movie. Great pace and frequency of the scripted scenes", "timestamp_created": 1386265812, "timestamp_updated": 1386265812, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.610180437564849854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31907274": {"recommendationid": "31907274", "author": {"steamid": "76561198201210981", "num_games_owned": 86, "num_reviews": 42, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1463773835}, "language": "english", "review": "[h1] The good\t[/h1]\n[list]\n[*] Good grapichs, sound and enviroment\n[*] Awesome story\n[*] A really immersive experience!\n[/list]\n\n[h1] The bad[/h1]\n[list]\n[*] It's very short! :/\n[/list]\n\n[h1]Final score: 9/10[/h1]", "timestamp_created": 1495484358, "timestamp_updated": 1514378084, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.645161271095275879", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25896383": {"recommendationid": "25896383", "author": {"steamid": "76561198020125851", "num_games_owned": 12725, "num_reviews": 762, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1475803796}, "language": "english", "review": "[h1]The Aftermath of Half-Life 2 / Expansion[/h1]\nhttps://youtu.be/n5SwnaxClaU\n+ This is essentially a stand-alone expansion to Half-Life 2 that starts off at the same moment that Half-Life 2 ended. This is great for those who have already finished Half-Life 2 and want more content.\n+ Same great gameplay as Half-Life 2, same weapons, nothing dramatically new \n+ Expands on the story, answers some questions, while leaving you still wanting more by the end.\n+ You get to get closer to Stalkers (the creepy looking abominations that you see working at the end of Half-Life 2), and find out what they actually are.\n\n- Fairly short in length. Roughly 2.5 to 3 hours long\n\n~ If you have NOT played Half-Life 2, do NOT play this game first. I'm not really sure why this is a stand-alone game", "timestamp_created": 1475812969, "timestamp_updated": 1475812969, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.597918868064880371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "44897066": {"recommendationid": "44897066", "author": {"steamid": "76561197983055663", "num_games_owned": 45, "num_reviews": 13, "playtime_forever": 427, "playtime_last_two_weeks": 0, "last_played": 1526675173}, "language": "english", "review": "minor lacerations\n\ndetected", "timestamp_created": 1537721902, "timestamp_updated": 1537721902, "voted_up": true, "votes_up": 10, "votes_funny": 10, "weighted_vote_score": "0.636792480945587158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "6582355": {"recommendationid": "6582355", "author": {"steamid": "76561198069635016", "num_games_owned": 1391, "num_reviews": 499, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1375877239}, "language": "english", "review": "Good \"3-hours\" addon with fluid gameplay! 8/10", "timestamp_created": 1375877971, "timestamp_updated": 1385412014, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.680031418800354004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29527227": {"recommendationid": "29527227", "author": {"steamid": "76561198057732029", "num_games_owned": 2152, "num_reviews": 47, "playtime_forever": 460, "playtime_last_two_weeks": 0, "last_played": 1485546922}, "language": "english", "review": "Altough a little short it's just more Half-Life 2 goodness.", "timestamp_created": 1485547711, "timestamp_updated": 1485547711, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.627313017845153809", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17948453": {"recommendationid": "17948453", "author": {"steamid": "76561198129505945", "num_games_owned": 650, "num_reviews": 48, "playtime_forever": 494, "playtime_last_two_weeks": 0, "last_played": 1441646284}, "language": "english", "review": "Let's be honest. Episode One is very short compared to Half Life 2, but it has a greater frequency of action events and happenings. I really like the speed it starts with and they keep it until the \"end\". \n\nSolve puzzles. Let the woman grab a gun and take care of the killing part of the game for you. Don't let her die or you won't make it out alive!!! I like it, I sure like it that way :)", "timestamp_created": 1441744845, "timestamp_updated": 1441744845, "voted_up": true, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.619492828845977783", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25654522": {"recommendationid": "25654522", "author": {"steamid": "76561198234358096", "num_games_owned": 50, "num_reviews": 3, "playtime_forever": 400, "playtime_last_two_weeks": 0, "last_played": 1465240361}, "language": "english", "review": "+ Good Characters\n+ Good price\n+ Good game for shity PC\n+ Good soundtrack\n+ Nothing bad about this the game", "timestamp_created": 1474653540, "timestamp_updated": 1474653540, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.597916245460510254", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33843880": {"recommendationid": "33843880", "author": {"steamid": "76561198120766124", "num_games_owned": 117, "num_reviews": 39, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1500846708}, "language": "english", "review": "It's a sequal to half-life 2. So Obviously It is Amazing.", "timestamp_created": 1501199027, "timestamp_updated": 1501199218, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.58510136604309082", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27331439": {"recommendationid": "27331439", "author": {"steamid": "76561197963596534", "num_games_owned": 1302, "num_reviews": 23, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1422692716}, "language": "english", "review": "Nominated for \"Game That Deserves A Sequel\" Award (2016)", "timestamp_created": 1480025327, "timestamp_updated": 1480025327, "voted_up": true, "votes_up": 21, "votes_funny": 14, "weighted_vote_score": "0.636639952659606934", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32914897": {"recommendationid": "32914897", "author": {"steamid": "76561198333969675", "num_games_owned": 216, "num_reviews": 26, "playtime_forever": 757, "playtime_last_two_weeks": 0, "last_played": 1491406219}, "language": "english", "review": "[i]-Short Lore\n-Fast Gameplay\n-Cool end  [/i]", "timestamp_created": 1498630906, "timestamp_updated": 1509838658, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.603603601455688477", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "23970164": {"recommendationid": "23970164", "author": {"steamid": "76561198196756126", "num_games_owned": 75, "num_reviews": 34, "playtime_forever": 981, "playtime_last_two_weeks": 0, "last_played": 1550650328}, "language": "english", "review": "Half-Life 2: Episode One is science fiction first person shooter game developed by Valve Software on the Source Engine. It tells the continued story of physicist-gone-action-hero Gordon Freeman as he and action-hero-gone-love-interest Alyx Vance escape from the physically unstable City 17 before it blows up I think.\n\nIn my review of Half-Life 2 I definitely wasn't very nice to the game. I said the game was unfocused and average, with interesting ideas and clever storytelling but drawn-out setpeices and a largely uninteresting plot if you remove all that glittery facial animation. Some of that, I think, is still justified but one thing I forgot to mention was how much I actually really like Half-Life 2.\n\nOne thing the HL franchise enjoys doing is pulling the rug out from under the player and then throwing a bunch of enemies at them. That's pretty cool but it's also sort of troubling, considering that most of Half-Life 2 feels very aimless as if Gordon is just drunkenly stumbling between ambushes and set-peices. Episode 1 seemingly tries to fix that by making whatever the current goal is very obvious, either with some kind of environmental clue or with Alyx directly telling you what the objective is:\n\nEscape the tower\nGet to the train station\n\nThe story is more grounded and because of that the gameplay can throw you into as many accidental circumstances and detours as it wants because you always end up back on track. \n\nI also appreciate how the stakes are a lot higher feeling in this game. It isn't just a vague intergalactic business proposition between Breen and some alien terrorist people, the actual city feels like it's about to blow up and if you keep getting interrupted by the combine than everybody involved will actually die. And it isn't just your life that's at stake here, you spend the entire game fighting alongside Alyx Vance, which sounds like a bad idea but this game manages a sidekick-idea very well.\n\nAnybody who played the first game remembers the third act where you command a squad consisting of that guy who sounds like everyone else and a girl who only occasionally dreams of cheese(?) but nobody WANTS to remember that part because not only is it sandwiched between the two best parts of the game but it also is un-doubtably the worst. The AI blocks the player at every turn and is super reliant on Gordon; they will not go anywhere unless you ask them too and they die as quickly as your enemies do so they may as well not be there--heck the game is more fun when they AREN'T there.\n\nThe squad idea comes back in Episode 1 but not only are they more resistant, they seemingly abandon the whole \"Targeting\" thing--they seem to go wherever they want until you start to progress, and most importantly they stay out of the players way. All of this culminates into Alyx who not only follows the player from the very start but is INVULNERABLE to damage. This could make her too powerful but the devs fix that only giving her a pistol until about halfway through, and even before that she's a very good aim. Most of the opening is spent with the player under a variety of handicaps such as only having a gravity gun or not having a ton of ammo and the devs cleverly use Alyx as your second half, which not only ties their mostly plot-based comradery into the gameplay but also makes you feel like a real team by the end.\n\nUltimately I think Episode 1 expands on HL2 and makes the game better. There's only one new enemy and a smaller arsenal than before but the gameplay is tightened and the story in more investing. I'll be the first to admit that my review of HL2 was a bit hyperbolic but I still recommended that game and I absolutely recommend Episode 1 as well", "timestamp_created": 1467331697, "timestamp_updated": 1467332271, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.600805401802062988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25063729": {"recommendationid": "25063729", "author": {"steamid": "76561197988811719", "num_games_owned": 595, "num_reviews": 31, "playtime_forever": 363, "playtime_last_two_weeks": 0, "last_played": 1472663012}, "language": "english", "review": "Don't call yourself a Gamer if you didn't play Half-Life.", "timestamp_created": 1471823992, "timestamp_updated": 1471823992, "voted_up": true, "votes_up": 11, "votes_funny": 4, "weighted_vote_score": "0.6056557297706604", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21533673": {"recommendationid": "21533673", "author": {"steamid": "76561198077817772", "num_games_owned": 1119, "num_reviews": 137, "playtime_forever": 487, "playtime_last_two_weeks": 0, "last_played": 1456693127}, "language": "english", "review": "its a good but short (around 4 to 5h to complet) sequel to the previous hl 2, the story takes off after you blow up the citadel and your main objective is to escape city 17 and this time you will get a closer look at the stalkers and the strange alien like creature that you see in hl 2 and of cours it will leaves you with more unanswered questions .\nthe graphics, sound effect and the gameplay are just like in hl 2 nothing has changed except for the source engin i think ( it looks a bit better visually then hl2) + there is 13 easy achievements\n8/10", "timestamp_created": 1456693571, "timestamp_updated": 1456693571, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.626901865005493164", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "10041430": {"recommendationid": "10041430", "author": {"steamid": "76561197985854272", "num_games_owned": 3708, "num_reviews": 18, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1428563080}, "language": "english", "review": "An amazing, wonderful episode to the Half-Life series", "timestamp_created": 1399440340, "timestamp_updated": 1399441095, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.600094795227050781", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14595853": {"recommendationid": "14595853", "author": {"steamid": "76561198048029513", "num_games_owned": 319, "num_reviews": 120, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1426780504}, "language": "english", "review": "Not quite as good as HL2 but very much worth a go.", "timestamp_created": 1424618842, "timestamp_updated": 1424618842, "voted_up": true, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.620636701583862305", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25173331": {"recommendationid": "25173331", "author": {"steamid": "76561198154745351", "num_games_owned": 29, "num_reviews": 12, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1472328938}, "language": "english", "review": "What a master-piece, seriously, I have no words to exprese what I feel about this game!\n\n", "timestamp_created": 1472265215, "timestamp_updated": 1472265215, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.581749081611633301", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38026993": {"recommendationid": "38026993", "author": {"steamid": "76561198152366953", "num_games_owned": 187, "num_reviews": 10, "playtime_forever": 252, "playtime_last_two_weeks": 0, "last_played": 1512288081}, "language": "english", "review": "I played this immidiately after playing the main game and have to say that the pacing of this game has been nailed down to a crisp! Everything is adjusted to the best possible speed and carefully crafter levels that don't drag on for too long. But for some reason, just like the last game, I didn't feel the urgency at the end. It felt like an episode (which it is) and it lacked the amount of chaos that would have heightened the ending. But it was better than the main game. So a 9/10 for me.", "timestamp_created": 1512291183, "timestamp_updated": 1526757399, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.581041038036346436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36334689": {"recommendationid": "36334689", "author": {"steamid": "76561198178462474", "num_games_owned": 263, "num_reviews": 36, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1481336389}, "language": "english", "review": "\"We'll see about that.\" That's the phrase that begins Half-Life 2: Episode 1, the sequel to Half-Life 2. What's the relevance of these words? There are interpretations but no one knows exactly what it means. What I am sure of is that this is a very good sequel because it makes a good use of the elements that it inherits from Half-life 2.\n\n\n[h1][i][PLOT][/i][/h1]\n\nThe plot continues directly from the ending of Half-Life 2. The quality of the narrative in this continuation is still as good as in the previous game. Everything we experience at the surface covers something that's more in depth, that's a element that is present not only in this game but in all the Half-Life games. We'll never fully know the reason of why those things are happening, we'll only know what we can see through the eyes of Gordon Freeman. That's a sensation I won't ever be able to remove from my thoughts. I love knowing that there's something else behind all, but I hate to know that I'll never get an answer to my questions. It's a blessing and a curse at the same time.\n\n\n[h1][i][GAMEPLAY][/i][/h1]\n\nThe same as Half-Life 2: Excellent controls, movement, gunplay, and physics. The enemies are varied and the situations too. In fact it's due to the good use of the elements to create interesting and fun situations that this sequel doesn't fall into boredom, even with the absence of new elements and mechanics.\n\n\n[h1][i][VISUALS][/i][/h1]\n\nIn this sense it's almost the same as Half-Life 2. Despite the year in which it was released, it was still visually impressive. There isn't a big jump from Half-Life 2 but there's an increase in the details of the textures and small improvements in the lighting. I don't have much more to say, the game is excellent visually.\n\n\n[h1][i][MUSIC & SOUND][/i][/h1]\n\nThe incredible composition of the predecessor is continued in this game and it's incredible. As in the previous two games, each piece of the soundtrack is good on its own and is used at the right moments in the game, thus creating incredible, thought provoking, atmospheric moments, or tense battle moments. The SFX are mostly reused from Half-Life 2 so they are still just as amazing.\n\n\nIn conclusion, this is a very good sequel, however it's thrown back a little because of the lack of new elements or mechanics. Still, I personally enjoyed Half-Life 2: Episode 1 a lot and I recommend it to anyone who likes Half-Life 2 or is interested in playing the complete series.\n\nMy rating is:  [b]8.0 / Very Good.[/b]", "timestamp_created": 1510023955, "timestamp_updated": 1514266693, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.541056156158447266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28516336": {"recommendationid": "28516336", "author": {"steamid": "76561198084213372", "num_games_owned": 1400, "num_reviews": 120, "playtime_forever": 520, "playtime_last_two_weeks": 0, "last_played": 1482355762}, "language": "english", "review": "Well its the first of - so far - two sequels to Half-Life 2.\nIts what you expect, if you loved Half-Life 1-2, youll love this one;\nReally short but a bit new gameplay mechanics and ideas, nice action and a continuation of the great story cliffhanger!\n8,5/10", "timestamp_created": 1482356097, "timestamp_updated": 1482356097, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.605083227157592773", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40793685": {"recommendationid": "40793685", "author": {"steamid": "76561198148725591", "num_games_owned": 59, "num_reviews": 22, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1517099165}, "language": "english", "review": "4 hours of good sequel.", "timestamp_created": 1520966914, "timestamp_updated": 1521680461, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.59330141544342041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33918949": {"recommendationid": "33918949", "author": {"steamid": "76561198008303595", "num_games_owned": 863, "num_reviews": 540, "playtime_forever": 1626, "playtime_last_two_weeks": 0, "last_played": 1501589138}, "language": "english", "review": "At first glance, Half-Life 2: Episode One could be considered a simple add-on. But a closer inspection reveals that VALVe didn’t go down the classical \"more monsters, more weapons\" cliché, but instead opted to refine and fine-tune the already successful Half-Life 2 recipe, by combining monster types during combat, and introducing more puzzles and the \"cooperative singleplayer” mechanic with the help of Alyx.", "timestamp_created": 1501469022, "timestamp_updated": 1501469022, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.318181812763214111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40324645": {"recommendationid": "40324645", "author": {"steamid": "76561198030256405", "num_games_owned": 326, "num_reviews": 47, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1518962858}, "language": "english", "review": "This is little shorter half life 2 expansion of the story but still love it and its action packed, not so hard as other ones but still enjoable! Not so fun, tho one mission is kind repetetive and not so action packed but still loved it! 10/10", "timestamp_created": 1519383587, "timestamp_updated": 1519383587, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.59313434362411499", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23829452": {"recommendationid": "23829452", "author": {"steamid": "76561198094091465", "num_games_owned": 321, "num_reviews": 35, "playtime_forever": 538, "playtime_last_two_weeks": 0, "last_played": 1473152078}, "language": "english", "review": "if not played half life you lose half your life\n\n-العالم سورس", "timestamp_created": 1466950727, "timestamp_updated": 1466950727, "voted_up": true, "votes_up": 14, "votes_funny": 12, "weighted_vote_score": "0.609549522399902344", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36264274": {"recommendationid": "36264274", "author": {"steamid": "76561198318634255", "num_games_owned": 68, "num_reviews": 45, "playtime_forever": 564, "playtime_last_two_weeks": 0, "last_played": 1538653664}, "language": "english", "review": "Episode One... it's short, but it's very nice and interesting going trough the war-torn City 17.", "timestamp_created": 1509786716, "timestamp_updated": 1509786716, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.551302194595336914", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34817435": {"recommendationid": "34817435", "author": {"steamid": "76561198081154859", "num_games_owned": 286, "num_reviews": 25, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1500347864}, "language": "english", "review": "[h1]The saga continues[/h1]\n\nExcellent game that have almost all pros and cons from the previous game, but of course in a lower scale,  So you must play it if you want to understand the history. As I said before, the gameplay is a miniature of half life 2 with  better graphics, even there's no new things, still very enjoyable.\n\nI HIGHLY RECOMEND IT.\n\nScore:9,0/10", "timestamp_created": 1504885993, "timestamp_updated": 1507499716, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36335370": {"recommendationid": "36335370", "author": {"steamid": "76561198063936226", "num_games_owned": 86, "num_reviews": 7, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1510026914}, "language": "english", "review": "Half-Life 2: Episode 1 is practically DLC for the Half-Life 2. Not that it's not a full game, it's just very short. I was able to finish it in about 5 hours, if my Steam time tracking do-bober is to be believed. Now, this game was amazing and is great to play right after Half-Life 2. If you played Half-Life 2, play this one! If you haven't, play Half-Life 2 first! These are both amazing games and there is no reason NOT to play it.", "timestamp_created": 1510027404, "timestamp_updated": 1510027404, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.531914889812469482", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32871992": {"recommendationid": "32871992", "author": {"steamid": "76561198103895131", "num_games_owned": 97, "num_reviews": 7, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1411392391}, "language": "english", "review": "Legend. The game is good, long and has a great combat. Story is great, music is great, graphics are...great at the time of release tho for 2017 standards not so good.\n\nEveryone who likes a bit of action and puzzle solving will enjoy. I promise.", "timestamp_created": 1498587054, "timestamp_updated": 1498587054, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.581749081611633301", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41623817": {"recommendationid": "41623817", "author": {"steamid": "76561198139048119", "num_games_owned": 19, "num_reviews": 15, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1486279193}, "language": "english", "review": "After finishing the original Half Life 2 game, I found out about this and I had to play it\n\nI do not regret my decision", "timestamp_created": 1524398057, "timestamp_updated": 1524398057, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.532724320888519287", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23403110": {"recommendationid": "23403110", "author": {"steamid": "76561198044534939", "num_games_owned": 691, "num_reviews": 23, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1465143100}, "language": "english", "review": "Oh my god! I had never played any of HL2's sequels, but damn, have I missed a lot!\nThis game is epic!\n\nIt's a 3 hour long ride that's so wild and intense that makes all other action games feel dull and flat.\nBut... what am I talking about? There are no other action games! There's only one king, and Half-Life is his name.\n\nA must play!", "timestamp_created": 1465143779, "timestamp_updated": 1465564628, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.593919217586517334", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28540017": {"recommendationid": "28540017", "author": {"steamid": "76561197970726560", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 387, "playtime_last_two_weeks": 0, "last_played": 1527456384}, "language": "english", "review": "If you play half life 2, you should play this. Can we get episode three now? I've waited for so long!", "timestamp_created": 1482445881, "timestamp_updated": 1482445881, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.591988146305084229", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "6189219": {"recommendationid": "6189219", "author": {"steamid": "76561198060869595", "num_games_owned": 488, "num_reviews": 52, "playtime_forever": 805, "playtime_last_two_weeks": 0, "last_played": 1548810956}, "language": "english", "review": "Good expansion to Half life 2.", "timestamp_created": 1345649601, "timestamp_updated": 1450753358, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.60120844841003418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23283966": {"recommendationid": "23283966", "author": {"steamid": "76561198013735252", "num_games_owned": 663, "num_reviews": 191, "playtime_forever": 204, "playtime_last_two_weeks": 0, "last_played": 1464565488}, "language": "english", "review": "Half-Life 2: Episode One continues the story of Half-Life 2 with another adventure of Gordon Freeman and Alyx. The story picks up right away after the original game and offers more of the same as the original. There's nothing really new to note here besides some new enemies and a level that puts good use of the flashlight; you also have Alyx by your side the entire time - which allows for some unique gameplay, such as not firing any bullets and only using the gravity gun. Episode One is somewhat short, I was able to complete the game in ~3 hours.", "timestamp_created": 1464574301, "timestamp_updated": 1464574362, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.611839711666107178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29378697": {"recommendationid": "29378697", "author": {"steamid": "76561198026486730", "num_games_owned": 1477, "num_reviews": 137, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1404877429}, "language": "english", "review": "It's not nearly as long as Half-Life 2, which explains why its Episode One instead of Half-Life 3. It's a solid game that extends HL2 and really just leaves you wanting more, which is good because there's Episode Two.\n\nEasy 100%\n\n(10/10)^2 Episode One", "timestamp_created": 1484930303, "timestamp_updated": 1484930303, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.584709823131561279", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30064625": {"recommendationid": "30064625", "author": {"steamid": "76561198055287807", "num_games_owned": 85, "num_reviews": 32, "playtime_forever": 276, "playtime_last_two_weeks": 0, "last_played": 1538374743}, "language": "english", "review": "*gets past combine defense successfully*\n*gets to core*\n*kills stalkers*\n*doesnt know what to do after inputting a device that \"drains the core\"\n\n*mounts the game on gmod and spins the ragdolls*\n\n10/10 would spin ragdolls again", "timestamp_created": 1487619285, "timestamp_updated": 1487619285, "voted_up": true, "votes_up": 7, "votes_funny": 7, "weighted_vote_score": "0.594450771808624268", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "47980039": {"recommendationid": "47980039", "author": {"steamid": "76561198106681718", "num_games_owned": 77, "num_reviews": 14, "playtime_forever": 574, "playtime_last_two_weeks": 0, "last_played": 1448742048}, "language": "english", "review": "--- 𝐆𝐀𝐌𝐄𝐏𝐋𝐀𝐘 ---\n☑ Very good\n☐ Fine\n☐ Average\n☐ Meh\n☐ Playing on a mobile is more fun\n\n--- 𝐒𝐓𝐎𝐑𝐘 ---\n☐ The author must be a mastermind\n☑ Good\n☐ It‘s a story, indeed         \n☐ Uninteresting\n☐ None\n\n--- 𝐆𝐑𝐀𝐏𝐇𝐈𝐂𝐒 ---\n☐ Reality looks like Minecraft\n☑ Good\n☐ Okay\n☐ Meh\n☐ Minecraft\n\n--- 𝐀𝐔𝐃𝐈𝐎 ---\n☐ Eargasm\n☑ Good\n☐ Listenable\n☐ Ouch\n☐ My ears are bleeding\n\n--- 𝐁𝐔𝐆𝐒 ---\n☑ Not a single one\n☐ Some\n☐ A bit too many\n☐ Almost unplayable\n☐ Unplayable\n\n--- 𝐃𝐈𝐅𝐅𝐈𝐂𝐔𝐋𝐓𝐘 ---\n☐ Dark Souls\n☐ Hard\n☑ Normal\n☐ Easy\n☐ An embryo could play it\n\n--- 𝐆𝐑𝐈𝐍𝐃 ---\n☐ Grind only\n☐ A lot\n☐ Some\n☐ Almost none\n☑ None\n\n--- 𝐆𝐀𝐌𝐄 𝐓𝐈𝐌𝐄 ---\n☑ over 100 hours\n☐ 50 - 100 hours\n☐ 20 - 50 hours\n☐ 10 - 20 hours\n☑ under 10 hours\n\n--- 𝐏𝐂 𝐑𝐄𝐐𝐔𝐈𝐑𝐄𝐌𝐄𝐍𝐓𝐒 ---\n☐ NASA would have problems playing it\n☐ High\n☑ Normal\n☑ Low\n☐ You could use your toaster\n\n--- 𝐏𝐑𝐈𝐂𝐄 ---\n☐ Too expensive\n☐ Worth the high price\n☑ Fine\n☐ An apple is more expensive\n☐ Free to play", "timestamp_created": 1546243244, "timestamp_updated": 1546243244, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.607142865657806396", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34478216": {"recommendationid": "34478216", "author": {"steamid": "76561198000112165", "num_games_owned": 445, "num_reviews": 111, "playtime_forever": 524, "playtime_last_two_weeks": 0, "last_played": 1389135273}, "language": "english", "review": "Episode 1 was the one where Alyx follows you about.\n\nPros:\n- Alyx has nice AI\n\nCons:\n- seriously... nothing stands out for this episode: good solid experience but a bit meh in places.\n\nSummary:\nA decent follow-up episode to Half-Life 2.\n\n7/10 - nice for plot, moves things along in the canon.\n\n\n[h1]All [url=https://steamcommunity.com/id/boyflea/][i]boyflea[/i][/url] reviews can be found at [url=https://store.steampowered.com/curator/33138741-Good-Indie-Free-Game-Reviews/][b]Good Indie Free Game Reviews[/b] [/url][/h1]\n\nhttps://store.steampowered.com/app/717190", "timestamp_created": 1503656708, "timestamp_updated": 1546106275, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.560928523540496826", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33212880": {"recommendationid": "33212880", "author": {"steamid": "76561198045527176", "num_games_owned": 865, "num_reviews": 62, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1499138077}, "language": "english", "review": "A worthy continuation of the main series. It was a welcome change to be joined by a useful and competent companion. Quite a stark contrast to the bleak and lonely nature of the previous Half-Life installments. The game introduces several unique mechanics slowly and intuitively. The episode is pleasantly brief and digestible within a good 3-4 hours. \n\nDefinitely worth playing directly after finishing the main story in Half-Life 2.", "timestamp_created": 1499138245, "timestamp_updated": 1499138245, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.538727223873138428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10226903": {"recommendationid": "10226903", "author": {"steamid": "76561198074490336", "num_games_owned": 551, "num_reviews": 43, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1400999838}, "language": "english", "review": "Alyx is just great in this game! Smart and helpful! About this journy, just was epic! Is kind a challenge get the archievements but in a funny way. Like Half Life 2, great enviroment and good dialogues. Recommended", "timestamp_created": 1401000496, "timestamp_updated": 1413194507, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.594232261180877686", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25958021": {"recommendationid": "25958021", "author": {"steamid": "76561198044131190", "num_games_owned": 167, "num_reviews": 15, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1469469010}, "language": "english", "review": "-Walk into room\n-See two people sitting on couch watching TV\n-Use my gravity gun to rip the TV off the wall\n-Throw TV at people sitting on couch, killing them both\n-Alyx nods at me approvingly \"You're right Gordon, this is no time to be watching TV.\"\n-10/10 would not watch the TV again", "timestamp_created": 1476057962, "timestamp_updated": 1476057962, "voted_up": true, "votes_up": 9, "votes_funny": 9, "weighted_vote_score": "0.57892376184463501", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38105193": {"recommendationid": "38105193", "author": {"steamid": "76561197995378175", "num_games_owned": 3785, "num_reviews": 80, "playtime_forever": 536, "playtime_last_two_weeks": 0, "last_played": 1419448382}, "language": "english", "review": "You survive a massive explosion only to find out your waifu is missing and you have to fight your way back thru a hellish city and take a nice relaxing train ride", "timestamp_created": 1512572339, "timestamp_updated": 1512572339, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.59349590539932251", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48737650": {"recommendationid": "48737650", "author": {"steamid": "76561198139904850", "num_games_owned": 106, "num_reviews": 18, "playtime_forever": 259, "playtime_last_two_weeks": 0, "last_played": 1544465609}, "language": "english", "review": "My rating: 9/10\n\n---{Graphics}---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don't look too long at it\n\n---{Gameplay}---\n☑ Amazing\n☐ Good\n☐ Average\n☐ Mehh\n☐ Starring at walls is better\n☐ Just don't\n\n---{Audio}---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ Mute it\n\n---{Audience}---\n☐ Kids\n☐ Teens\n☐ Adults\n☑ Human\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☑ Potato\n☐ Average\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if it has a spare computer\n\n---{Difficulity}---\n☐ Depends upon your in-game choices\n☐ Just press keys\n☐ Easy\n☑ Significant brain usage / average\n☐ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n\n---{Story}---\n☐ Story?\n☐ Mehh\n☐ Average\n☐ Good\n☑ Amazing\n☐ It'll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ LONG\n☐ Endless\n\n---{Price}---\n☑ Worth the price\n☐ Only if on sale\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☑ None\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs", "timestamp_created": 1549210849, "timestamp_updated": 1549210849, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.60000002384185791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33879901": {"recommendationid": "33879901", "author": {"steamid": "76561198332149055", "num_games_owned": 24, "num_reviews": 9, "playtime_forever": 487, "playtime_last_two_weeks": 0, "last_played": 1501331639}, "language": "english", "review": "This game is good af, i totally recommend it", "timestamp_created": 1501331882, "timestamp_updated": 1501331882, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.550102293491363525", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8573692": {"recommendationid": "8573692", "author": {"steamid": "76561198064969517", "num_games_owned": 2934, "num_reviews": 81, "playtime_forever": 809, "playtime_last_two_weeks": 0, "last_played": 1449567350}, "language": "english", "review": "Half-Life 2: Episode One is a first-person shooter game from Valve. It is a sequel to the previous game, Half-Life 2.\n\nHalf-Life 2: Episode One continues Gordon Freeman story from Half-Life 2 following the destruction of the Combine Citadel Dark Fusion reactor. In this episode you have to buy the resistance and yourself more time to escape City 17 and then escape with them, but it's not going to be a short one. I recommend this.\n\nHalf-Life 2: Episode One also focuses on AI companion. Alyx will accompany you 80% of the time and she is very helpful. But you also need to help her help you in some level.\n\nRating 10/10", "timestamp_created": 1388932171, "timestamp_updated": 1404110258, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.603284239768981934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42492315": {"recommendationid": "42492315", "author": {"steamid": "76561198259243553", "num_games_owned": 46, "num_reviews": 19, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1522434464}, "language": "english", "review": "It's Half Life 2 but with godawful mechanics tacked onto it. It's the only HL game I can clearly say I dislike.\n\nWhy is that dark elevator segment even a thing\n\nWhy do they not give you a melee weapon until the end of the game \n\nWhy are infinite enemy waves a thing\n\nWhy is the scenery so dull compared to HL2 and HL2ep2\n\nThis game is a blemish on an otherwise amazing franchise.", "timestamp_created": 1528127285, "timestamp_updated": 1528127285, "voted_up": false, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.60241854190826416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "3536179": {"recommendationid": "3536179", "author": {"steamid": "76561198024354933", "num_games_owned": 865, "num_reviews": 37, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1343890800}, "language": "english", "review": "A nice 4-hour continuation, it's an extended escape sequence with a great finale. Not much new story-wise, but that's no reason not to enjoy the gameplay unless you're a dick. You're not a dick, are you?", "timestamp_created": 1344056559, "timestamp_updated": 1344056559, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.57423931360244751", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31866869": {"recommendationid": "31866869", "author": {"steamid": "76561198112835346", "num_games_owned": 63, "num_reviews": 43, "playtime_forever": 1966, "playtime_last_two_weeks": 0, "last_played": 1536956400}, "language": "english", "review": "Half-Life 2 Episode One is short , but is funny , I recommended :)", "timestamp_created": 1495306417, "timestamp_updated": 1495306486, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.56985020637512207", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20932175": {"recommendationid": "20932175", "author": {"steamid": "76561198129746259", "num_games_owned": 40, "num_reviews": 5, "playtime_forever": 115, "playtime_last_two_weeks": 0, "last_played": 1425187194}, "language": "english", "review": "Finishing this game only left me wanting more.\n\nAwesome game loved it.", "timestamp_created": 1454509668, "timestamp_updated": 1454509668, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.60883176326751709", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25443647": {"recommendationid": "25443647", "author": {"steamid": "76561198119980804", "num_games_owned": 99, "num_reviews": 38, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1434455408}, "language": "english", "review": "Short episode but worth it and I am still waiting for Half-Life 3 or Half-Life 2: Episode three", "timestamp_created": 1473516380, "timestamp_updated": 1473516380, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.55834650993347168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11816576": {"recommendationid": "11816576", "author": {"steamid": "76561198071246716", "num_games_owned": 123, "num_reviews": 52, "playtime_forever": 1491, "playtime_last_two_weeks": 135, "last_played": 1551077996}, "language": "english", "review": "It's a lot shorter, but it's an important game to bridge the story between HL2 and episode 2.", "timestamp_created": 1408695243, "timestamp_updated": 1408695243, "voted_up": true, "votes_up": 6, "votes_funny": 3, "weighted_vote_score": "0.588316023349761963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20145635": {"recommendationid": "20145635", "author": {"steamid": "76561198064106555", "num_games_owned": 3040, "num_reviews": 340, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1451523186}, "language": "english", "review": "[b][h1]Milestones In Gaming Never Get Old[/h1][/b]\n\nThere is not a lot left to say about HL2. We all agree that it lifted the genre to the [b]next the level[/b]. \n\nI have to confess however that I haven't played HL2 Episode One at all during the last 9 years and that I did not even touch it during the last 4 years that I have it in my library. [b][h1] THIS WAS A GREAT MISTAKE AND I REGRET IT[/h1][/b]\n\nThis 9 year old Stand-Alone Expansion of HL2 is [b]perfect[/b]: story, characters, puzzles, innovation, action, design and even the graphics are still on a very high level and way ahead of some newer games. And it runs like butter...\n\nNew features like [h1]VR or 3D Vision[/h1] lift HL2 in general into the new age of virtual reality, of gaming. I played it with 3D vision and had a great blast wandering through City 17, the Citadel. \n\n[h1]HIGHLY RECOMMENDED! [/h1]\n\n[i][h1]If you have it in your library since a long time, but never touched it, never installed it - like I did. Do not wait any longer. 9 years have been enough. GREAT GAME.[/h1][/i]\n\n[i] Twitch Channel : https://www.twitch.tv/mrorange55\nYoutube Channel : https://www.youtube.com/channel/UC1UE5TPoF0HX0HVpF_E4uPQ/videos?view_as=subscriber [/i]", "timestamp_created": 1451560288, "timestamp_updated": 1514725600, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.609239876270294189", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22337407": {"recommendationid": "22337407", "author": {"steamid": "76561198010713496", "num_games_owned": 87, "num_reviews": 8, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1460289161}, "language": "english", "review": "This is my favorite half-life game.", "timestamp_created": 1460287849, "timestamp_updated": 1460287849, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.565217375755310059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25557465": {"recommendationid": "25557465", "author": {"steamid": "76561198035946000", "num_games_owned": 502, "num_reviews": 262, "playtime_forever": 259, "playtime_last_two_weeks": 0, "last_played": 1433471485}, "language": "english", "review": "A Game designed for PC.  Completely unique feeling which we are unfortunately forgetting today, flooded by console-ported junk and lack of dedication from mercantile designers.", "timestamp_created": 1474151934, "timestamp_updated": 1474151934, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.531311571598052979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35612528": {"recommendationid": "35612528", "author": {"steamid": "76561198373847005", "num_games_owned": 241, "num_reviews": 138, "playtime_forever": 275, "playtime_last_two_weeks": 0, "last_played": 1507890462}, "language": "english", "review": "The Characters are beter (funnier and really feel like there people with a story and a personality)\nThe Levels tedious (still mind boggling at times, harder)\nthe game is way smaller than HL2 but i guess it makes sence\n*once again the game is* 10/10 must buy :D\n\nThat elevator part gives me ptsd", "timestamp_created": 1507622394, "timestamp_updated": 1514617876, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.552845537662506104", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38819872": {"recommendationid": "38819872", "author": {"steamid": "76561198152175767", "num_games_owned": 139, "num_reviews": 34, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1514556386}, "language": "english", "review": "Half-Life 2: Episode One, Is a great follow-up to the original Half-Life 2. While the game is basically, \"What if Half-Life 2, was co-op?\" The game was fun, all 5 Chapters. Yes, this game is VERY short compared to HL2. As a person who did The One Free Bullet achevement, I can say that added alot of fun and challenge, even though I used the hell out of the RPG. While this game falls a bit short of being better then HL2 because of the length, its amazing.", "timestamp_created": 1514556599, "timestamp_updated": 1514556599, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.576690495014190674", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13157932": {"recommendationid": "13157932", "author": {"steamid": "76561198150274551", "num_games_owned": 337, "num_reviews": 79, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1413422192}, "language": "english", "review": "It's like more of half-life 2. If you want more half-life 2 you'll like this game. If you haven't played half-life 2, it's an action sci-fi shooter. I also recommend Half-Life 2.", "timestamp_created": 1417335006, "timestamp_updated": 1417335006, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.560293138027191162", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 2, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 3547, "total_negative": 265, "total_reviews": 3812}}
