{"reviews": {"10240064": {"recommendationid": "10240064", "author": {"steamid": "76561198074638014", "num_games_owned": 97, "num_reviews": 15, "playtime_forever": 111983, "playtime_last_two_weeks": 0, "last_played": 1498034995}, "language": "english", "review": "Don't usually comment or write reviews, but when a game is this old and still brings out free content u have to give them credit, in today's sad monetized gaming industry of Season passes, online passes, launch day dlc, early access, etc.\n\nI got into KF pretty late, around couple yrs ago. The first 5 mins I thought this is the biggest pile of crap I've ever purchased. Graphics are ugly, wave after wave in the same smallish map?!?! Why on earth are ppl still playing this game? I put it in my trash list.\n\nThe following day I had a strange urge to try it again, for whatever reason I don't know. I soon realised this game is not about arcadey run n shoot n regen health bs. This game's depth is about u as a team player and improving yr skills to take on bosses and tight situations. Reading the danger signs, when to run when to hold ground. You won't suddenly level up and get a powerful weapon, u only progress with improving yr gameplay.\n\nThe weapon mechanics are simply amazing. WARNING: after playing with no aim cursor and using only ironsights all other cursor games will suck.\n\nThen there is the community made content. More guns, maps, zeds, bosses.....I have over 1500hrs entertainment time and I only paid $5. I think I bought some dlc just to support devs but its not enough for what they've achieved. I don't usually buy newly released games, the ones I've bought I've regret. But when KF2 comes out....just take my money, take it. Please.\n\nTLDR: Buy the game. There's not many devs that care about their product.", "timestamp_created": 1401104989, "timestamp_updated": 1401104989, "voted_up": true, "votes_up": 463, "votes_funny": 1, "weighted_vote_score": "0.925155758857727051", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32497158": {"recommendationid": "32497158", "author": {"steamid": "76561198024730417", "num_games_owned": 318, "num_reviews": 75, "playtime_forever": 857, "playtime_last_two_weeks": 0, "last_played": 1543151975}, "language": "english", "review": "Bloody great fixed and revamped retail version of the UT2004 Co-operative survival horror mod developed back in 2005. Set in possibly near future, in London, where a military contract project to create super soldiers goes wrong and the unfinished clone mutants have laid waste to everything in their way..\nWhat's good:\n\nThe gunplay..oh MAYN the gunplay. Excellent gunshot noises, they sound simply such that they never get old, there's sharp reports and then there's more pew type for some weapons, all sounds fit their weapon. Also reload sounds are nice, almost no stock sound effects, and even where there is those, they are modified so it's fine with me. The TWI made reload sounds are great, not any overly sharp or crisp cheesy clatter etc..Also animations are fluid, the weapons have a fittingly harsh recoil, not realistic yes but who the f*** wants realistic guns in KF? Also the weapons shake your vision nicely, gives a nice harsh physical feedback into firing your guns..alright let's not write a book.\n\nThe Zed Time feature, randomly a slow-motion kicks in that lasts for a couple of seconds, lets you see them nice gun animations in detail, Specimens getting their limbs torn, heads popped and with demolitions slowly seeing how they turn to red paste..also it lets you catch a grasp accurately on what's going on around you, you can look around a bit to think what to do once the game speed returns to normal.\n\nSpecimen visual designs and their behavior, all of them have some kind of purpose to help and murder those damn survivors for once. They look suitably scuffed, grimy and some a bit grotesque and quite intimidating. Some of them are still pretty much human but others are full on cyborg mutants and have proper body horror and look disfigured. So their behavior then..so as I said all of them cooperate with their complementary to each other tactics, for example Clots aren't that bad even in groups but if they grab you you're in for a bad time because the bigger muties can get to pummel and bash you unhindered or simply a swarm of lesser specimens might overpower you. And Husks prevent players from being safe by simply staying away..those ♥♥♥♥ERS will no doubt at some point remove a good chunk of your precious armor and deal over the course of a few seconds a moderate dent to your health. Bloats can massively impede a readily panicking player from aiming properly and seeing what's going around themself. Crawlers often finish a lone terminally injured player who was just about to get some distance and continue fighting.\n\nGreat level variety, some of them almost solely outdoors maps, some a good 50/50 mix of outdoors and indoors, both viable camping areas. Also there are night time, evening etc maps and some with quite somber weather. Some have very nice vertical axis variation too!\n\n-Proper weapon variety in each class, in some classes though it's rather damage per second difference vs. one shot damage. But a weapon with high DPS vs one hit power suits some purposes better. \n\n-Pretty good gore system for being in 2004 era game engine. Same gore effects apply to both players and the specimens I may add. Dismemberment can happen, at the limb joints and of course neck, leaving visible bone and roughly torn flesh and blood spraying too. The next level of gore is that a specimen either loses half of all his limbs or simply gets turned to small chunks and red mist which looks endlessly satisfying as a Demolitions. So yeah pretty nice gore, it can be quite terrifying to see your player get torn to pieces by a Fleshpound's pummeling.\n\n-Raw soundtrack, most of it badass Industrial by zYnthetic, and then a smaller bunch of action tracks are more standard metal. Fuels your rampage suitably. At downtime there plays some well done ambient music, pretty much all of it too by zYnthetic.\n\nWhat isn't good..\n\n-Removal of the great weather effects and ambient sounds in the maps Westlondon, Manor, Bioticslab, Offices. In the mod version 2.5 atleast, these maps had amazing atmosphere.\n\n-The slight lack of voicepack variety, could have been like 4 different voices or so. I do like the voice acting though, it's silly and not all too good but in a charming way.\n\n-You can't disable Trader's lines while still keeping the random player chatter on..", "timestamp_created": 1497686376, "timestamp_updated": 1497686376, "voted_up": true, "votes_up": 73, "votes_funny": 4, "weighted_vote_score": "0.88624417781829834", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "7750966": {"recommendationid": "7750966", "author": {"steamid": "76561198013975708", "num_games_owned": 159, "num_reviews": 1, "playtime_forever": 23993, "playtime_last_two_weeks": 0, "last_played": 1437619390}, "language": "english", "review": "EDIT: Killing Floor 2 is now fully released.\n\nI've been playing Killing Floor for years and it is without a doubt one of my favourite games here.\n\n+ The combat and carnage is unparalleled: explosions, dismemberment, and headshots look and sound great\n+ The class and perk system is incredibly robust: classes have unique roles, pros/cons, levelling is addictive\n+ Huge variety of weapons and maps adds a ton of replayability\n+ Best free seasonal updates of any game out there\n\nFair warning, this is a skill-based game and it is difficult. Newcomers should start on Normal difficulty to learn the ropes and have fun. Playing on Suicidal and Hell On Earth requires a lot of experience, working as a team, and in-depth knowledge of game mechanics. For many people however - myself included - this is the real draw of the game. If you put in the time, playing on HoE with 5 other experienced players all working together is some of the most fun you can have online. There is also nothing more exhilarating than being the last one alive on Wave 10 knowing your entire team is watching and relying on you to stay alive.\n\nHighly recommended.", "timestamp_created": 1385419705, "timestamp_updated": 1479932326, "voted_up": true, "votes_up": 872, "votes_funny": 3, "weighted_vote_score": "0.934006452560424805", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43528386": {"recommendationid": "43528386", "author": {"steamid": "76561198120950910", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 956, "playtime_last_two_weeks": 0, "last_played": 1531657488}, "language": "english", "review": "this purchase is dedicated to my awesome friend (Gerald John Santos) who passed away last april of 2018 . we have been playing this game ever since college also we were broke and we have to pirate the game . tons of hours lost in this game . i made up my mind once i have enough money this will be my 1st purchase here in steam . thanks for the fun memories hope you enjoy your self there in heaven  Gerald!", "timestamp_created": 1531586704, "timestamp_updated": 1531586704, "voted_up": true, "votes_up": 88, "votes_funny": 3, "weighted_vote_score": "0.879752933979034424", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9881535": {"recommendationid": "9881535", "author": {"steamid": "76561198011580188", "num_games_owned": 75, "num_reviews": 7, "playtime_forever": 198107, "playtime_last_two_weeks": 0, "last_played": 1514588106}, "language": "english", "review": "In my 40 years of video game experience I feel Killing Floor is one of the best FPS games ever made.\n    The depth of the game is great.  As much as the game focuses on multiplayer  and teamwork and the game shines in those respects.. the solo side of the game is perfectly balanced to make it a great experience also.   \n     As you progress in difficulty the money gets less and it becomes harder to make sure you have the weapons you need when you need them, but as you progress in level your weapons become cheaper and more powerful.  The enemy is varied and as you get in higher difficulties you need to develop the tactics to take the tough ones down safely.  Many tactical skills can  be employed beyond defending one area and who is best suited to kill what depending on choice of class.  Situational tactics like target priority and when to run and how to \"kite\", knowing when you come round a corner to come face to face with a crowd of enemy, just what ones you want to smack once and keep going, kill outright or just keep on keepin' on.   Add to that an active modding community with extra maps, game types, mod weapons, games and modded monsters... free for download.\n      Not that you have to play it that serious either, many people just find a level they are happy with and just kill stuff for fun... that is one of the great things about the game ... you can play it at any level you desire, but the challenge is there if you seek it.\n       Things I see as a big plus.\n             NO PvP  - you will not get \"spys\" or cheaters spoiling other peoples fun.  There is one modded game type GunGame that is Player vs Player, but the normal game dose not.\n              NO set enemy spawns, in games like some of the ghost recon type games, splinter cell types is that once you figure out a way it gets boring and tedious.  This game is a complete open environment and the enemy can spawn just about anyplace in relation to player position, so even a game played the same way can have different combinations of enemy at any one time.\n      For reference, other games I consider top notch FPS  -  Unreal Tournament, Quake 3 and Team Arena, BF2142   I consider Killing Floor better than them all.  2000 hours in 6 months speaks for itself.... along with 600 hrs in the free SDK making new maps.   If you like FPS and don't own it, you owe it to yourself to get it.  I have spent $1000's over the years on games that were little better than drink coasters... the money I spent on this game has been the best entertainment value of my life!!\n\nedit - as of Nov 2015 3000 hours in game and 2000 hours in the SDK with 36 workshop submissions, most of those original new maps.  An additional 1000 hours on alt accounts for map testing.   Even with KF2 out this game is still well worth getting!\n\nNov 23 2016 Nominated for \"Test of Time\" award.", "timestamp_created": 1398002814, "timestamp_updated": 1479951195, "voted_up": true, "votes_up": 841, "votes_funny": 2, "weighted_vote_score": "0.900126218795776367", "comment_count": 40, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18435206": {"recommendationid": "18435206", "author": {"steamid": "76561198069617717", "num_games_owned": 543, "num_reviews": 1, "playtime_forever": 201851, "playtime_last_two_weeks": 0, "last_played": 1512010653}, "language": "english", "review": "Absolutely the best co-op survival horror game. With a very good amount of achievements, maps, weapons and enemies. Great game to play with friends. I strongly advise to buy it, this game will give you thousands of hours of fun.", "timestamp_created": 1444601217, "timestamp_updated": 1456715396, "voted_up": true, "votes_up": 174, "votes_funny": 19, "weighted_vote_score": "0.877323508262634277", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "8740013": {"recommendationid": "8740013", "author": {"steamid": "76561198001933176", "num_games_owned": 798, "num_reviews": 30, "playtime_forever": 206513, "playtime_last_two_weeks": 0, "last_played": 1429083025}, "language": "english", "review": "After playing a total of 126 hrs, I could honestly say this is my favorite zombie FPS style game. The game is incredibly fun and takes strategy to master, especially when attempting to play on the Hell on Earth difficulty. New weapons and free maps come out frequently which help keep the game interesting but being charged to own the latest and greatest weapon packs can be a bit of bummer.. Like all zombie based games, it tends to become repetitious. Luckily, having the option to increase the difficulty, play objective modes, and strive for seasonal achievements gives players more challenges/options to keep the interest in playing alive.  If I had to rate the game, I would rate it a 9.5/10. Would bang.", "timestamp_created": 1389966749, "timestamp_updated": 1389966749, "voted_up": true, "votes_up": 315, "votes_funny": 3, "weighted_vote_score": "0.892988145351409912", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32656087": {"recommendationid": "32656087", "author": {"steamid": "76561198238787036", "num_games_owned": 98, "num_reviews": 21, "playtime_forever": 1175, "playtime_last_two_weeks": 0, "last_played": 1548977219}, "language": "english", "review": "You kill zombies, but no floors. \n\n1/10 the devs lied\n\n\nJust kidding this game is fucking awesome buy it now", "timestamp_created": 1498173653, "timestamp_updated": 1498173653, "voted_up": true, "votes_up": 331, "votes_funny": 256, "weighted_vote_score": "0.888027548789978027", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23494794": {"recommendationid": "23494794", "author": {"steamid": "76561198057849814", "num_games_owned": 1091, "num_reviews": 120, "playtime_forever": 19301, "playtime_last_two_weeks": 0, "last_played": 1448664308}, "language": "english", "review": "[h1]AT A GLANCE[/h1]\n(Full review follows below)\n\n[list]\n[*] [b]Game Name:[/b] Killing Floor\n[*] [b]Original Release:[/b] 2009\n[*] [b]Genre Tags:[/b] FPS; Coop; Round-Based; Progressive \n[*] [b]My Overall Grade:[/b] A+\n[*] [b]Estimated Playtime (Campaign):[/b] N/A\n[*] [b]Multiplayer Aspect:[/b] Primary\n[*] [b]Recommended To:[/b] Established fans of the genre; Those intrigued by the genre; Multiplayer gamers\n[/list]\t\n\n[h1]REVIEW[/h1]\n[b]Killing Floor[/b] is one of the most fun cooperative FPS games in existence. Team up with up to 5 other players to fight off waves of [strike]zombies[/strike] mutants. Not necessarily groundbreaking, but somehow the concept has been represented in a unique and entertaining way.  If you like cooperative FPS games, this should be a definite pick-up for you.\n\nThere are various types of mutants. Some are essentially “trash mobs,” but play a role in getting in the way. Then there are mid-tier and high-tier \"specials\" that all have unique attacks. These spawn less frequently, but can wind up overwhelming you if you don’t take them down quickly. And if you make it through all the waves in a match, there is a boss fight. If you play on the highest difficulty and with a full team, then these boss fights are easily among the most exciting and adrenaline-pumping boss fights in all of gaming.\n\nThere are 7 classes to play as.  You can play as all classes on your account, but only one at a time; and you will permanently level-up each class by playing.  Having higher levels is a must if you want to take on the higher difficulties.  On those high difficulties the true brilliance of the gameplay really shines. You’ll have to play smart and as a team if you want a chance to beat the maps on [i]Hell on Earth[/i]. It can be incredibly challenging, and you may go a while without winning a single match. But when you finally do, it can be incredibly satisfying.   \n\nHaving said that, it should be noted that the game also scales with the size of your team, and you can play solo which lowers the amount of enemies per wave and lowers their stats. Because of this, playing solo is actually easier for some, although if you make a single mistake it is game over because there is no one to pick up the slack. I personally feel the game is way more fun with full teams (and thus full enemy spawns with max stats).\n\nAlso, there is [i]a lot[/i] of DLC, but don't let that turn you off.  I have not bought a single DLC for this game, and have over 300 hours of fun and have nearly every achievement (except for two that I’m not worthy of).  That said, a couple of the DLCs are worth getting as they grant you access to some great weapons that are very effective and fun to use. And anyone who owns any DLC can drop the unlocked weapons in game for someone else to pick up for that match.\n\nSo if you like games like [i]Left 4 Dead[/i] or [i]Payday[/i], this is very much in the same vein. However, it also has a great unique identity. It is a sure bet for anyone who likes cooperative shooters and challenging gameplay.\n\n[i][url=http://steamcommunity.com/groups/murphyslawyercuration#curation]Follow my curation page to see more of my recommendations![/url][/i]", "timestamp_created": 1465613591, "timestamp_updated": 1465613591, "voted_up": true, "votes_up": 120, "votes_funny": 5, "weighted_vote_score": "0.847867310047149658", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32270220": {"recommendationid": "32270220", "author": {"steamid": "76561198080366666", "num_games_owned": 16, "num_reviews": 10, "playtime_forever": 3256, "playtime_last_two_weeks": 0, "last_played": 1534643318}, "language": "english", "review": "There are weird phases in this game where the gameplay is just boring, but then if you get into the right server on the right map with the right amount of people it becomes the most gritty, intense, and fun expierence that you can ever expierence in a first person shooter. Overall I would recommend", "timestamp_created": 1496940432, "timestamp_updated": 1496940432, "voted_up": true, "votes_up": 50, "votes_funny": 3, "weighted_vote_score": "0.806572496891021729", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32732777": {"recommendationid": "32732777", "author": {"steamid": "76561198202598280", "num_games_owned": 286, "num_reviews": 2, "playtime_forever": 1389, "playtime_last_two_weeks": 0, "last_played": 1545928598}, "language": "english", "review": "Killing Floor is simple. Slaughter a batch of specimens, buy new equipment from the trader, and repeat until you have a boss fight with \"The Patriarch,\" a nasty misanthrope with a rocket launcher, a chain gun, and the ability to go invisible. No verbose exposition, lengthy cutscenes, or half-baked attempts at character and story development are arbitrarily affixed to this pure first-person-shooter experience. From the beginning, you'll love the game's satisfying gunplay. Guns look and feel real thanks to convincing ballistics and iron sights, which make aiming both important and engaging. In addition, \"pray and spray\" is worthless on higher difficulty levels, and ammo is often sparse, so every shot counts. To survive the intense and often claustrophobic firefights, you must coordinate with your teammates and make good use of the environment, which you can accomplish by welding shut doors to create temporary choke points, forcing the creatures to fight on your terms. Furthermore, you need to try and complete each round near the trader, who moves her shop between waves (unfortunately she won't sell you her personal teleporter) and opens for business for only less than a minute each time.", "timestamp_created": 1498320230, "timestamp_updated": 1498320230, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.816848337650299072", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14429677": {"recommendationid": "14429677", "author": {"steamid": "76561198023095932", "num_games_owned": 127, "num_reviews": 3, "playtime_forever": 407003, "playtime_last_two_weeks": 1447, "last_played": 1551630256}, "language": "english", "review": "I don't know where to start as a long time player. Killing Floor is sickness, a wicked one at its finest. Teamworking wave by wave your way up to face the horror itself is a great fun. Although, game itself is coated in black humor, which is swirled inside small popular culture and steampunk references. Not everyone's cup of tea at that, but I assure you everyone can take the joy of killing mindless clone armies even it's given in a literature covered in vain and desperation.\n\nGame is hard, I'll give you that and it takes time to get used to some patterns, but once you get used to it; they will become habits like the game itself. More you play, more you will seek about its balance and mechanics and it will sink you deeper into it. Because getting better and everything resolves in teamplay.\n\nIf you're into black humor, survival co-op, hidden popular culture references and mindless killing fest where you are the actual prey; you gotta buy this game and play it.\n\nOtherwise, keep playing your tacticool and deathmatch first-person shooters, because there's almost nothing attracting the modern casual players here. You won't heal back quicker without any help neither you can recover from bad positioning since movement is slow. You can not shoot at the other end of map with near perfect accuracy by spray'n pray either. Game will reward controlled fire and recoil compensation as much as twitch shots paired with depth perception.\n\nBeing an arcade-like game as it rewards being swift, resolving and sharp-eyed; Killing Floor also infamous about punishing impatience and being disorganized at times you least expect it. Which can be a frustrating and long-running experience to get ahold of. Zeds have nasty habits of flanking you often or interrupt your teammates as they're busy with high threats, if you ever let your guard down.\nAt these times it's better to stand close and watch each others' behind and cover fire for each other. Yet being cluttered like that may lead to a quick death if you fail to gain ground for a long time or watching the same direction at the open. In other words, team formation really matters, trust is important. Game also require discipline of ceasing fire without panicing and engaging priorities in a mayhem by letting the capable perks handle it.\n\nEven if you fought your way through the hordes of zeds you can get overwhelmed by the difficulty spike of infamous last (10th) wave, or get slaughtered by the beast called The Patriarch.\nHe's pretty much designed in the shadow of 80's slaughter movies for an endgame boss and really gives you a quick rundown about that era. In the end you'll have lots of fun moments and laughs about how you failed it and fell prey to the slaughter or good memories about how you prevailed the carnage.", "timestamp_created": 1423637179, "timestamp_updated": 1543660660, "voted_up": true, "votes_up": 74, "votes_funny": 11, "weighted_vote_score": "0.827357888221740723", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12417257": {"recommendationid": "12417257", "author": {"steamid": "76561198038752301", "num_games_owned": 363, "num_reviews": 8, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1482708493}, "language": "english", "review": "I was actually killed by evil creatures, not the floor.", "timestamp_created": 1412811413, "timestamp_updated": 1412811413, "voted_up": true, "votes_up": 2005, "votes_funny": 2162, "weighted_vote_score": "0.863109886646270752", "comment_count": 45, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32647722": {"recommendationid": "32647722", "author": {"steamid": "76561198119043539", "num_games_owned": 380, "num_reviews": 20, "playtime_forever": 543, "playtime_last_two_weeks": 0, "last_played": 1498154575}, "language": "english", "review": "free on humble bundle dont buy (the promotion is done)", "timestamp_created": 1498154684, "timestamp_updated": 1498330375, "voted_up": true, "votes_up": 1492, "votes_funny": 234, "weighted_vote_score": "0.867054641246795654", "comment_count": 118, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36323750": {"recommendationid": "36323750", "author": {"steamid": "76561198010155821", "num_games_owned": 444, "num_reviews": 23, "playtime_forever": 16086, "playtime_last_two_weeks": 0, "last_played": 1527361339}, "language": "english", "review": "[h1] Ha, call yourself a bloody zombie? [/h1]\n\nKilling Floor from the day one was a game equivalent of a blunt object. It was never meant to be beautiful. It was never meant to be the most complex or innovative. But it works just perfect if you want to bash something over the head, especially with up to 6 friends.\n\n[b] Lots of lovely guns, just waiting for you. [/b]\nPick one of 7 classes and brace yourself against wave after wave of mindless meat, thrown at you in this survival horror. Cutting off limbs, blowing up bodies into shower of bloody chunks or burning your enemies to cinders, is the essence of Killing Floor. Pick something from the vast array of weaponry, lean back, and enjoy the gory spectacle. The game was never meant to be scary. Perhaps some zed designs might be a little intimidating, but frankly, things become much less scary when you kill them by the hundreds. It’s all about survival, finding the most defensible spot and making your shots count. Once you get a grip of the basics you will quickly start sweeping through the levels, at least at normal difficulty.\n\nThen there are two paths to take. As a bloody gimmick Killing Floor has only so much to offer before it becomes dull and repetitive. It might be fun for a few hours but this is it. On the other side, if you develop a taste for culling the specimen hordes, Killing Floor can get you hooked in for hundreds of hours, as there is always more to do. Each difficulty level is quite a leap forward compared to the previous one. No matter how comfortable you are currently, you will most likely get overrun quickly when you try greater challenge.\n\n[b] Christ, what else has that bastard got up his sleeve? [/b]\nTo cover the gap, you will need to develop one of the perks to the highest (sixth) level. Difference between level one class perk and level six is humungous in every aspect. Damage dealt will be doubled, your resistances increased, and weapons will cost a fraction of what they previously did. But it will take time. Maxing out the perk is work for many hours as you develop your skill and grind zeds in manner of your choosing. In truth, only when you score sixth rank will you be able to topple two highest difficulty levels. Increasing the perk might not be so much of a goal, as a mere preparation for a true game to begin. Once rank icon turns gold, only your skills can get you further. Perhaps you would like to increase your possibilities or simply try something new? There are more perks to choose from, but each one of them requires its share of grinding. It does get faster once you get at least one perk developed, but still, getting each to rank six can easily take 300 hours or more.\n\n[b] Dosh! Grab it while you can, lads. [/b]\nMoney, money, money… as the main voice actor tends to say, are one of three primary means of balance. That being player count, difficulty level and the cash. It has to be said, Killing Floor is a fairly well balanced game, no matter if you are playing alone or with five others, the zed numbers and health will be altered properly. But out of the three it is the dosh that encourages farming perks the most. With each difficulty level not only zed health is increased, but income from each wave is reduced drastically. In effect, it doesn’t matter how skilled you are, if there is no possibility for you to afford a necessary weapon. Highest perk levels (fifth and sixth) provide you with starting gear, and best discounts and only they will allow you to properly play “Suicidal”, not to even mention “Hell on Earth”. Perhaps a debatable choice at part of Tripwire Interactive, but one that both grants and forces hundreds of play hours before you can reach the top.\n\n[b] Clock's runnin'. Get a move on. [/b]\nBear in mind that at the time of writing this review, Killing Floor is already over eight years old, and it would be simply naive to ignore that. Time has taken its toll on the game and, take note, that KF was called “a B grade follow-up to Left 4 Dead” the day it came out. What was outdated back then, now is plain archaic. Graphics are ugly, AI is silly, and little bugs happen every game. Now, as before, it is the gameplay that holds. Cranky as the game may be, the playerbase is still numerous, servers are plenty, and the game got a fair share of attention up until release of Killing Floor 2. New levels were added, balance was improved, new guns and characters sprouted in DLCs. But it has to be pointed out that many moved on, and what is more important, the developers did. On the up side, Killing Floor will run on a chunk of wood, and if you are eager to turn a bit of a blind eye to its downs there is a lot of fun murder to be had.", "timestamp_created": 1509981332, "timestamp_updated": 1510007619, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.763100564479827881", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "8020990": {"recommendationid": "8020990", "author": {"steamid": "76561198025393876", "num_games_owned": 1051, "num_reviews": 31, "playtime_forever": 26322, "playtime_last_two_weeks": 0, "last_played": 1527360193}, "language": "english", "review": "I've been playing KF for a while, and from my observations there is a healthy playerbase, especially for a game that released in 2009. 4 years, still strong and Tripwire is still updating the game with new DLC + events. The DLC is optional ofc, usually it's like player skins/cosmetics. Not pay to win.\n\nAnyways, to get back to the point; like most multiplayer co-op games you're going to have the experts, vets, average, and the noobs/beginners. I found the community to be pretty friendly, you'll start picking up tips as you continue to play. Of course, if you have a dedicated group, teamwork will be greater as you'll walk into the game with a plan. With good teammates, things go smooth. Sometimes I get randoms that are great, sometimes not. You'll learn more about \"kiting\" ZEDs as you play on Suicidal/HoE (harder difficulties), but camping is much easier in lower-level games.\n\nSpeaking of difficulty, if you decide to pick up this game today, please join a Beginner/Normal level server and keep playing until you level up to 2 (or 3), then proceed to a Hard difficulty server. Strongly advised NOT to play on Suicidal/Hell on Earth right off the bat. Chances are you'll cause more harm than help as your experience & perk levels are not strong enough for such difficulties (specimens also get stronger by a factor of how many players on the server).\n\nThis game is simplified down to this: kill b*tches, get money to buy guns/ammo/armour, then rinse and repeat until you get to the Final Boss Level against the Patriarch. He is one of a kind and I will let you discover more about him on your own! (it's more fun that way) \n\nNot everybody will have enough money at the trader, so sharing is vital for overall success of your team. Just simple things like throwing a few pounds at your teammate can go a long way.\n\nI remember picking up this game like 2 years ago, it's still one of the most played games I own! Didn't know too much and often died getting to the Pat, but every game I played, every wave I beat I learned how to improve. The game has a level system from 0 to 6, so character progression will obviously make KF easier the more you play! A lot of replayability (custom maps + different spawns), the game keeps itself fresh.\n\n----\n\nTL;DR - this game is still fun after 4 years of release, still getting updates from Tripwire devs. if you enjoy killing shit with friends in a 6-man environment (much more enjoyable than only the usual 4 person co-op, imo) buy this game! you won't regret it!!!", "timestamp_created": 1386879496, "timestamp_updated": 1416178347, "voted_up": true, "votes_up": 158, "votes_funny": 0, "weighted_vote_score": "0.861492335796356201", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "7822605": {"recommendationid": "7822605", "author": {"steamid": "76561198071841818", "num_games_owned": 115, "num_reviews": 3, "playtime_forever": 216992, "playtime_last_two_weeks": 0, "last_played": 1548588754}, "language": "english", "review": "Don't buy this game. I mean, seriously. Don't. If you do, you'll never leave your room again because it's addictive as fukk.", "timestamp_created": 1385727733, "timestamp_updated": 1385730398, "voted_up": true, "votes_up": 893, "votes_funny": 6, "weighted_vote_score": "0.843125760555267334", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12627248": {"recommendationid": "12627248", "author": {"steamid": "76561198035285721", "num_games_owned": 4471, "num_reviews": 669, "playtime_forever": 135858, "playtime_last_two_weeks": 0, "last_played": 1497749927}, "language": "english", "review": "[h1]\"Probably the best zombie co-op shooter out there\"[/h1]\n\nTemporarly placed between Left4Dead and Left4Dead2 it shows up permanently improved graphics, maps, skins and weapons. It has a great fan community and is still evolving nevertheless KF2 is already been announced.\n\nThe main difference to L4D is the concept not to fight some hordes, but just a certain amount of 9 different special infected (ZEDs) each of the 10 waves on the same map. Then comes the Boss called the patriarch which is incredible stronger and send some of his children for support. Your character is improvable by long time playing measured in 7 different perks. So you will achieve mastery in many different ways after a while.\n\nThat doesn't mean your personal player skills are not needed. Instead you must begin to analyze the ZED mechanics in higher difficulties and how the perks work perfectly together. \nThere are 2 ways: Camping  or Kiting to beat the maps. Camping means holdout in a tight place and withstand all over the waves the ZEDs. Kiting means running in circles on a route and takeout one ZED after another. Kiting is more time intense but could be also more fun.\n\nThe kill animations are absolutely great (at least in the uncut version). Heads are exploding, can be decapitivated. Burning them bodies with flamethrower (firebug) let them coal.  Demolitian has pipebombs and blow up everything that comes to close. On the other side some Zeds have a rage mode where they don't stop chasing you until they killed you. It's totally challenging and depends on the whole team skills if you survive or not.\n\nThere's a high amount of 280 Achievements atm. Still raising at each seasonal event. You have to await these events to unlock them all. Each map has 4 map achievements from \"normal\" to \"hell on earth\", KFO - interesting objective maps, some kill achievements and special gimmicks, unlockable new character and Tripwire cross game supporting achievement policy. All fun.\n\nOne little negative is the complex server browser in MP which confuses in the first moment. But after a while you will get used to it.\n\nDon't miss this great game that isn't still boring after 1k hours playtime. (helping some friends with achievements). I recommend you to buy somekind of complete pack in order to get a whole bunch of the most important DLC guns and skins included. It just cost you a little more.  I know, some people swear L4D2 is even better and more atmospheric. But you can try to be the master in both games.", "timestamp_created": 1414252959, "timestamp_updated": 1453457825, "voted_up": true, "votes_up": 273, "votes_funny": 12, "weighted_vote_score": "0.851082921028137207", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35728832": {"recommendationid": "35728832", "author": {"steamid": "76561198206584867", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 102171, "playtime_last_two_weeks": 0, "last_played": 1522629356}, "language": "english", "review": "I don't care how old this game is, it's still addictive to this day. Awesome game.", "timestamp_created": 1508013291, "timestamp_updated": 1508013291, "voted_up": true, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.747729003429412842", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23470674": {"recommendationid": "23470674", "author": {"steamid": "76561198097209819", "num_games_owned": 61, "num_reviews": 57, "playtime_forever": 70953, "playtime_last_two_weeks": 262, "last_played": 1550964570}, "language": "english", "review": "1111 hours on record is as good a time as any to finally write an actual review for this.\n\nI'll get the less interesting stuff out of the way first:\n- The graphics are passable enough, with good customisation options that allow you to buy frames per second for some eye candy (mmm, candy!). I suppose it may look dated but I've never considered myself a graphics snob so it doesn't bother me.\n- The sound effects are fine for the most part, the soundtrack is hit-or-miss based on what genres of music you like, I turned it off completely so I can hear what's happening around me because I prefer situational awareness to heavy metal.\n\nWhere the game shines is the gameplay.\nThat is if you're willing to invest some serious time in it as the learning curve is one of the most intricate ones I've seen. This is interesting considering the simplicity of the premise - there are two gamemodes (one of which only has 3 official maps and frankly I've always seen it as a mere gimmick), in the standard one the players fight 4, 7 or 10 waves of zombies (9 types with different strengths and weaknesses, some of which complement one another dangerously well) plus the same boss every time and that's it. That really sounds like it should get old quickly, yet somehow it doesn't - there's always new stuff to learn, skills to improve, weapon loadouts to try... I don't think anyone can honestly say \"I know everything there is to know about KF\".\nA large portion of the advanced tricks and tactics I believe are actually a result of quirks in the code that weren't intentional but happened to make the game much more complex than it looks on the surface.\nThe downside to all this is that experienced players often have little tolerance for inexperienced ones who haven't figured out the ideal loadouts and strategies yet. It can be difficult to pick the game up now and start learning because people WILL insult you, votekick you etc, but it can be done - there are loads of guides explaining both the basics and the advanced stuff, and some experienced players like coaching newer ones and showing them the ropes. As long as you're willing to learn and don't act like a twæt, you should be fine.\n\nSo yeah, Killing Floor 1, while slowly growing old, is a gem of the FPS genre. It's definitely not for everyone but if you do get into it, you're in for many hours of good fun.", "timestamp_created": 1465491024, "timestamp_updated": 1465491024, "voted_up": true, "votes_up": 29, "votes_funny": 4, "weighted_vote_score": "0.713875055313110352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32757338": {"recommendationid": "32757338", "author": {"steamid": "76561198179774305", "num_games_owned": 121, "num_reviews": 6, "playtime_forever": 3334, "playtime_last_two_weeks": 0, "last_played": 1540269065}, "language": "english", "review": "Esta muy bueno y divertido. Lo que mas me gusto es el efecto de camara lenta :3", "timestamp_created": 1498369272, "timestamp_updated": 1498369272, "voted_up": true, "votes_up": 46, "votes_funny": 6, "weighted_vote_score": "0.779641211032867432", "comment_count": 9, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "12307521": {"recommendationid": "12307521", "author": {"steamid": "76561198012533422", "num_games_owned": 411, "num_reviews": 25, "playtime_forever": 21268, "playtime_last_two_weeks": 0, "last_played": 1491043837}, "language": "english", "review": "You find yourself somewhere in the UK, all you can see is fire, dead bodies everywhere and down the street you can hear some idiot screaming for money.\n\nWhy would anyone ask for money when there are dead bodies laying down everywhere, you might ask?\nWell, it's simple.\nWe're going shopping.\nWe need guns.\nLots of guns.\nAll kinds of guns.\nSmall ones, big ones, shitty ones, good ones, the ones that go boom, the ones that do pew pew pew, axes, katanas, chainsaws, granades, rocket launchers, weird puke throwers (what the hell?!) and some crazy energy guns.\n\n10/10 would throw dosh again.\n\n\"Bloody hell, what's he got on his arms?\"\n*gets minced by a Fleshpound*\n\n", "timestamp_created": 1412126188, "timestamp_updated": 1412126188, "voted_up": true, "votes_up": 262, "votes_funny": 199, "weighted_vote_score": "0.828273355960845947", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30610883": {"recommendationid": "30610883", "author": {"steamid": "76561197966680360", "num_games_owned": 319, "num_reviews": 1, "playtime_forever": 380339, "playtime_last_two_weeks": 0, "last_played": 1549146806}, "language": "english", "review": "I still love this game!", "timestamp_created": 1489914940, "timestamp_updated": 1489914940, "voted_up": true, "votes_up": 48, "votes_funny": 3, "weighted_vote_score": "0.768399178981781006", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34115777": {"recommendationid": "34115777", "author": {"steamid": "76561198049389786", "num_games_owned": 893, "num_reviews": 79, "playtime_forever": 2146, "playtime_last_two_weeks": 0, "last_played": 1511082809}, "language": "english", "review": "It's an absolutely amazing game. When you consider that the engines is Unreal 2 based the graphics are incredible. \n\nAs far as zombie shooters and co-op games go, this is a classic. \n\nThis game is really addicting, fast-paced, and requires the best teamwork to pass and conquer the waves coming at you. \nIt has only one purpose, but many will be surprised how many hours will be spent just killing every thing in sight.\nIf someone doesn't enjoy this game I feel sorry for them. \nAlso with upgradeable perks and destructive weapons of all sorts, the slaughter of undead specimens will bring you back wanting to play again. \n\nDefinitely a must buy.", "timestamp_created": 1502242556, "timestamp_updated": 1502242556, "voted_up": true, "votes_up": 31, "votes_funny": 15, "weighted_vote_score": "0.737068533897399902", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13523188": {"recommendationid": "13523188", "author": {"steamid": "76561198011505032", "num_games_owned": 715, "num_reviews": 60, "playtime_forever": 32434, "playtime_last_two_weeks": 0, "last_played": 1439926549}, "language": "english", "review": "Every Steam account should have this game.", "timestamp_created": 1419258795, "timestamp_updated": 1419258795, "voted_up": true, "votes_up": 323, "votes_funny": 66, "weighted_vote_score": "0.832336843013763428", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30059748": {"recommendationid": "30059748", "author": {"steamid": "76561198277997553", "num_games_owned": 225, "num_reviews": 5, "playtime_forever": 145569, "playtime_last_two_weeks": 895, "last_played": 1551573667}, "language": "english", "review": "Before you start playing Killing Floor, you should know some, let’s say, additional information on it, eh? Just to be prepared, you know. Enjoy!\n\nSo, what things you should know about Killing Floor?\n\nKilling Floor is [i]strategy[/i], when your team camps certain place, while one Zerk, ignoring you, runs circles around the map on his own and finally ruins your game.\n\nKilling Floor is [i]aid[/i], when a dude from your team screams for help, but when you run over in order to save his аss, he quickly runs past you and, as a result, leaves a huge company of both his and your zeds after you.\n\nKilling Floor is [i]persistence[/i], when every wave you ask your teammates not to kill the last zed to have enough time to get to the trader, shop and come back to the camp spot, but some retard ignores you and kills the last specimen anyway. Every. Damn. Wave.\n\nKilling Floor is [i]support[/i], when there are 3 Scrakes left out of an entire wave, and your team runs to the trader, leaving you alone and without ammo on your camp spot. Surprise!\n\nKilling Floor is [i]teamwork[/i], when you are the only Sharpshooter in the team, and all players simply freeze and stare at you killing a Scrake or the Fleshpound, while you are getting eaten by 10 crawlers from behind.\n\nKilling Floor is [i]suddenness[/i], when a noob from your team rages a Scrake or the Fleshpound on the other side of the map, but the rage goes exactly on you instead of this poor retard.\n\nKilling Floor is [i]fun[/i], when a Firebug enters your game at wave 10 and rages 2 Fleshpounds and 2 Scrakes at once with FlameThrower.\n\nKilling Floor is [i]tactic[/i], when you kite the Fleshpound as Zerk, and all of a sudden a Commando starts AK-47 spam on it.\n\nKilling Floor is [i]profit[/i], when a Demo enters your game with 3 Zerks and a Medic in the team, asks for Dosh, dies during the very first seconds of the new wave and quits the game, leaving your team without a penny.\n\nKilling Floor is [i]friendship[/i], when you get teamkilled by a dude with a Harpoon Launcher or a Welder. Also, you should not forget about friendly fire on some servers...\n\nKilling Floor is [i]respect[/i], when you get kicked or banned from a server because admin and his friends did not like your binds and jokes.\n\nKilling Floor is [i]balance[/i], when one dude from your team camps inside some bug spot and takes all the kills, while you and your other teammates get 1 Clot per hour.\n\nKilling Floor is [i]logic[/i], when a Demo from your team places a tone of pipes for the Patriarch and then stands exactly on them.\n\nKilling Floor is [i]wisdom[/i], when some random guy joins your game as a spectator and starts commenting on your gameplay, mistakes and everything else.\n\nThis is it, I guess. At least, for now.\n\nHappy zed-killing!", "timestamp_created": 1487604796, "timestamp_updated": 1544624178, "voted_up": true, "votes_up": 40, "votes_funny": 43, "weighted_vote_score": "0.775809645652770996", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27285593": {"recommendationid": "27285593", "author": {"steamid": "76561198044038962", "num_games_owned": 566, "num_reviews": 3, "playtime_forever": 583929, "playtime_last_two_weeks": 1464, "last_played": 1551096430}, "language": "english", "review": "This is the only game I play. I only play Modded custom server. Theres still plenty life for this game if you dig in the mod community, so many new zeds, maps and weapons. Give it some time and patience thou, this aint a casual game.\n\nEditing for 2017 Steam Awards :)", "timestamp_created": 1480014784, "timestamp_updated": 1511396669, "voted_up": true, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.731314718723297119", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "1774348": {"recommendationid": "1774348", "author": {"steamid": "76561197997792412", "num_games_owned": 1073, "num_reviews": 35, "playtime_forever": 7993, "playtime_last_two_weeks": 0, "last_played": 1414595445}, "language": "english", "review": "The best zombie shooter ever made. Teamplay here really is key, either play together  or die alone in a very very horrible maner.\n\nIts wave based with stronger enemies spawning each wave and concludes with a final boss wave. Weapons are perk based and perks can be leveled persistently trough playing. Perks help with lowering weapon costs, higher damage and that sort of shit. Weapons are purchasable with money gathered trough each wave (by killing, healing, welding doors, assisting kills...). This combination is what I believe make the game feel great.\n\nMost of the DLC are skins and only offer cosmetic changes. The community weapon packs add more weapons (although you can do without). I should also note that the developers still support this game trough frequent free map updates.", "timestamp_created": 1375400788, "timestamp_updated": 1386345621, "voted_up": true, "votes_up": 232, "votes_funny": 0, "weighted_vote_score": "0.836758017539978027", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31264587": {"recommendationid": "31264587", "author": {"steamid": "76561197967403228", "num_games_owned": 267, "num_reviews": 6, "playtime_forever": 28974, "playtime_last_two_weeks": 0, "last_played": 1492946151}, "language": "english", "review": "[h1]Play this game if you like...[/h1]\n\n[list]\n[*]Horde modes\n[*]6 Player Co-Op\n[*]Headshots\n[*]ZEDs\n[*]Gore\n[*][i]Insult Players[/i]\n[*]High skill ceilings [spoiler]and floors[/spoiler]\n[*]Leveling perks\n[*]British voice acting\n[*]Gritty graphics\n[*]Workshop maps and mods\n[*]Failing at first\n[*]Running in circles when shit hits the fan\n[*]The big ones\n[/list]\n\n[b]Grab it while you can, lads.[/b]", "timestamp_created": 1492727437, "timestamp_updated": 1492727437, "voted_up": true, "votes_up": 19, "votes_funny": 9, "weighted_vote_score": "0.658721566200256348", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14088689": {"recommendationid": "14088689", "author": {"steamid": "76561197964640282", "num_games_owned": 403, "num_reviews": 7, "playtime_forever": 149725, "playtime_last_two_weeks": 6618, "last_played": 1551863646}, "language": "english", "review": "I've only played it a few times, but it seems like a pretty decent game with a good community.\n\n", "timestamp_created": 1421792636, "timestamp_updated": 1421792636, "voted_up": true, "votes_up": 161, "votes_funny": 312, "weighted_vote_score": "0.772139072418212891", "comment_count": 9, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14953981": {"recommendationid": "14953981", "author": {"steamid": "76561198045125621", "num_games_owned": 149, "num_reviews": 6, "playtime_forever": 18322, "playtime_last_two_weeks": 0, "last_played": 1532346486}, "language": "english", "review": "The word [i]dosh[/i] is now part of my daily vocabulary.\nAnd I'm not British.", "timestamp_created": 1426725294, "timestamp_updated": 1426725294, "voted_up": true, "votes_up": 156, "votes_funny": 197, "weighted_vote_score": "0.760357856750488281", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26215399": {"recommendationid": "26215399", "author": {"steamid": "76561198039689105", "num_games_owned": 225, "num_reviews": 23, "playtime_forever": 7535, "playtime_last_two_weeks": 0, "last_played": 1532355217}, "language": "english", "review": "This game has to be the most underrated game of 2009. It's an absolutely amazing game. When you consider that the engines is Unreal 2 based the graphics are incredible. Best fun to be had with mates. This is a better zombie survival horror than Left 4 Dead. What with the new content released for free as well. A must buy especially at this bargain price!", "timestamp_created": 1477406224, "timestamp_updated": 1477406224, "voted_up": true, "votes_up": 37, "votes_funny": 0, "weighted_vote_score": "0.748793601989746094", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32764855": {"recommendationid": "32764855", "author": {"steamid": "76561198057598316", "num_games_owned": 337, "num_reviews": 1, "playtime_forever": 67061, "playtime_last_two_weeks": 0, "last_played": 1546204366}, "language": "english", "review": "It's sad that there is no tutorial for this awesome game, though its old its gameplay is still 1 in a kind and i wouldn't dare to compare it that much with KF2. Most new players also don't look into guides or videos on the web making it difficult to play with randoms cause they don't know the simplest of the simplest mechanics for this game resulting in bad recommendations (if u can't play the game without dying 24/7 mankind tends to review it bad~).", "timestamp_created": 1498384713, "timestamp_updated": 1498384713, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.722132265567779541", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39572135": {"recommendationid": "39572135", "author": {"steamid": "76561198132266052", "num_games_owned": 223, "num_reviews": 3, "playtime_forever": 61661, "playtime_last_two_weeks": 0, "last_played": 1550628484}, "language": "english", "review": "1020.7 hours in. Still haven't killed any floors!", "timestamp_created": 1516763658, "timestamp_updated": 1516763658, "voted_up": true, "votes_up": 34, "votes_funny": 110, "weighted_vote_score": "0.731502056121826172", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32647622": {"recommendationid": "32647622", "author": {"steamid": "76561198084909224", "num_games_owned": 672, "num_reviews": 16, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1527441942}, "language": "english", "review": "[strike][h1]Free Killing Floor + 2 Guest Pass![/h1][/strike]\n\n[b]Giveaway hosted by HumbleBundle.[b]\n\n[strike]https://www.humblebundle.com/store/killing-floor[/strike]\n\n[strike]Expires on 24.6.[/strike]\n\nEDIT: [h1]When you redeem your key you will keep this game forever!!![/h1]", "timestamp_created": 1498154022, "timestamp_updated": 1498332011, "voted_up": true, "votes_up": 233, "votes_funny": 22, "weighted_vote_score": "0.790595948696136475", "comment_count": 16, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "7743146": {"recommendationid": "7743146", "author": {"steamid": "76561198035862684", "num_games_owned": 86, "num_reviews": 8, "playtime_forever": 18110, "playtime_last_two_weeks": 0, "last_played": 1507313889}, "language": "english", "review": "Brief summary:\nPros:\n\t+Easy to jump into and have fun\n\t+Should be able to run on the majority of Computers\n\t+Huge amounts of replayability\n\t+Workshop support ensures you can always try a new map or mutator out\n\tThe game's harder difficulties provide a real challenge to the hardcore\n\tMost of the DLC is purely cosmetic\n\t+The game is frequently updated with newer weapons (This might not happen anymore \n         as kf2 comes closer)\n\t+Has a SDK if you want to use that.\n\t\nCons:\n\tSome of the perks you can use aren't as useful as others\n\tThe hitboxes can become a pain at times\n\tSome mechanics aren't explained at all\n\tAt times, the community can be bad(They're a minority)\n\tRecent DLCs lock some more useful weapons away. Not too big of an issue though\n\tServer browser is a bit annoying at times\n\t\n//Long version//\n\nKilling floor is co operative first person shooter where up to six british men can exterminate zeds,an experiment gone wrong.(There are are also a few women and a robot)\n\n\nGraphics: Killing floor's graphics are decent and the art style of some maps in particular are amazing, and give out its atmosphere well. Don't expect anything spectacular though.\n\nThis game should be able to run on most older pcs just fine if you lower the graphics a lot and your resolution. Any good pc should run this with no worries.\n\nThis game caters to both casual and hardcore players. The objective is simple, kill all the enemies. It's easy to jump in and understand that you should probably kill all the guys trying to rip you apart. for those who play the game more often, the game can get really intense on the harder difficulties, where an understanding of each zeds mechanics is required to succeed.\n\nSince this is a team based game, having friends along can make the experience much more better. Although if you're a solo player like me, the game is still a ton of fun, just a lot more fun with friends. Every enemy in this game feels unique, from the basic waddling clot to that guy with a chainsaw for an arm. Each enemy acts differently, and each have characteristics that separate them from the others.\n\nThe maps in this game are of a wide variety. Some take place in urban environments, some in factories, others in fictional lands. With the workshop, you can find countless more community maps.\n\nThe voice acting of this game is both a positive and a negative. It is humorous at first, but when you start playing a lot, it gets incredibly repetitive.\n\nThe majority of the DLC for this game is cosmetic, skins for your character or a camo for you weapon. There are a few DLCs which give you new weapons. none of them are completely overpowered but some contain useful weapons. I recommend buying these DLCs first.\n\nAt its price, killing floor is absolutely worth it. It also frequently goes on sale, so grab it during then if \nyou're unsure.\n\n// Review end //\nI rewrote this because i noticed it had become popular, I updated the horrible formatting because it was not easy to read. I cleaned up a lot of the content and added a brief summary. Hopefully this helped", "timestamp_created": 1385407918, "timestamp_updated": 1447582799, "voted_up": true, "votes_up": 189, "votes_funny": 0, "weighted_vote_score": "0.833700835704803467", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "41760660": {"recommendationid": "41760660", "author": {"steamid": "76561198037544830", "num_games_owned": 200, "num_reviews": 60, "playtime_forever": 3161, "playtime_last_two_weeks": 0, "last_played": 1466351471}, "language": "english", "review": "Lots of lovely guns, just waiting for you.", "timestamp_created": 1525027489, "timestamp_updated": 1525027489, "voted_up": true, "votes_up": 24, "votes_funny": 4, "weighted_vote_score": "0.718836367130279541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "1534490": {"recommendationid": "1534490", "author": {"steamid": "76561197994346230", "num_games_owned": 5000, "num_reviews": 58, "playtime_forever": 17478, "playtime_last_two_weeks": 0, "last_played": 1527184398}, "language": "english", "review": "You wouldn't expect an ex-mod to become a huge success for the shelves, but this game just managed to achieve it. For those of you who do not know.\n\nKilling Floor is a standalone mod that was originally for Unreal Tournament 2003, created by Tripwire, the creators of the highly-acclaimed Red Orchestra games and the, unfortunately, terrible Defense Alliance 2. KF has you assume the role of one of several mercenary/soldier/cop/Disc Jockey fellows who are tasked with reclaiming the United Kingdom from an outbreak of \"Zeds\"--a zombie-like biological disaster-turned-weaponized mutant series of horribly deformed creatures who's only desire is to see you splattered across the walls like some sort of new-age graffiti Picasso painting from Hell\n\nKilling Floor is a quality game for anyone with a mouse and keyboard and there are still loads of players who still frequent the game", "timestamp_created": 1303073567, "timestamp_updated": 1485245598, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.714285731315612793", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "665492": {"recommendationid": "665492", "author": {"steamid": "76561197974783082", "num_games_owned": 9544, "num_reviews": 17, "playtime_forever": 9079, "playtime_last_two_weeks": 0, "last_played": 1471853572}, "language": "english", "review": "Pew Pew Zombies Pew Pew", "timestamp_created": 1351053684, "timestamp_updated": 1351053684, "voted_up": true, "votes_up": 63, "votes_funny": 11, "weighted_vote_score": "0.795640349388122559", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "4238070": {"recommendationid": "4238070", "author": {"steamid": "76561198034315837", "num_games_owned": 5282, "num_reviews": 478, "playtime_forever": 4754, "playtime_last_two_weeks": 0, "last_played": 1463673980}, "language": "english", "review": "Excellent co-op game that benefits from good enemy design and varied and high quality map selection. The gunplay feels right and I think it benefits from no artificial crosshair. The heavy emphasis on good smart teamplay to survive further serves to improve the experience.\n\nTo survive a wave of failed abominations (well are these ever really successful?) after a visceral bout where one mistake might well mean a full belly for these monsters imparts a definite sensation of achievement. The perks system works well and once your skill level improves along with your preferred perk’s level you’ll be able to tackle the harder difficulty levels that are truly “hellish” for the unprepared.\n\nSimple design, excellent execution and a tense game that rewards smart teamplay makes for an overall excellent online experience that only improves with friends.\n", "timestamp_created": 1324959018, "timestamp_updated": 1324959018, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.736822128295898438", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45744422": {"recommendationid": "45744422", "author": {"steamid": "76561198044668090", "num_games_owned": 1316, "num_reviews": 13, "playtime_forever": 36224, "playtime_last_two_weeks": 0, "last_played": 1449388637}, "language": "english", "review": "Still better than Killing Floor 2. Epic games, epic maps, epic mods, countless hours of fun with epic music and epic gore. It's a classic that you should try! Still my favourite game nowadays..", "timestamp_created": 1541868393, "timestamp_updated": 1543077718, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.69895559549331665", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33995787": {"recommendationid": "33995787", "author": {"steamid": "76561198077621121", "num_games_owned": 220, "num_reviews": 3, "playtime_forever": 14635, "playtime_last_two_weeks": 0, "last_played": 1503838014}, "language": "english", "review": "After 100 hours of gameplay you will always scream 'Fleshpound!' while hearing a drill.", "timestamp_created": 1501775714, "timestamp_updated": 1501781822, "voted_up": true, "votes_up": 22, "votes_funny": 4, "weighted_vote_score": "0.626677811145782471", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36275779": {"recommendationid": "36275779", "author": {"steamid": "76561198053328825", "num_games_owned": 220, "num_reviews": 34, "playtime_forever": 157246, "playtime_last_two_weeks": 0, "last_played": 1548532714}, "language": "english", "review": "Look at my \"hrs on record\" stat above and draw the conclusions yourself.", "timestamp_created": 1509816507, "timestamp_updated": 1509816507, "voted_up": true, "votes_up": 49, "votes_funny": 23, "weighted_vote_score": "0.72247767448425293", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26493655": {"recommendationid": "26493655", "author": {"steamid": "76561198018818592", "num_games_owned": 89, "num_reviews": 73, "playtime_forever": 3778, "playtime_last_two_weeks": 0, "last_played": 1495517794}, "language": "english", "review": "It can be a hassle getting a good team together, but once it gets rolling, it's a great zombie survival experience. This game runs well even on potato computers, making it very accessible.", "timestamp_created": 1478633357, "timestamp_updated": 1478633357, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.678181767463684082", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12713481": {"recommendationid": "12713481", "author": {"steamid": "76561198010030915", "num_games_owned": 1347, "num_reviews": 4, "playtime_forever": 8153, "playtime_last_two_weeks": 0, "last_played": 1526492777}, "language": "english", "review": "[h1]DOSH.[/h1]\n\nHere's some guns. Here's some [b]dosh.[/b] Here's some zeds. Survive.\n\nKill zeds to earn more [b]dosh.[/b]\n\nSpend your hard earned [b]dosh[/b] to buy better guns to kill harder zeds.\n\nThrow your unspent [b]dosh[/b] to other players so they too can buy better guns and earn more [b]dosh![/b]\n\n[b]Dosh![/b] Grab it while you can, lads!\n\nAccrue lots of [b]dosh[/b] and kill the boss.\n\nEverybody spam B and throw your [b]dosh![/b]\n\nITS RAINING MONEY!\n\n10/10 would throw [b]dosh[/b] again.", "timestamp_created": 1414785038, "timestamp_updated": 1414785426, "voted_up": true, "votes_up": 174, "votes_funny": 214, "weighted_vote_score": "0.784692168235778809", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32727888": {"recommendationid": "32727888", "author": {"steamid": "76561197986336924", "num_games_owned": 604, "num_reviews": 5, "playtime_forever": 685, "playtime_last_two_weeks": 0, "last_played": 1499281583}, "language": "english", "review": "Not gonna lie, I like it, even for an older game its still very fun to play with friends. Co-op is actually quite fun and enjoyable and the zeds are pretty challenging and difficult tbh. Good game fun times.", "timestamp_created": 1498312769, "timestamp_updated": 1498312769, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.696969687938690186", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38192693": {"recommendationid": "38192693", "author": {"steamid": "76561198299493213", "num_games_owned": 119, "num_reviews": 21, "playtime_forever": 5865, "playtime_last_two_weeks": 0, "last_played": 1529951554}, "language": "english", "review": "Probably the best Zombie Co-Op Fps game on PC.\n\n░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n░░░░░░░▄▄▀▀▀▀▀▀▀▀▀▀▄▄█▄░░░░▄░░░░█░░░░░░░\n░░░░░░█▀░░░░░░░░░░░░░▀▀█▄░░░▀░░░░░░░░░▄░\n░░░░▄▀░░░░░░░░░░░░░░░░░▀██░░░▄▀▀▀▄▄░░▀░░\n░░▄█▀▄█▀▀▀▀▄░░░░░░▄▀▀█▄░▀█▄░░█▄░░░▀█░░░░\n░▄█░▄▀░░▄▄▄░█░░░▄▀▄█▄░▀█░░█▄░░▀█░░░░█░░░\n▄█░░█░░░▀▀▀░█░░▄█░▀▀▀░░█░░░█▄░░█░░░░█░░░\n██░░░▀▄░░░▄█▀░░░▀▄▄▄▄▄█▀░░░▀█░░█▄░░░█░░░\n██░░░░░▀▀▀░░░░░░░░░░░░░░░░░░█░▄█░░░░█░░░\n██░░░░░░░░░░░░░░░░░░░░░█░░░░██▀░░░░█▄░░░\n██░░░░░░░░░░░░░░░░░░░░░█░░░░█░░░░░░░▀▀█▄\n██░░░░░░░░░░░░░░░░░░░░█░░░░░█░░░░░░░▄▄██\n░██░░░░░░░░░░░░░░░░░░▄▀░░░░░█░░░░░░░▀▀█▄\n░▀█░░░░░░█░░░░░░░░░▄█▀░░░░░░█░░░░░░░▄▄██\n░▄██▄░░░░░▀▀▀▄▄▄▄▀▀░░░░░░░░░█░░░░░░░▀▀█▄\n░░▀▀▀▀░░░░░░░░░░░░░░░░░░░░░░█▄▄▄▄▄▄▄▄▄██\n░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n", "timestamp_created": 1512856462, "timestamp_updated": 1512856462, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.68125838041305542", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "46717311": {"recommendationid": "46717311", "author": {"steamid": "76561198167940370", "num_games_owned": 1288, "num_reviews": 419, "playtime_forever": 17829, "playtime_last_two_weeks": 0, "last_played": 1549254350}, "language": "english", "review": " Fun if you like killing zombies with a lot of different weapons on a lot of different maps and I really enjoy the graphics.", "timestamp_created": 1543039479, "timestamp_updated": 1543039479, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.629688441753387451", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18127415": {"recommendationid": "18127415", "author": {"steamid": "76561198074541924", "num_games_owned": 1848, "num_reviews": 5, "playtime_forever": 53901, "playtime_last_two_weeks": 0, "last_played": 1543471493}, "language": "english", "review": "[h1][b]Killing Floor - Review[/b][/h1]\nKilling Floor is a teambased first person shooter game made by Tripwire Interactive that puts an emphasis on teamwork. The main goal of the game is to work together with a team to kill a certain amount of zeds in each wave in order to get to wave 11 and kill the patriarch. Without working together with your team and forming a plan of some kind, you will die. That's one of the best things about Killing Floor, and one of the reasons why I love it so much. However this doesnt mean it's without its flaws.\n\nThere are 7 perks aka classes to choose from and they each play a specific role in your team. You'll level up after doing enough damage, getting headshots or killing a certain number of zeds. The higher you level up, the more benefits you recieve such as lower weapon costs and a starting weapon. However this isn't necessarily a good thing since it puts a big gap between newer players and the long time players. The perks themselves seperate Killing Floor from a bunch of other games since each one plays differently.\n\nGuns are a plenty in Killing Floor with around 7 or so weapons per perk (more with dlc). Each perk weapon is special with the amount of damage it does, how fast it shoots, and the reload speed. Each weapon also has a different sound effect which really gives each weapon a unique feeling to them as well as making some weapons really statisfying to kill zeds with. This doesn't mean that all weapons are good though, some are unbalanced and are either too costly for it's own good, or not being better than some of the higher end guns. The berzerker perk however doesn't feel as fleshed out as the others since you're basically slapping the zeds while trying not to get hit.\n\nAlong with the many different guns, maps, and perks this game offers, there's also many different zed types. In total there are 10 different zed types including the patriarch and each of them behaves differently. Because of this, some perks and the weapons they use work well against certain zeds, another thing that makes Killing Floor one of my favorites. However, this requires you to memorize different strategies to use for each of the zeds resulting in a slightly difficult learning curve for newer players. Although memorizing the paterns comes naturally to some people since the behaviors correlate with the sound cues they give, so it isn't too big an issue.\n\nOverall, if you're looking for a challenging fps game, you should definitely give this game a try. While Killing Floor 2 is already out and similar, the original Killing Floor feels like a different game entirely with different strategies than the second game. If you know anyone who plays Killing Floor, you should play with them as playing with friends makes this game much more enjoyable. You can usually find this game for $5 during sales, or you can get it in the Digital Deluxe version of Killing Floor 2, but it suffers from a ton of bugs that ruin Killing Floor 2 (Microtransaction drops are bugged despite already being  such a controversial feature, gg tripwire).\n\n[h1][b]Pros:[/b][/h1]\n► 7 perks / class to choose from\n► Tons of weapons and maps\n► Weapons sound great and each kill is satisfying\n► Difficulty and zed count ramps up as more people join (teamwork is essential)\n► A nice and fitting soundtrack\n► Multiple types of zeds that behave differently\n► Hilarious british accents\n\n[h1][b]Cons:[/b][/h1]\n► Unbalanced Weapons\n► Melee isn't fleshed out as it could've been (fitting pun)\n► There is an objective mode, but it only includes 3 official maps (you can however find some on the workshop)\n\n[h1][b]Hit / Miss:[/b][/h1]\n► Learning curve requires you to memorized what works against each zed, which might ward off newer players\n► Somewhat slow start\n\n[h1][b]Personal Rating:[/b][/h1]\n[i][strike]Avoid at all costs[/strike][/i]\n[i][strike]Pick up during a sale[/strike][/i]\n[i][strike]Worth Playing[/strike][/i]\n[b][i]Must Play[/i][/b]\n\nEdit: Removed my previous edit, placing it here. Edit basically said to get kf2 digital deluxe, however the game is currently bugged out more so than i've seen in any early access game.", "timestamp_created": 1442806603, "timestamp_updated": 1449309869, "voted_up": true, "votes_up": 79, "votes_funny": 4, "weighted_vote_score": "0.791804969310760498", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32226649": {"recommendationid": "32226649", "author": {"steamid": "76561198070265328", "num_games_owned": 132, "num_reviews": 8, "playtime_forever": 28031, "playtime_last_two_weeks": 0, "last_played": 1550259638}, "language": "english", "review": "It's a very good co-op survival game where teamwork is necessary. I had some epic matches with friends and random players as well. The DLCs for this game a bit pricy, but they just only add to the fun factor of this game. Sure it has some problems but a damn good co-op game. Must buy for those who want a good co-op experience.", "timestamp_created": 1496779435, "timestamp_updated": 1496779435, "voted_up": true, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.696589052677154541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9737593": {"recommendationid": "9737593", "author": {"steamid": "76561198057295730", "num_games_owned": 140, "num_reviews": 1, "playtime_forever": 123278, "playtime_last_two_weeks": 0, "last_played": 1503820303}, "language": "english", "review": "[b]About this game:[/b]\nKilling Floor is a Co-op Survival Horror FPS set in the devastated cities and countryside of England after a series of cloning experiments for the military goes horribly wrong. You and your friends are members of the military dropped into these locations with a simple mission: Survive long enough to cleanse the area of the failed experiments! \n\n[b]Features:[/b]\nThis game features some hilarious physics, excellent gore and violent gameplays. There are also seasonal events where the game's Zeds will be changed/updated to a holiday themed monster. In addition to that, there are achievements that is only obtainable during a specific season/event. \n\n[b]Recommendation:[/b]\nIt is advised to play this game with good friends before jumping into public online servers. Because this is a co-op survival based game, teamwork is critical to surviving. One would always meet people that will refuse cooperation due to the [strike]human[/strike] nature of the online community. Always select servers with PINGS under 260. Any online game with over 260 becomes extremely difficult and sometimes even rendering it being unplayable. There will always be people kind enough to show new players the ropes to becoming more experienced/better with this game. So what are you waiting for? GET THIS GAME AND PLAY!", "timestamp_created": 1396731896, "timestamp_updated": 1397112839, "voted_up": true, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.708523988723754883", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9710639": {"recommendationid": "9710639", "author": {"steamid": "76561198049845837", "num_games_owned": 1819, "num_reviews": 25, "playtime_forever": 49453, "playtime_last_two_weeks": 0, "last_played": 1545980319}, "language": "english", "review": "This game is great. Waves of mutated monsters with strengths and weaknesses swarm towards you and your team of (up to) six players. This is fun to play solo, but amazing with friends, teamwork is a large factor in this game. One weak link, will get the team ripped to shreds. \n\nChoose one of seven classes (each comes with it's special perk bonus) and try to survive the waves of mutants. With the Steam Workshop support, Community maps will always give you something new to die on. It's high action, loud metal, blood and gore will make you wanting more.\nNow stop reading reviews and buy the game. Now.", "timestamp_created": 1396495774, "timestamp_updated": 1479977904, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.664630413055419922", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25344859": {"recommendationid": "25344859", "author": {"steamid": "76561198142177021", "num_games_owned": 107, "num_reviews": 1, "playtime_forever": 397, "playtime_last_two_weeks": 0, "last_played": 1491290433}, "language": "english", "review": "I played this game and some guy from Japan came and was afk the entire time. Then at the end when we were vs. the final boss, everyone died from a sneak attack. THEN THIS MAN WAKES UP AND SOLOS THE BOSS THEN AT THE END, all he says is \"Yes.\"", "timestamp_created": 1472992324, "timestamp_updated": 1472992324, "voted_up": true, "votes_up": 38, "votes_funny": 83, "weighted_vote_score": "0.73928987979888916", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27063173": {"recommendationid": "27063173", "author": {"steamid": "76561198052696094", "num_games_owned": 789, "num_reviews": 2, "playtime_forever": 18481, "playtime_last_two_weeks": 0, "last_played": 1549814022}, "language": "english", "review": "Bwarrrgh! Bratatatata! \n\nBest horror survival game. Play with your friends! Die with your friends! \nResisting is futile.", "timestamp_created": 1479973184, "timestamp_updated": 1479973184, "voted_up": true, "votes_up": 20, "votes_funny": 5, "weighted_vote_score": "0.648755192756652832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "7748686": {"recommendationid": "7748686", "author": {"steamid": "76561198064720487", "num_games_owned": 391, "num_reviews": 22, "playtime_forever": 135250, "playtime_last_two_weeks": 485, "last_played": 1551415577}, "language": "english", "review": "Left4Dead meets Black-Ops Zombies; Killing Floor is one of the best co-op zombie killing games out there.  With a powerful and supportive community, the game developers and gamers create this incredible atmosphere of cooperation, challenge, and gore.\n\nThis game is great to play with friends or to make friends.  The more you learn about the game and the better you become, it is one of the most challenging and rewarding games out there.  It is no wonder players can play over 4k hours on this and still not be bored of it.  I would highly recommend this game, especially if you have friends that play it so you can play it with them.", "timestamp_created": 1385415917, "timestamp_updated": 1385415937, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.671651959419250488", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35812410": {"recommendationid": "35812410", "author": {"steamid": "76561198002608541", "num_games_owned": 5410, "num_reviews": 192, "playtime_forever": 797, "playtime_last_two_weeks": 0, "last_played": 1508308843}, "language": "english", "review": "An excellent FPS game. This is truly a classic. It kept me hooked for hours.", "timestamp_created": 1508309840, "timestamp_updated": 1508309840, "voted_up": true, "votes_up": 41, "votes_funny": 2, "weighted_vote_score": "0.653468132019042969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10346024": {"recommendationid": "10346024", "author": {"steamid": "76561198022082733", "num_games_owned": 174, "num_reviews": 13, "playtime_forever": 1628, "playtime_last_two_weeks": 0, "last_played": 1430684978}, "language": "english", "review": "The uncomfortable moments when you're not sure if the trader is coming on to you or not.", "timestamp_created": 1401900665, "timestamp_updated": 1401900665, "voted_up": true, "votes_up": 273, "votes_funny": 6, "weighted_vote_score": "0.697624742984771729", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11077579": {"recommendationid": "11077579", "author": {"steamid": "76561198068839161", "num_games_owned": 145, "num_reviews": 25, "playtime_forever": 5585, "playtime_last_two_weeks": 0, "last_played": 1535418031}, "language": "english", "review": "Besides the excelent game that Killing Floor is, Tripwire Interactive is an awesome developer, that after all these years, still supports and updates this old game. You have no valid reasons to not buy this game.", "timestamp_created": 1404524907, "timestamp_updated": 1404524907, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.708381891250610352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "41986201": {"recommendationid": "41986201", "author": {"steamid": "76561198357122793", "num_games_owned": 43, "num_reviews": 4, "playtime_forever": 24548, "playtime_last_two_weeks": 0, "last_played": 1549172513}, "language": "english", "review": "After playing Killing Floor for 200+ hours and earning almost half of all the achievements, it's time to write a review.\n\nKilling Floor is horror game that can be played either on solo or co-op. In this game, you don't kill floors, but cloned creatures called \"ZEDs\" which will attempt to kill you or your team wave after wave. If you manage to survive by killing them, the \"Patriarch\" (the game's boss) will attempt to wipe you out.\n\nPros:\n- Multiplayer is still alive, many dedicated servers are still up. \n- Perk variations make the game more dynamic, giving an entire team of players different strategies in different conditions.\n- Character DLC's look decent (if you are the collector type) \n- Weapon skins are also good-looking, but are limited only to certain weapons.\n- Unlockable characters are challenging, yet it doesn't make the game boring.\n- Many official maps to choose from. Workshop-made maps are supported too.\n- Realistic body deformations and gore. Body parts and blood are scattered when blasted, heads are removed when decapitated, and so on.\n\nCons:\n- DLC's can be pricy, wait for a sale to come up. \n- Voice chat is pretty horrible and is hard to hear other players' voices.\n- Levelling of perks can take some large amount of time but still acceptable.\n- Creating a non-dedicated server of your own for friends to join can be buggy when inviting friends to join.\n\nOverall rating: 8.5/10", "timestamp_created": 1526074530, "timestamp_updated": 1526075018, "voted_up": true, "votes_up": 16, "votes_funny": 4, "weighted_vote_score": "0.67559206485748291", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "28416775": {"recommendationid": "28416775", "author": {"steamid": "76561198060359009", "num_games_owned": 293, "num_reviews": 74, "playtime_forever": 6095, "playtime_last_two_weeks": 0, "last_played": 1525547840}, "language": "english", "review": "Its rough around the edges - a couple of the elements used here are definitely outdated by modern standards - but one way or another, this game is one of the top Co-Op games I have played. I refuse to call it a horror game, though, and getting into the right lobbies and being able to have a fun experience is, at times, rather a game of patience. \n\nIn case you're interested, though, and are a bit unsure: I can say that you will not regret picking up KF. Maybe KF2 is a better choice for you, but that one I leave up to your personal judgement.", "timestamp_created": 1481942928, "timestamp_updated": 1481942928, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.665280461311340332", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "27575436": {"recommendationid": "27575436", "author": {"steamid": "76561197977920186", "num_games_owned": 377, "num_reviews": 1, "playtime_forever": 422139, "playtime_last_two_weeks": 0, "last_played": 1548718369}, "language": "english", "review": "This Game I enjoy as much as I did when it first came out.", "timestamp_created": 1480121436, "timestamp_updated": 1480121436, "voted_up": true, "votes_up": 26, "votes_funny": 3, "weighted_vote_score": "0.671910881996154785", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11214943": {"recommendationid": "11214943", "author": {"steamid": "76561198121872215", "num_games_owned": 119, "num_reviews": 6, "playtime_forever": 5891, "playtime_last_two_weeks": 0, "last_played": 1481141355}, "language": "english", "review": "Dosh Simulator 2009, or \"Killing Floor\" to the uneducated, is a state-of-the-art dosh experience. You play as one of a wide variety of characters (be they military, police, or DLC Characters such as a DJ or a Chickenator) tasked with a simple objective: The acquisition and manipulation of dosh. \nThrow dosh in the air and then catch it.\nHurl dosh at your friends as they throw dosh at you.\nWeld yourself into a room and admire your dosh.\nThe possibilites are endless.\nOh, and there might be a couple of experiments - but they just give you dosh.", "timestamp_created": 1405252517, "timestamp_updated": 1405768971, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.695214211940765381", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40494451": {"recommendationid": "40494451", "author": {"steamid": "76561198068439181", "num_games_owned": 723, "num_reviews": 24, "playtime_forever": 2451, "playtime_last_two_weeks": 0, "last_played": 1468410792}, "language": "english", "review": "---{ Audience }---\n\n☐ Kids\n☑ Pro Players\n☐ Casual players\n☑ Everyone Else\n\n---{ Graphics: }---\n\n☐ Potato\n☑ Really bad\n☐ Bad\n☐ OK\n☐ Good\n☐ Beautiful\n☐ Masterpiece\n\n---{ $ Price/quality: }---\n\n☑ Full price\n☐ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Don't do it\n\n---{  Requirements: }---\n\n☑ Potato\n☐ Minimum\n☐ Medium\n☐ Fast\n☐ High end\n☐ nVidia DGX-1 (Super Computer)\n\n---{ ☼ Difficulty: }---\n\n☐ You just need 2 arms\n☐ Ez\n☐ Easy to learn / Hard to master\n☑ Hard (first few hours)\n☐ Dark Souls\n\n---{ Game time/length }---\n\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☑ Endless\n\n---{ Story }---\n\n☐ It doesn't have\n☑ Still better than 50 Shades\n☐ Average\n☐ Good\n☐ Fantastic\n\n---{ Bugs }---\n\n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☐ Few Bugs\n☐ You can use them for speedrun\n☑ Nothing\n\n---{ Others: }---\nMultiplayer: Yes\nSingleplayer: Yes", "timestamp_created": 1519932822, "timestamp_updated": 1519932822, "voted_up": true, "votes_up": 77, "votes_funny": 9, "weighted_vote_score": "0.735122919082641602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23565209": {"recommendationid": "23565209", "author": {"steamid": "76561198018642305", "num_games_owned": 417, "num_reviews": 50, "playtime_forever": 8290, "playtime_last_two_weeks": 0, "last_played": 1490767129}, "language": "english", "review": "Killing Floor before Tripwire sold out", "timestamp_created": 1465972792, "timestamp_updated": 1465972792, "voted_up": true, "votes_up": 53, "votes_funny": 12, "weighted_vote_score": "0.673473834991455078", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "4709627": {"recommendationid": "4709627", "author": {"steamid": "76561198040998000", "num_games_owned": 770, "num_reviews": 37, "playtime_forever": 30114, "playtime_last_two_weeks": 0, "last_played": 1433440083}, "language": "english", "review": "Nice zm game u should give it a try  xD", "timestamp_created": 1316876644, "timestamp_updated": 1385504016, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.6875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32907532": {"recommendationid": "32907532", "author": {"steamid": "76561198137712737", "num_games_owned": 206, "num_reviews": 3, "playtime_forever": 27517, "playtime_last_two_weeks": 0, "last_played": 1550307922}, "language": "english", "review": "Nice & funny game.. Trust me! :D", "timestamp_created": 1498619496, "timestamp_updated": 1498619496, "voted_up": true, "votes_up": 32, "votes_funny": 7, "weighted_vote_score": "0.719835638999938965", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9956083": {"recommendationid": "9956083", "author": {"steamid": "76561198113159775", "num_games_owned": 113, "num_reviews": 7, "playtime_forever": 330019, "playtime_last_two_weeks": 836, "last_played": 1551877207}, "language": "english", "review": "This game is very fun with many people. There are many server that you can choose to play :D.\nYou should play with kindness and help each other :D By the way,I love to play Japan server. It was created by =*ZMT*=Z-MAN admin. I hope you try to play his server.It's very fun and people are very kind :D\nAnd for more things, I have played in IGC servers. It is very fun and more modded zeds and  weapons. If you like more chaostic, try this! \nFYI [url=\"http://steamcommunity.com/groups/InterGamingCommunity\"][b]International Gaming Community[/b][/url]\nPs. sorry for my english", "timestamp_created": 1398632171, "timestamp_updated": 1471185092, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.711310148239135742", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40258152": {"recommendationid": "40258152", "author": {"steamid": "76561198136257861", "num_games_owned": 374, "num_reviews": 41, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1529787450}, "language": "english", "review": "OI YOU!\nSHUT YO MOUF AND LOOK AT MY WAD\nLOADS OF MONEY!", "timestamp_created": 1519150691, "timestamp_updated": 1519150691, "voted_up": true, "votes_up": 15, "votes_funny": 10, "weighted_vote_score": "0.64055323600769043", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30752278": {"recommendationid": "30752278", "author": {"steamid": "76561198042339696", "num_games_owned": 167, "num_reviews": 22, "playtime_forever": 15233, "playtime_last_two_weeks": 0, "last_played": 1490468210}, "language": "english", "review": "Killing Floor is an amazing zed slaying survival horror game that stands outs with features such as:\n-Grimmy atmosphere that consumes you into a collapsing England.\n-Challenging gameplay that keeps you sweaty for most of the game.\n-Character banter that always makes you giggle\n-Tons of maps and weapons for your perk\n\nAfter playing this game for some time and finishing all the achievements i realized what a master piece this game really is.\nThe game offers way more gameplay then the vast majority of games for the same price.\n\nKilling Floor is a classic that will never get old.\n", "timestamp_created": 1490538035, "timestamp_updated": 1490538035, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.656838655471801758", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32499905": {"recommendationid": "32499905", "author": {"steamid": "76561198037920209", "num_games_owned": 763, "num_reviews": 564, "playtime_forever": 276, "playtime_last_two_weeks": 0, "last_played": 1527363391}, "language": "english", "review": "[i]I didn't die. The Floor looked sad, so I thought it needed a hug.[/i]", "timestamp_created": 1497694551, "timestamp_updated": 1497694551, "voted_up": true, "votes_up": 91, "votes_funny": 131, "weighted_vote_score": "0.755920827388763428", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21563815": {"recommendationid": "21563815", "author": {"steamid": "76561198031124857", "num_games_owned": 49, "num_reviews": 8, "playtime_forever": 160187, "playtime_last_two_weeks": 0, "last_played": 1549644042}, "language": "english", "review": "Let's see here.. \nA fan of FPS ? \nA fan of shooting and decapitating zombie heads ? \n\nAs you can see from my hours, what I find is that the community (or friends that you gained from people you met from public games) is the one that makes this old game worth the time. While there are normal solo and objective mode along with mods, the real value comes from multiplayers as this game's main value is through co-op.\n\nThis game have 5 difficulties:\nBeginner (Every zeds drop like flies if you hit them enough)\nNormal (A bit more challenge, needs slightly more coordination between teams, but spam and pray method still works)\nHard (A more difficult challenge, needs better coordination between teams, spam and pray method is not so effective anymore, even level 6s can die pretty quick in hard)\n\nWhy do I stop here? Because the last two difficulties will be discussed later. Now... for first-timers...\n\nYou start out knowing nothing, level 0 perks, killing zeds is your priority, getting powerful guns are a chore, people (in pub games) don't give you money when you need that last $20 for an aa12 or m32 grenade launcher, you spam and pray hoping that those big monsters will die. How come my nade didn't work when the siren screams?\n\nYou went on to play in normal, zeds are harder, that big glowy guy along with that chainsaw dude eat you alive, the patriach kills you like you are nothing. At this point, majority of first-timers went back to beginner, stayed in normal or hard difficulty and very rarely went up to the last two difficulties. Now, this is the point where most players do not continue playing. I have to say that because:\n\n- It takes a lot of commitment to be good in this game, a lot of grinding perks (getting those medic heals, headshots, stalker kills), repetitive maps, even the old status of the game does play a part (as it is 5+ years old which in gaming industry it can be considered a bit out-dated) along with KF2 coming out in full release soon.\n\nFor those that actually stayed and grind those perks, you might finally reach a level 6 which is the highest perk level for one of the perks, finding out you can kill zeds more efficiently, less money to buy guns and ammo at trader, and killing that big glowy guy and chainsaw guy (which now you might know as fleshpounds and scrakes respectively). Nonetheless, the last two difficulties on Killing Floor can and mostly be considered as a 'filter' to see if one does actually have the will and skill it takes to survive. I myself, was a part of these players, spamming aa12 shotguns at scrakes and fleshpounds hoping they will die. But a player and a small number of other players mentioned the ineffectiveness of such methods. At this point as well, some will listen, some won't. Those who don't, will just stay in normal and hard difficulty forever, but they  will be very hard-pressed, let alone to win against the patriach, but just to survive the zed waves in higher difficulties.\n\nThen, one day, after you actually meet a player who you considered as very good (or an expert or can even be considered legends) and listens, a whole new world opens up filled with even more stuff and knowledge. This factor along with a solid teamwork (which are paramount) for the last two difficulties:\n\n- Suicidal (Even more difficult, as zed's HP and their damage goes up along with other limitations such as you can't flinch lock sc with katana, pray and spray method are detrimental. Most level 6 'eternal normal and hard-dwellers' would wipe a lot here. Some of them would just get frustrated and rage quit. The level of teamwork is a step or two up compared to hard and specific perk roles are a must)\n\nAnd once you spend hours learning from the 'expert/pro/legendary' players on multiple ways to kill sc or fp with different perks, you feel ready to take on the highest difficulty:\n\n- Hell on Earth (The highest difficulty, perks with specific roles along with solid communication and teamwork are paramount. Patriach fight is very challenging and damages that the zeds give out along with HP are more painful. One mistake on a critical point could mean an instant wipe even when you have those expert/pro/legendary players)\n\nAt this point, you learn even more ways and tactics to survive Hell on Earth and beat the patriach. Then you realised... when you went down to normal and hard, it becomes almost too easy and people start to notice you killing fp in seconds before it even reaches the team. Before you know it, you are that 'expert' player. \n\nIt needs to be noted that the learning curve goes up exponentially from Hard to Suicidal because the multitude of skills, abilities, and knowledge learned to survive there. If you managed to read and keep on going till this point, congratulations because you are part of the top 5% of Killing Floor players.\n\nThen.. does it end there? When you finally got all the achievements (looking at you, Schneidzekk kill while falling and the one for FP in the back with dwarf axe) ? No, actually. Because there are lots of methods to kill the big zeds (sc, fp and patriach). When you rejoice at the fact that you are finally able to properly lock the patriach with the katana/machete/knife/welder/syringe and dance around it as it tried to chain guns you, you find out there is actually a tournament... with teams all over the world trying to beat each other with the fastest time!\n\nYou took the initiative and form a team with your other expert/pro/legendary friends from different countries, you practice, find faster camp spots, certain tactics as you improved your individual and teamwork skills even more. You also find that your teammate's skills as a whole have developed significantly as well, so much that it would not be possible in a normal setting. Strategies are formed, discussions, insults, banters are made. Gathering people for practice is a chore (It really is!), and giving time for yourself to practice locking patriach with katana. And then tournament comes, as you play in the opening rounds which are recorded for anyone around the world to watch, you wonder to the first time you decided to actually start playing this game, the moment you actually listens to advices and how it lead you from a spam-and-pray player to a solid Hell on Earth player to actually play in a very solid team against the best teams in the world. \n\nThe training, discussions, friendships made, skills learned, I think in the end, it was worth it.\nIf you actually played the game till this point, then congrats... as you are probably a very solid Hell on Earth player.\n\nFor the others that might not have the same 'eagerness', it is a fun game to play with friends, and hey, burning zeds to death is fun too :P\n\nI r8 8/8 m8.", "timestamp_created": 1456837150, "timestamp_updated": 1485275067, "voted_up": true, "votes_up": 28, "votes_funny": 3, "weighted_vote_score": "0.724906444549560547", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8131008": {"recommendationid": "8131008", "author": {"steamid": "76561198081168728", "num_games_owned": 348, "num_reviews": 3, "playtime_forever": 38278, "playtime_last_two_weeks": 0, "last_played": 1539912540}, "language": "english", "review": "This is probably, so far, the best game I've ever played.\nThe community is very good, the game itself is amazing, intense, and above all, it's fun to play.\nI would totally recommend this game to those who don't have it.", "timestamp_created": 1387508767, "timestamp_updated": 1387508767, "voted_up": true, "votes_up": 67, "votes_funny": 0, "weighted_vote_score": "0.757790148258209229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8895306": {"recommendationid": "8895306", "author": {"steamid": "76561198028170873", "num_games_owned": 1036, "num_reviews": 1, "playtime_forever": 11430, "playtime_last_two_weeks": 0, "last_played": 1498906556}, "language": "english", "review": "CodeinePoptart: wssassdwadsssssssssssssssssd22\nCodeinePoptart was eaten by a Scrake", "timestamp_created": 1390960532, "timestamp_updated": 1390960532, "voted_up": true, "votes_up": 788, "votes_funny": 16, "weighted_vote_score": "0.710334062576293945", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32961274": {"recommendationid": "32961274", "author": {"steamid": "76561198367086253", "num_games_owned": 210, "num_reviews": 17, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1502404359}, "language": "english", "review": "A Great Survival Horror Game With  Lots of Zombies and Gore\nI Recommend Playing with Friends its way more fun\nPlayng Alone Is kinda Fun 2 but it can be very difficult without some help.", "timestamp_created": 1498688157, "timestamp_updated": 1498688157, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.676470577716827393", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "13366863": {"recommendationid": "13366863", "author": {"steamid": "76561198115817432", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 115703, "playtime_last_two_weeks": 0, "last_played": 1498341315}, "language": "english", "review": "love this game, have fun for hours :D", "timestamp_created": 1418581389, "timestamp_updated": 1418581389, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.617100000381469727", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "327240": {"recommendationid": "327240", "author": {"steamid": "76561197968690967", "num_games_owned": 938, "num_reviews": 5, "playtime_forever": 269012, "playtime_last_two_weeks": 113, "last_played": 1551808688}, "language": "english", "review": "Intense non-stop first person shooter based zombie action with you at the heart of it in an often dark, gritty yet sometimes humourous game world atmosphere. Hilarious voice acted command system, impressive weapon and player class trader system to satisfy all, intelligent varied AI that will have you chilled and laughing one moment and serious and terrified the next while pushing your awarenss ability to its limits and beyond - all combining for a most amazing unique online co-op experience where team performance and being the hero both have a part to play when it comes to surviving the onslaught of zombie waves, or falling victim as their next meal. Work hard, and you will be rewarded, survive successfully - and you will have a chance for an epic showdown with the Patriarch.", "timestamp_created": 1292807671, "timestamp_updated": 1292807671, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.606293976306915283", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42439524": {"recommendationid": "42439524", "author": {"steamid": "76561198171717681", "num_games_owned": 73, "num_reviews": 2, "playtime_forever": 5297, "playtime_last_two_weeks": 2, "last_played": 1551085960}, "language": "english", "review": "Used to watch SSohPKC's series of this game, didn't knew why it was so popular at the time. Now I know.\nAmazing replaybility, hours of fun and many custom maps. Don't judge on the dated graphics.\nAlso, didn't find the community poisonous. Co-op players do help you with loads of dosh!", "timestamp_created": 1527917337, "timestamp_updated": 1527917337, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.608695685863494873", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "35502393": {"recommendationid": "35502393", "author": {"steamid": "76561198034399732", "num_games_owned": 153, "num_reviews": 13, "playtime_forever": 7511, "playtime_last_two_weeks": 0, "last_played": 1509919909}, "language": "english", "review": "Great game too bad many ppl play biotics and westlondon making the game very boring. The atmosphere is much better when you get steam sales when ppl actualy try new things.", "timestamp_created": 1507231671, "timestamp_updated": 1507231671, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.572473406791687012", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12595914": {"recommendationid": "12595914", "author": {"steamid": "76561198075417243", "num_games_owned": 552, "num_reviews": 14, "playtime_forever": 1308, "playtime_last_two_weeks": 0, "last_played": 1472073467}, "language": "english", "review": "Loadsamoney! \nMoney, money, money!\nDosh!!\nMoney!!\nWho wants some money?\nMake it Rain!!\n\nMoney Simulator", "timestamp_created": 1413905842, "timestamp_updated": 1478011743, "voted_up": true, "votes_up": 501, "votes_funny": 363, "weighted_vote_score": "0.732385039329528809", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40034600": {"recommendationid": "40034600", "author": {"steamid": "76561198066224775", "num_games_owned": 532, "num_reviews": 394, "playtime_forever": 8493, "playtime_last_two_weeks": 0, "last_played": 1532059343}, "language": "english", "review": "Lots of Killing\n\nPlenty of Floors\n\nNice alt to L4D / L4D2\n\nMore wave based\n\nLots of maps and skins\n\n10/10", "timestamp_created": 1518480601, "timestamp_updated": 1525622168, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.616925597190856934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8644301": {"recommendationid": "8644301", "author": {"steamid": "76561198023398150", "num_games_owned": 55, "num_reviews": 7, "playtime_forever": 369140, "playtime_last_two_weeks": 508, "last_played": 1551650647}, "language": "english", "review": "Dosh Simulator 2009", "timestamp_created": 1389346654, "timestamp_updated": 1389346654, "voted_up": true, "votes_up": 795, "votes_funny": 1, "weighted_vote_score": "0.690359115600585938", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45134588": {"recommendationid": "45134588", "author": {"steamid": "76561198144402303", "num_games_owned": 111, "num_reviews": 31, "playtime_forever": 90921, "playtime_last_two_weeks": 248, "last_played": 1551593673}, "language": "english", "review": "\"Killing Floor\"\nYou can't kill the floor\nWait.. that's overrated. Well I'll try to say all I know of this game.\n\nStory is simple. London suffers an outbreak of genetic soldiers called the Zeds, made by Horzine, and you must survive the outbreak by killing all of the failed experiments.\nIs a simple game by words, but is hard to master, specially when you play alone.\nYou can choose betwheen 7 classes or perks, and each of them has their weapons. Buy them with the money you earn each wave, but of the perk you use, because it has discount AND advantages since you level up.\nKF has 5 difficulty modes, each of them increase the damage, ammount and resistance of zeds. If you dedicate time to the game, you may need some good guides to learn more hidden stuff of this magical game.\nThe only disavantage would be the DLC, they are overpriced but they are useful, not in term of skins but the weapons.\n\nVery Addictive, fun and hardcore, fully recommended.\nAnd for those who compare KF1 to KF2, I didn't play KF2 but saw enough to talk. KF1 IS WAY harder than KF2, requires more knowledge and skill.\n\n[h1]9.8/10[/h1]", "timestamp_created": 1538819969, "timestamp_updated": 1538819969, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.642686784267425537", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26083198": {"recommendationid": "26083198", "author": {"steamid": "76561198106072419", "num_games_owned": 71, "num_reviews": 10, "playtime_forever": 2592, "playtime_last_two_weeks": 0, "last_played": 1472532946}, "language": "english", "review": "Yet another undying classic.\n\nKilling floor is one of those arcade-like shoot em up games. With a mixture of proper FPS gameplay and some wacky weapons. Cause of its age it can run on almost any computer these days. And you will never have a shortage of servers. (Unless its on HoE Difficulty) Never-the-less. Its very challenging on higher difficulties. Which is a big thumbs up from me. As it makes for very intense gameplay. Each class has its role. And some are weaker against certain enemies. And some are buffed for them. Very time consuming to level up each class. Worth it in the end in my oppinion.", "timestamp_created": 1476689251, "timestamp_updated": 1476689251, "voted_up": true, "votes_up": 20, "votes_funny": 2, "weighted_vote_score": "0.643866896629333496", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9222075": {"recommendationid": "9222075", "author": {"steamid": "76561198064199035", "num_games_owned": 712, "num_reviews": 26, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1374182605}, "language": "english", "review": "What did Floor do to deserve this? Buy and find out", "timestamp_created": 1393095431, "timestamp_updated": 1393095459, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.634017407894134521", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12726830": {"recommendationid": "12726830", "author": {"steamid": "76561197985853116", "num_games_owned": 607, "num_reviews": 42, "playtime_forever": 1004, "playtime_last_two_weeks": 0, "last_played": 1425106986}, "language": "english", "review": "[h1]Killing Floor[/h1]\n[table]\n [tr]\n  [th]Field[/th]\n  [th]Rating[/th]\n  [th]Review[/th]\n [/tr]\n [tr]\n  [td][b]Graphics[/b][/td]\n  [td][h1]7[/h1][/td]\n  [td]Not terrible, not great. Killing floor is a few years old at this point, but the graphics are still satisfying to look at. The environments are nothing to oogle over, but the game does an overall good job of generating atmosphere.[/td]\n [/tr]\n [tr]\n  [td][b]Gameplay[/b][/td]\n  [td][h1]7.5[/h1][/td]\n  [td]A solid, fast-paced FPS. Killing floor does a great job of allowing you to feel like you are, to some extent, surviving an assualt of \"zombies.\" The guns are satisfying to shoot, and the interface is clean. The barricade feature makes for great gameplay and intense moments, if you make use of it. The biggest problem Killing Floor faces gameplay wise is the leveling system. It is painfully slow to gain new ranks in this game. Thankfully they are addressing this in Killing Floor 2. Know this also: There are a lot of things you can buy with real money in Killing Floor, BUT, they do a good job of not putting you at a disadvantage if you don't have the DLCs. You still have what feels to be a full, solid game, with lots of maps (not to mention the community workshop), and a couple game modes![/td]\n [/tr]\n [tr]\n  [td][b]Story[/b][/td]\n  [td][h1]N/A[/h1][/td]\n  [td]There is a story here, but it exists purely to give you a background: \"Terrible experiment gone wrong.\" [/td]\n [/tr]\n [tr]\n  [td][b]Multiplayer[/b][/td]\n  [td][h1]8.5[/h1][/td]\n  [td]Killing Floor is at its best when you're playing with a group of friends, trying to survive against the merciless onslaught of enemies the game throws at you. You'll find yourselves rushing to a safe place to hole up and defend, each of you watching the barricaded doors as they are slowly pounded down by the terrors on the other side. Or, you'll make the mistake of seperating, and listen as each of your friends dies off, one by one. There is still a fairly active community in this game, so you'll be able to enjoy it even if you pick it up so long after release.[/td]\n [/tr]\n [tr]\n  [td][b]Replayability[/b][/td]\n  [td][h1]7[/h1][/td]\n  [td]Killing Floor has plenty of maps to play through, with tons more added by the community. Having owned the game for several years now, I've found that I do keep coming back to this one to have a solid good time with friends. That being said, despite the plethora of maps you are given, Killing Floor can end up feeling very repetitive at times. All in all, you'll keep coming back to play Killing Floor, but it won't be every day or week.[/td]\n [/tr]\n [tr]\n  [td][h1]Overall[/h1][/td]\n  [td][h1]7.6/10[/h1][/td]\n  [td]Killing Floor is certainly one of the best zombie shooters out there, and I recommend it to anyone that enjoys a solid FPS. If you're looking to capture the feeling of \"surviving,\" Killing Floor can do the trick for you for awhile. Eventually it boils down to be an FPS with the enemies skinned as Zombies. Which isn't necessarily a bad thing. If you see this one on sale, pick it up. They are constantly updating it with fun new maps and reskinned enemies. It's not a purchase you will regret.[/td]\n [/tr]\n[/table]\n\n[i]If you liked this review, feel free to check out my curator page:\n[url=http://store.steampowered.com/curator/7035284-The-Tipster/]The Tipster[/url]\n\nYou are also welcome to join our group and play/discuss games together, here:  [url=http://steamcommunity.com/groups/The_Tipster]The Tipster[/url][/i]", "timestamp_created": 1414858832, "timestamp_updated": 1415673576, "voted_up": true, "votes_up": 235, "votes_funny": 14, "weighted_vote_score": "0.749633491039276123", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40911921": {"recommendationid": "40911921", "author": {"steamid": "76561198001306275", "num_games_owned": 136, "num_reviews": 39, "playtime_forever": 26143, "playtime_last_two_weeks": 0, "last_played": 1510976988}, "language": "english", "review": "europeans earn money to buy guns by killing not-zombies.", "timestamp_created": 1521425994, "timestamp_updated": 1521425994, "voted_up": true, "votes_up": 35, "votes_funny": 22, "weighted_vote_score": "0.681400775909423828", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9122678": {"recommendationid": "9122678", "author": {"steamid": "76561197982995489", "num_games_owned": 1230, "num_reviews": 335, "playtime_forever": 1275, "playtime_last_two_weeks": 0, "last_played": 1373260929}, "language": "english", "review": "ENG:\n\nFunctional and diffrent zombie shooter game! Unfortunately, the game suffers from multiple connections to the servers and the difficult creation & too much dlc.\n\nFIN:\n\nToimiva ja erillainen zombi räiskintä peli! Kärsii valitettavasti monipelin yhteyksistä ja hankalasta serverien luomisesta ja liikaa dlc.", "timestamp_created": 1392480402, "timestamp_updated": 1492626952, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.691820025444030762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13245560": {"recommendationid": "13245560", "author": {"steamid": "76561198115244994", "num_games_owned": 36, "num_reviews": 3, "playtime_forever": 69718, "playtime_last_two_weeks": 0, "last_played": 1546724685}, "language": "english", "review": "This game is ridiculous. If you're looking for a challenging zombie fps, get this. It's ridiculously addicting, too.", "timestamp_created": 1417827350, "timestamp_updated": 1417827350, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.628039896488189697", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29587838": {"recommendationid": "29587838", "author": {"steamid": "76561198073087523", "num_games_owned": 143, "num_reviews": 18, "playtime_forever": 1502, "playtime_last_two_weeks": 0, "last_played": 1486621584}, "language": "english", "review": "I only recently have gotten into this game, but I've already fallen in love with it. Each Zed feels unique and threatening in their own way, even clots can mess you up if you get swarmed by them. Many combos and techniques are needed in high level play to take out higher level zeds and you always feel like there's room to improve. Most maps feel well balanced and most weapons feel unique.\n\nWith a game concept as simple as \"survive as long as you can\" you think it would get boring after a while. But it simply doesn't. This game is just addictive. buy it already.", "timestamp_created": 1485792535, "timestamp_updated": 1485792535, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.64199519157409668", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13934925": {"recommendationid": "13934925", "author": {"steamid": "76561198138297925", "num_games_owned": 126, "num_reviews": 1, "playtime_forever": 33965, "playtime_last_two_weeks": 0, "last_played": 1542530342}, "language": "english", "review": "This is the game that got me back into gaming. I absolutely love this game. I'm not sure if I'll ever get sick of it, I always keep coming back to it. The events are pretty cool too. I also think the soundtrack deserves a mention because it is perfect.\n\nThe only let down for me is the lack of female characters. One women of colour as a trader is not good enough guys. There's only 4 women characters, 3 of which you must pay for. It's 2015, come on Tripwire, we need representation. \n\nAside from that, this game is badass. 9/10", "timestamp_created": 1420942758, "timestamp_updated": 1420942758, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.629171788692474365", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12256984": {"recommendationid": "12256984", "author": {"steamid": "76561198087194798", "num_games_owned": 293, "num_reviews": 20, "playtime_forever": 117076, "playtime_last_two_weeks": 0, "last_played": 1533716683}, "language": "english", "review": "I have been playing Killing Floor since not long after it came out and I still can't get enough of it.\nOne great thing about it, is that it's all skill-based. You cannot play the game for the first time and jump to a higher difficulty and expect to do good. You won't. The game has quite a bit of a learning curve. Even for people who have been playing awhile, taking jumps to higher difficulty is tough.\nThe game is very in depth with multiplayer. Each of the 7 perks has their pros and cons, and each has a \"role\" for the team. One of the most fun things is getting a team of friends, working together and owning the Patty. ;) When it really comes down to it, the most important thing about playing CO-OP KF, is knowing your role. What to do, and not to do, and when playing with a team, not knowing what to do can kill you all.\nThere are 7 different perks, or specialists. Each perk has specific weapons for their class. There's also a leveling system for the perks. With each level you gain your perk gets better.\nThe weapon mechanics are great. The wide range of weapons and weapon types is even better. There's everything from swords, to snipers, to flamethrowers, multiple kinds of pistols, ETC. There really is something for everyone.\nNow, I've read some reviews and some people have said that the game is \"pay to win\" and that you need the DLC weapons. Wrong. You most certainly do not need them to win, and half of them are kinda sucky anyway. \nThe maps are all different and cool, plus there's hundreds of workshop maps to play.\nAnd if you find yourself headbanging to the games soundtrack... you are not the only one. It's sweet.\n\nI recommend this game 100%. I feel the developers truly care about their product and I have never anticipated a sequel as much as I am KF2.\n\nUPDATE: KF2 is garbage.", "timestamp_created": 1411807450, "timestamp_updated": 1467306982, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.672883927822113037", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9358865": {"recommendationid": "9358865", "author": {"steamid": "76561197971250143", "num_games_owned": 385, "num_reviews": 8, "playtime_forever": 263068, "playtime_last_two_weeks": 0, "last_played": 1501040356}, "language": "english", "review": "The Short: Get it if you want an old school FPS that's co-op based. Old game engine, no story really to care of, good gun mechanics, hard learning curve relative to modern FPS's (COD MW, Battlefield); balanced game play, rewards skill over earned perks/guns.\n \nThe Long:\nIt's kind of weird to have a game with really a rubbish, tissue thin premise and graphics from a decade ealier to have anything really to offer in this COD MW era of FPS.  On a whim and a steam sale, I bought KF just for kicks.\nBy the looks of it I have the guns, the companions and a dumb AI to deal with, this should be a cake walk for an hour or so, and then I'm back to Far Cry 3/BD...well, Far Cry is crying in its lonely corner with Michael Biehn for a while now.... What KF lacks in graphic polish and writing, it has in game balance, this is  where the classes are complimentary towards each other, every shot counts when things get thick and there are no gun/bomb/airstrike/gunship to save you. If you're not playing to the strengths of your class, your team mates will and do yell viciously at you. The real satisfaction is when you play with a good team and beating up the baddies :3\nEven if you find that it's getting easy to survive then just crank up to Hell on Earth, and you'll find out how old school FPS Killing Floor will drag down your ego. There also is a huge modding community given KF's relative small player pool against the likes of COD and Battlefield. I did play the Halos, COD MW 1+2+BO and BF 2 for extensive amounts of time on Xbox, but this is a good alternative and reminds me of my Unreal 2/UT days :3", "timestamp_created": 1394078402, "timestamp_updated": 1394091708, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.64942401647567749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42922649": {"recommendationid": "42922649", "author": {"steamid": "76561198823144464", "num_games_owned": 44, "num_reviews": 3, "playtime_forever": 417, "playtime_last_two_weeks": 0, "last_played": 1529673024}, "language": "english", "review": "Good old games that can run on windows xp", "timestamp_created": 1529654886, "timestamp_updated": 1529654886, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.597989976406097412", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "46198670": {"recommendationid": "46198670", "author": {"steamid": "76561198087454381", "num_games_owned": 250, "num_reviews": 19, "playtime_forever": 71306, "playtime_last_two_weeks": 184, "last_played": 1551855223}, "language": "english", "review": "Best game than kf2 \n\ntrust me.", "timestamp_created": 1542872443, "timestamp_updated": 1542872443, "voted_up": true, "votes_up": 25, "votes_funny": 4, "weighted_vote_score": "0.644770801067352295", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34097956": {"recommendationid": "34097956", "author": {"steamid": "76561198213098768", "num_games_owned": 512, "num_reviews": 25, "playtime_forever": 16634, "playtime_last_two_weeks": 392, "last_played": 1551877563}, "language": "english", "review": "Old game and still full of fun", "timestamp_created": 1502178344, "timestamp_updated": 1502178344, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.627369165420532227", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23311869": {"recommendationid": "23311869", "author": {"steamid": "76561198013685958", "num_games_owned": 61, "num_reviews": 18, "playtime_forever": 40509, "playtime_last_two_weeks": 0, "last_played": 1538025374}, "language": "english", "review": "Better than 2", "timestamp_created": 1464713811, "timestamp_updated": 1506602870, "voted_up": true, "votes_up": 67, "votes_funny": 9, "weighted_vote_score": "0.702660083770751953", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "45581918": {"recommendationid": "45581918", "author": {"steamid": "76561198439562938", "num_games_owned": 511, "num_reviews": 61, "playtime_forever": 564, "playtime_last_two_weeks": 0, "last_played": 1547986379}, "language": "english", "review": "Nice game!", "timestamp_created": 1541163285, "timestamp_updated": 1541163285, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.658435702323913574", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31345939": {"recommendationid": "31345939", "author": {"steamid": "76561198258445335", "num_games_owned": 119, "num_reviews": 63, "playtime_forever": 43447, "playtime_last_two_weeks": 42, "last_played": 1551517987}, "language": "english", "review": "Well done fixed and tweaked retail version of the UT2004 co-op survival horror mod developed back as far as 2004. Set in possibly near future, in London, where a project to create super soldiers first is officially cancelled, then by the head scientist, secretly continued..and it of course goes wrong and the unfinished clone mutants have laid waste to everything in their way..your job, make those despicable, vile creations go away with many different ways.\n\nWhat's good:\n\nThe gunplay..oh MAYN the gunplay. Excellent shot sounds, my top 3 favorites must be LAW, MKb42 and flamethrower. All in all, every sound fits the weapon. Reload sounds no less are great, very few stock sounds used, and they are simply perfect balance between too low-key and overly rough and over-the-top. Animations are fluid, the weapons have a fittingly harsh recoil, not realistic yes but who the f*** wants realistic guns in any manner, in a game like this? Reload animations are nice. Lastly, guns give proper physical feedback, shaking your vision mad, even the Beretta M9. Love that shit.\n\nThe Zed Time feature, randomly a slow-motion kicks in that lasts for a couple of seconds, lets you see them nice gun animations in detail, Specimens getting their limbs torn, heads popped and with demolitions slowly seeing how they turn to red paste..also it lets you catch a grasp accurately on what's going on around you, you can look around a bit to think what to do once the game speed returns to normal.\n\nSpecimen visual designs and their behavior, all of them have some kind of purpose to help and murder those damn survivors for once. They look suitably scuffed, grimy and some a bit grotesque and quite intimidating. Some of them are still pretty much human but others are full on cyborg mutants and have proper body horror and look disfigured. So their behavior then..so as I said all of them cooperate with their complementary to each other tactics, for example Clots aren't that bad even in groups but if they grab you you're in for a bad time because the bigger muties can get to pummel and bash you unhindered or simply a swarm of lesser specimens might overpower you. And Husks prevent players from being safe by simply staying away..those FUCKERS will no doubt at some point remove a good chunk of your precious armor and deal over the course of a few seconds a moderate dent to your health. Bloats can massively impede a readily panicking player from aiming properly and seeing what's going around themself. Crawlers often finish a lone terminally injured player who was just about to get some distance from a starving, mad horde and continue fighting..\n\nGreat level variety, some of them almost solely outdoors maps, some a good 50/50 mix of outdoors and indoors, both viable camping areas. Also there are night time, evening etc maps and some with quite somber weather. Some have very nice vertical axis variation too! And there are some pretty nice Workshop maps.\n\n-Proper weapon variety in each class, in some classes though it's rather damage per second difference vs. one shot damage. But a weapon with high DPS vs one hit power suits certain situations better. \n\n-Over the top but not completely unrealistic gore. Ahh yes, gibs, rough cut wounds in decapitations, freaks burnt to a crisp and blood is here aplenty. Properly stomach churning and never gets old as Demolitions to fire a grenade or HEAT rocket into a squad of specimens and see a combination of a few turning to red mist and small giblets and the rest of cadre flying midair amusingly, having gotten some limbs partially torn off and being all bloodied and wounded everywhere in their twisted bodies. As firebug, the burnt look of zeds after getting some of your hellish weaponry's taste is nice. They're all dark red and smoldering still. As berserker, the decapitation wounds are nice looking, no clean cuts here ladies and gents! Lastly, headshots are never endingly satisfying, with that awesome crack sound of the bullet impact and the resulting pieces of brains flying with blood trailing behind.\n\n-Soundtrack. Action tunes, industrial metal and standard industrial tunes too, great stuff that has the apocalypse/science gone bad/outbreak/biohazard feeling to it, by zYnthetic. Harsh, gritty tunes, of varying speeds to provide varying levels of adrenaline. Then there are a few more standard metal tunes, by Dirge and one really great, absolutely furious death metal instrumental by a swede band, plays in Wyre and Foundry.\n\nWhat isn't good.\n\n-The slight lack of voicepack variety, could have been like 4 different voices or so. I do like the voice acting though, it's silly and not all too good but in a charming way.\n\n-You can't disable Trader's lines while still keeping the random player chatter on..\n\n\nIf you want an intense and damn fun RPGtastic co-op fps, this is for you. 9.0", "timestamp_created": 1493066838, "timestamp_updated": 1509486042, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.629908919334411621", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18869837": {"recommendationid": "18869837", "author": {"steamid": "76561198013870790", "num_games_owned": 2053, "num_reviews": 5, "playtime_forever": 63113, "playtime_last_two_weeks": 0, "last_played": 1483419675}, "language": "english", "review": "Well worth the DOSH it has given me many years of fun.", "timestamp_created": 1446620135, "timestamp_updated": 1446620135, "voted_up": true, "votes_up": 108, "votes_funny": 38, "weighted_vote_score": "0.715138018131256104", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12694147": {"recommendationid": "12694147", "author": {"steamid": "76561198126109694", "num_games_owned": 565, "num_reviews": 54, "playtime_forever": 830, "playtime_last_two_weeks": 0, "last_played": 1515962486}, "language": "english", "review": "https://www.youtube.com/watch?v=ON-7v4qnHP8", "timestamp_created": 1414675422, "timestamp_updated": 1414675422, "voted_up": true, "votes_up": 276, "votes_funny": 263, "weighted_vote_score": "0.745720088481903076", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 100, "review_score": 9, "review_score_desc": "Overwhelmingly Positive", "total_positive": 29665, "total_negative": 1374, "total_reviews": 31039}}
