{"reviews": {"49040078": {"recommendationid": "49040078", "author": {"steamid": "76561198107873039", "num_games_owned": 7, "num_reviews": 5, "playtime_forever": 19570, "playtime_last_two_weeks": 649, "last_played": 1551774403}, "language": "english", "review": "Funnnnn game  because I like to troll sometimes", "timestamp_created": 1550355277, "timestamp_updated": 1550355277, "voted_up": true, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.569752275943756104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48954609": {"recommendationid": "48954609", "author": {"steamid": "76561198119606187", "num_games_owned": 64, "num_reviews": 42, "playtime_forever": 5534, "playtime_last_two_weeks": 2779, "last_played": 1551790781}, "language": "english", "review": "Good with friends, have some bugs, but i will recommend it. (7/10)", "timestamp_created": 1549998372, "timestamp_updated": 1549998372, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547325074672698975", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49075474": {"recommendationid": "49075474", "author": {"steamid": "76561198885969235", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1550507209}, "language": "english", "review": "What is the whole \"this server has been terminated(4)\"\nFun gameplay but a lot of maintenance problems\n", "timestamp_created": 1550506773, "timestamp_updated": 1550506773, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49349555": {"recommendationid": "49349555", "author": {"steamid": "76561198181262054", "num_games_owned": 2, "num_reviews": 3, "playtime_forever": 518, "playtime_last_two_weeks": 518, "last_played": 1551720104}, "language": "english", "review": "Emperor eye", "timestamp_created": 1551677280, "timestamp_updated": 1551677280, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49127492": {"recommendationid": "49127492", "author": {"steamid": "76561198139664527", "num_games_owned": 94, "num_reviews": 4, "playtime_forever": 3789, "playtime_last_two_weeks": 491, "last_played": 1550949453}, "language": "english", "review": "We be ballin'\n\n\n\nFun but kinda pay to win.", "timestamp_created": 1550697884, "timestamp_updated": 1550697884, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48858738": {"recommendationid": "48858738", "author": {"steamid": "76561198310655142", "num_games_owned": 41, "num_reviews": 2, "playtime_forever": 4111, "playtime_last_two_weeks": 1485, "last_played": 1551849350}, "language": "english", "review": "shit game. too many crashes", "timestamp_created": 1549671491, "timestamp_updated": 1549671491, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.496551752090454102", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49143108": {"recommendationid": "49143108", "author": {"steamid": "76561198076389027", "num_games_owned": 159, "num_reviews": 1, "playtime_forever": 26, "playtime_last_two_weeks": 26, "last_played": 1550776423}, "language": "english", "review": "the most asinine menu i have ever played, it is 2 complicated to even invite friends to a so called \"private match\" apperantly any one can join do not waste ur time", "timestamp_created": 1550776567, "timestamp_updated": 1550776567, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.47826087474822998", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49163276": {"recommendationid": "49163276", "author": {"steamid": "76561198251305766", "num_games_owned": 47, "num_reviews": 14, "playtime_forever": 1427, "playtime_last_two_weeks": 1427, "last_played": 1551725993}, "language": "english", "review": "when i play with andrew it crashes and if any of the characters in t he game is named andrew thats not what im talking about i mean my friend andrew lui from pennsylvannia", "timestamp_created": 1550874245, "timestamp_updated": 1550874245, "voted_up": false, "votes_up": 1, "votes_funny": 12, "weighted_vote_score": "0.369509041309356689", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47637358": {"recommendationid": "47637358", "author": {"steamid": "76561198065036966", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 56187, "playtime_last_two_weeks": 0, "last_played": 1549423533}, "language": "english", "review": "This game is fun on a superficial level. The many skills involved in this game are aesthetically pleasing when executed correctly and the tactics (on defense or offense) are fun and proven to be even challenging at times. As one of the rare multiplayer \"Free to Play\" sports games, It could have easily been top of the Twitch streams daily, had they been managed by a competent company.\n\n I wont even touch the actual gameplay bugs or meta issues for this review, but something else I believe many new potential players need to adhere to.\n\nFirstly, this game has the most disgusting P2W model I've ever seen point blank and period.\n\nIf you pay for the features in this game, you are getting a substantial advantage over other players who don't. Kind of like a normal P2W game right? No. The bigger problem is that the game REQUIRES you to make a decently high investment (of around $100) in order to unlock the primary features of this game, and not owning them will SEVERELY limit your gameplay expirience. Features that come to mind (but i know for a fact I'm missing more) are skill slots, clothing attributes, enhancements (the newest P2W feature), and CARDS. \n\nProbably, one of the most abhorrent P2W feature in this game is the \"Card\" system. Not only could you pay for cards (that are actually worth using, the common ones are objectively trash since the company purposely made it so) , but there is a RNG element that is HUGELY not in your favor to get good cards. It has been debunked on the forums and various steam discussion that the chance to get the cards your character needs are 0.1% (rounded)! Unfortunately, the RNG and P2W doesn't stop there! You now have to now PAY for REROLLS on the sub attributes cards have and hope to get subs that actually complement your character. This will take several rerolls for the general census and cost even MORE money on top of what you spent already. \n\n*To follow up on this, last week Joycity has made a nerf to the shooting performance of EVERY position and their base success rate. This means that if you don't have the Legendary or All star cards (The best cards in the game), your character will now miss even WIDE OPEN shots on a CONSISTENT basis.*\n\nSecondly, the community as a whole is a REALLY pathetic phenonmen to behold.\n\nThe people who would spend hundreds of dollars on a free game only so that they can have dominance over other players are sad (to say the least of course). \n\nThe people who spend hundreds and/or THOUSANDS of dollars to a company that does not give a complete sh!t about them and their fellow players (the spenders are aware and vocal about this) and JoyCity made it IMPLICATIVELY clear that they DO NOT care about whether or not they are returning customers by not addressing the several critical issues that the game has, yet STILL pay the company to feed on their elitism and insecurities are INSANE.\n\nThese players are not few and far between either. It's the MAJORITY of the playerbase who are abrasive, stuck up, tight knit, and arrogant about their status of being \"extravagant\" Pay to Win players. \n\nIf you still play this game after reading this, fair enough. Some people need to learn things first hand, but nonetheless I still feel obligated to warn anyone who is interested in this game:\n\nFreestyle 2 is a classic case of a potentially good game being ruined by a terrible company.\nOne of the worst communities I've been apart of. It's just straight toxcity, snobbery, and desolate.\nIt is dangerously easy to rack up an unecessary expense when playing this game.\nListen to those who made the mistakes so that now you wont have to make them.\n\nPlease comment below if you have any questions or even objections to what's been said.\n\nThanks for reading and have a great day.\n\nEdit 12/21: Muthafuca says, \"not sure how is this p2w.. ive been playing this game for years. havent spend a single dime and my character beats any cash players out there. and theres tons of events thats gives away a lot of free stuff like skills slots , sub attri cards , free spcs, free gcash. i dont get why people still complain. lol seriously..\"\n\nThis is something that I failed to mention. JoyCity DOES have periodic events that give away free stuff. However, Muthafuca fails to point out though that these events are for the MOST part TRASH (just look at the current events going on right now on the website). I'd like to also note that he does not object on my comment that sub attri cards are a fraud like feature. (I've personally won the 100 sub attri card lottery and still failed to get a good reroll). As a matter of fact, MuthaFuca did not even argue against ANY of the specific evidence that I have provided in this review. \nHis main objection is that; because he has accrued enough items and rewards from events over the years, his character was able to compete against \"cash players\" as a result of that, making the game NOT p2w. It's a weak counter arguement saying that because this game gives away rewards from events periodically (That are OBJECTIVELY bad among the community, the rewards that he specifically speaks of are EXTREMELY RARE) he \"can't see how this game is p2w\". It's actually bothersome if he read each point I made (I'm doubtful) on why IT IS p2w and still came to reach that conclusion.\n\n\n*Regardless, you still have to give credit where it's due. Giving away free stuff (bad or good) to the community is a generous act and I commend JoyCity for doing so.*", "timestamp_created": 1545258526, "timestamp_updated": 1547149036, "voted_up": false, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.748645901679992676", "comment_count": 7, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "22930871": {"recommendationid": "22930871", "author": {"steamid": "76561198044816548", "num_games_owned": 30, "num_reviews": 4, "playtime_forever": 15240, "playtime_last_two_weeks": 0, "last_played": 1499213148}, "language": "english", "review": "The first negative aspect is the toxicity of the game. Theyre naive enough to insult and berate a teammate for a mistake when they also make mistakes. Through levels 1-23 I genuinely enjoyed the game. But when I hit 24 and was [i]forced[/i] to go to the next server I was annihilated. The players were 2x my speed. My sprint was slower than their jog. The way the advancement in this game is setup favors veterans whom haave already achieved level 50 and give the new players near no hope. Was fun until level 24 so if you're looking to kill some time playing this game for a week or so is a good option", "timestamp_created": 1463077766, "timestamp_updated": 1463184680, "voted_up": true, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.777737319469451904", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "45399501": {"recommendationid": "45399501", "author": {"steamid": "76561198185117778", "num_games_owned": 2, "num_reviews": 4, "playtime_forever": 3991, "playtime_last_two_weeks": 0, "last_played": 1549627924}, "language": "english", "review": "1 character = 20$ LOL. I recommend it but the cash items are very overpriced. for god's sake. The game is dying, lower the prices, the players will buy them. I assure you.", "timestamp_created": 1540260494, "timestamp_updated": 1540260494, "voted_up": true, "votes_up": 33, "votes_funny": 3, "weighted_vote_score": "0.800571322441101074", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48196292": {"recommendationid": "48196292", "author": {"steamid": "76561198132988681", "num_games_owned": 88, "num_reviews": 16, "playtime_forever": 6472, "playtime_last_two_weeks": 0, "last_played": 1550281315}, "language": "english", "review": "please bring freestyle football back please please :(", "timestamp_created": 1546987513, "timestamp_updated": 1546987513, "voted_up": true, "votes_up": 27, "votes_funny": 4, "weighted_vote_score": "0.739309608936309814", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33965575": {"recommendationid": "33965575", "author": {"steamid": "76561198058419001", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 1860, "playtime_last_two_weeks": 0, "last_played": 1483746810}, "language": "english", "review": "This game was fun at first then i encountered this guy named slamjoe. my dude was playing as an ape and he was stackin with that p2w gear. Almost every game afterwards i would encounter the prince of saudi arabia or martin shkreli rolling up with +100 gear that screamed p2w.", "timestamp_created": 1501659138, "timestamp_updated": 1501659138, "voted_up": false, "votes_up": 16, "votes_funny": 8, "weighted_vote_score": "0.680182993412017822", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38793101": {"recommendationid": "38793101", "author": {"steamid": "76561198067671584", "num_games_owned": 79, "num_reviews": 3, "playtime_forever": 214961, "playtime_last_two_weeks": 1457, "last_played": 1551495253}, "language": "english", "review": "I am now changing my review from bad to worse. These developers simple dont give a f**k about anyone but themselves.\n+It gets ddosed sometimes, yes thats a good thing, f**k em.\n\n-They litterely just banned over half their entire playerbase over a tiny bug, knowing that is enough to finally quit, thats a whole new low. Anyone that recommended this game is sure to change their review after this. 04/04/2018 the day the game went from trash to utter tuberculosis.\n- Pay to win, no doubt about it.\n- SG with 5000$ dollars spent are everywhere and rule the game.\n- It's cancer\n- The community is cancer, I should know I'm part of it. \n- If you play against someone with 100ping+ you lose. \n- There are plenty of hacks, bugs and exploits, used them myself. \n- There is no way in hell you can do anything in this game without spending atleast 300$\n- Developers dont care about you, they keep adding new stuff to the game without fixing the bugs of the older updates.\n- Servers are terrible, you got 15 ping? it will go up to 30-45.\n- Full of cancerous russians and asian players with 300 ping that teleport to the 3p line and shoot in your face. \n- IF YOU ARE NEW, THERE IS NO CHANCE OF YOU DOING ANYTHING, THIS IS NOT A NOOB FRIENDLY GAME.  you will be kicked out of all games,  and cursed at for being new.\n- money hording for 5 years but they dont give you a break\n\nConclusion, play up until level 24 and quit the game.", "timestamp_created": 1514491733, "timestamp_updated": 1522845387, "voted_up": false, "votes_up": 27, "votes_funny": 6, "weighted_vote_score": "0.741010010242462158", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15169451": {"recommendationid": "15169451", "author": {"steamid": "76561198103914512", "num_games_owned": 71, "num_reviews": 1, "playtime_forever": 3319, "playtime_last_two_weeks": 0, "last_played": 1533581817}, "language": "english", "review": "let me give you a proper review of the game i played it since closed beta so most of the people praising it are players who played it before steam and spend TONS of money on it and they're trying to sugercoat the game so gain more players so they can curse at you and humiliate you also call you noob.\n\nPLEASE READ IT ITS A WARNING ABOUT THE GAME.\n\npro:\n-great gameplay.\n-costumization.\n-different dunks.\n-teamwork required.\n-scoring feels satisfying.\n\ncons-\n-HEAVILY p2w (like seriously check the cards your can obtain all cards wich are gold are only obtainable through cash those cards can be upgraded more than 10 times) and don't forget the +10 stats on clothing wich is also only available for cash (with item balls) only free players can only have +5 stats on a clothing piece i calulated the stats you could earn with cash and with ingame money free players can get to +35 on 1 stat paying players can get over +65.\n-HIGLY toxic playerbase don't get fooled by the rookie server the pro server is swarming with assholes bragging that they spend the most money in the game.\n-usseless gm's they ban you if you say bad stuff about the game i already had a warning message from a gm.\n-relies highly on ping for the pf and C position.\n-players posting the most dumbest things on the forums wich has nothing to do with the game its almost as bad as facebook.\n-pf's are highly overpowered they can shoot 3's like a sg, shoot 2's like a sf,dunk like a pf and rebound like a C and pf's has a skill that makes C's completly usseless.\n-C's are HIGHLY underpowered DO NOT!!!!! take that position they got almost completly usseless cause of pf's. \n-mostly foreigners good luck finding english players.\n-idiotic players who keeps wanting an asia server even tough there is 2 asain versions  of the game already.\n-playerbase is next to none before it came to steam and there is a good reason for that.\n-prepare to get kicked out alot. \n-special characters that is only obtainable with cash gaining special atributes.\n-players who have vip cannot be kicked in fact vip players can kick the host.\n-most events require cash\n-cash clothing so big it litteraly blocks your view of your character.\n-special characters have a bigger hitbox\n-tons of exploits like when you playing as a C or PF most of the time you needs to split into 2 to win and either way you get the blame.\n\nreason the game is so p2w is because its following the taiwan version of the game the korean version is 10X better and not p2w at all. if it din't have all those cons the game could have been so much better \n\nthis is the REAL review of the game from a player who played it for 6-5 months\n\nP.S. don't listen to uncle he got the worst excuses like you don't get the timing right like fucking seriously? i jumped the same time as the opponent did get your eyes checked.\nand don't listen that he never paid anything because he would call it \"DONATORS\" \n\nthat match proved my point more than ever.", "timestamp_created": 1427983125, "timestamp_updated": 1428078993, "voted_up": false, "votes_up": 726, "votes_funny": 101, "weighted_vote_score": "0.803520560264587402", "comment_count": 71, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31260442": {"recommendationid": "31260442", "author": {"steamid": "76561198032310653", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 65123, "playtime_last_two_weeks": 0, "last_played": 1545276517}, "language": "english", "review": "A comprehensive review of Freestyle 2: Street Basketball that covers problems that newcomers will not notice until 100+ hours worth of gameplay later.\n1. For new comers, this game is very fun, very appealing, very unique and very attractive. A free to play basketball game with cool skills and smooth animations. This game is very fun if you and your friends are bored and just want to mess around and try a new game. THis game will make you laugh and you will have a great time until you get hooked...\n2. After a few days of playing you start to get frustrated because you begin to lose even though you try and your random teammates begin to yell and are toxic at you. \n3. The community in this game is very very small, as you can see if you search up Freestyle 2: street basketball steam charts. Averaging around 1000 players, and this is spread amongst a few servers: N.A, Europe and Asia. \n4. This small community means you will play against the same players very very frequently. Additioanlly, many veteran players will create new characters so you are always versing the same players, just different characters. \n5. The game is slightly pay to win. You can easily drop $100 on this game if you play it often. Players may spend money on clothes that give stats like rebound, 3 point etc. Or they may spend money on a gamble to obtain legendary card sets which provide large stat bonuses.\n6. There is a really really big underlying problem that is hidden to new players and that is the server imbalance. THe N.A servers are on the west. Any players living on the west (California) get ~30ms ping. If you live central you get ~60ms. If you live east(New York) you get ~90ms. IF you live in south america you get ~100+ms(A.k.a you're screwed and don't play unless you like playing in the past compared to everyone else). Having a low ping offers really really big advantages in this game. If you are a PG and you have 10ms, you can outreb a center who has 90ms. \n7. Gamekiss is money hungry and always creates new events to make them profit, but never fixes bugs within the game. Events like \"SPend 50$ and get additional items\". Additioanlly, gamekiss frequently reuses events that have been created before but just with a different theme. Some examples include bingo, dice roll. And theses events encourage you to pay for extra dice rolls or extra bingo rolls. Some bugs that have been in the game for a long time that is never fixed is the F9 key. The f9 key resets the ball in a waiting room because sometimes the ball bugs and cannot be picked up. The fact that there needs to be an f9 key suggest that gamekiss does not really care about the game and the player experience. The ball should never bug out and need to be reseted. Additioanlly, there are many desyncs in skills. Players see different things happening on their screen compared to other players which causes lag blocks, lag steals, sliding.  And these desyncs have nothing to do with internet but rather the skill being used itself because the desync happens everytime someone uses the skill. (unless the coincidence is so great that each time the player uses the specific skill, backwards two step, their internet lags). \n8. The match making is extremely unfair, and this can be due to the fact that there's a small community so you always verse the same players. You can be a lvl 24 with lvl 24 teammates versing a full lvl 50 team.", "timestamp_created": 1492711031, "timestamp_updated": 1492711031, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.729517579078674316", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15278719": {"recommendationid": "15278719", "author": {"steamid": "76561197978088739", "num_games_owned": 107, "num_reviews": 2, "playtime_forever": 2552, "playtime_last_two_weeks": 0, "last_played": 1428591374}, "language": "english", "review": "First time I felt the need to write a review.  This game is truly satisfying if you're a competition junky. You don't even have to like sport games to enjoy this game.  The gameplay and game mechanics all work well, untill that point where you hit level 24. As a beginner, I started out playing against other noobs and various pro players that had their smurf accounts in the rookie/major league. I had some epic losses, epic victories, various intense close point games that went into second overtime. \n\nEventually, I managed to get to level 25 with a 76% win percentage overall, I felt like a solid player that played his role ( PF ) well. In good matches, I'd block about every shot, bad matches I'd let a few slide.   All the fun in the game stopped though when I entered the  Pro League.\n\nMatch after match, you get to play against level 50 characters that not only have the most ridiculous skills that you could think, they also have so much experience that not in another 1000 matches could you hope to destroy them. They also have, in almost EVERY case, dropped over 200-300 euros on cash shop roulette style items that grant bonus stats, cards and card upgrades that grant..bonus stats, extra skill slots, etc.  You name it.\n\nSo in quick summary. You might love the game in the beginning, you might think you're a genius rookie player destroying the alt characters of pros. But once you actually get to the pro league, prepare to bend over and take it, over and over again untill you yourself are level 44-50 and have unlocked all the skills + slots. Surely by that time, you would also have dropped atleast 60 euros on the game.", "timestamp_created": 1428592112, "timestamp_updated": 1428592112, "voted_up": false, "votes_up": 192, "votes_funny": 31, "weighted_vote_score": "0.797944724559783936", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30404190": {"recommendationid": "30404190", "author": {"steamid": "76561197964963951", "num_games_owned": 162, "num_reviews": 2, "playtime_forever": 6118, "playtime_last_two_weeks": 0, "last_played": 1491583191}, "language": "english", "review": "This is from the perspective of a new player - i've played a couple hours or so of FSBB2 and here's my honest review. \n\n[h1]PROS:[/h1]\n[list]\n[*] It's essentially 3-on-3 basketball. If you love basketball as a sport and as a game, this right here is it! \n\n[*] Simple at the start, gets more complex as you gain levels and \"skills\". This includes player skill as well as actual skills that you buy for your character ingame. \n\n[*] Additionally, customization is great. Loads of costumes, the ability to pick your skills to do stunts with, as well as \"freestyle\" skills, which you can think of as EX moves which use meter in fighting games;  do enough in a match and they become available for you to use. Cards are also a part of customization, you can load up cards that help you with certain statistics. On level up, you get to distribute points to certain characteristics as well, further making your character truly unique.\n\n[*] Positions function as classes in this game. There're primarily offensive positions and defensive positions, as well as assist positions. All of them are viable, though some are more preferred than others. This gives some distinction between characters but as mentioned in the previous point, you can make your character have strengths that are adverse to contemporary assumptions. (A 3-pt shooting center? Why not?)\n\n[*] Personal preference, but I like the aesthetic and music. It's fitting with the style of FSBB2.\n[/list]\n\n[h1]CONS:[/h1]\n\nOh dear, here we go.\n\n[list]\n[*] Perhaps the most destructive aspect of the game is the community. Predominantly filled with Filipino, Thai, and Indonesian players, English fails to become the primary language in this game. The community is very exclusive in nature, and unless you're part of their culture, you'll be isolated and alienated. Furthermore, many players are extremely toxic in nature, playing the game only to win. They'll personally admonish weaker players as soon as they make a mistake, and they take absurd pride in their own abilities even though they make mistakes as well. You wanna destroy a multiplayer game? This exclusive, toxic-filled community is how your game dies. \n\n[*] Pay-to-win. If you're a F2P player, be prepared to lose. A lot. Unless your team has veteran players or Pay2Win players, there's absolutely a slim margin chance of you ever beating your opponent, especially if they're Pay2Play. The greatest example I can give is that basic stats become skyrocketed the moment you have buffed equipment on. These equipment buffs are equivalent to around 30ish player levels at least, and that's not including the card and pet system as well. Between players of equal skill, the one with P2P equipment will always, ALWAYS win. That's just the nature of the beast. You'll be outrebounded, out blocked, out scored (your blocks will become ineffective). \n\n[*] Lack of a \"skill-less\" channel. You know, the above point can be completely circumvented by the addition of one simple thing - channels that remove all additional buff stats (but lets everyone keep a set number of skills). With this, everyone can play on an equal level. People will be forced to play with others outside their circle and the community will be more accepting. The only drawback with this server is that GameKiss will fail to make any form of profit from it. Who doesn't want to be overpowered?\n\n[*] This is a stretch - but recent games like Overwatch have added special \"swear filters\" that replace the swear words with text to bemean the aggressor. A lack of such a system here (seriously, does anyone even use the report function) allows players to be as toxic and as horrible as they want without any repercussions. \n\nTo be honest, I cannot see myself even reaching level 50 in this game with the current drawbacks. As I level more, the players become more unforgiving and loathing. It's embarassing to even be associated with them and their culture - I routinely kick toxic players from my team even though they may be performing well and giving me wins.\n\nI do love this game, and I can spend HOURS practicing my skillsets on my own - it's just that as a multiplayer game, the community is absolute garbage and leaves me wanting nothing more. \n\nFood for thought: why is it that SEA communities are always incredibly idiotic and taxing to play with? Most of them are asshats and ruin the multiplayer experience for everybody.", "timestamp_created": 1489044302, "timestamp_updated": 1489044354, "voted_up": false, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.703481853008270264", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38361593": {"recommendationid": "38361593", "author": {"steamid": "76561197998359809", "num_games_owned": 70, "num_reviews": 8, "playtime_forever": 104240, "playtime_last_two_weeks": 1595, "last_played": 1551815009}, "language": "english", "review": "I'll be honest, this game is alot of fun.\nBUT, and theres a HUGE but in the end there;\nThis game is pure P2W, in the first 24 levels you'll be mostly facing normal non-p2w players but than it all begin.\nIn the level 24+ channel you'll face characters that you basicly got no chance against, for example, a normal PF should have about 200-210 rebound in level 24+.\nYou will probably face a 230+ reb gkash P2W users who will just ruin the whole game for you.\n\nThose who say this game is not P2W just dont know this game.\nI got enough time on it to easily say, I do not recommend it unless you dont mind spend 40-60$ every couple of months.\n\nP.S: I would like to mention that \"Special Characters\" are achieveable thro' normal playing metods but still the fact that you may face somone who bought himself a huge boost of rebound or lets say 3pt stats is just making it P2W.\nIt is still fun if you dont mind the difference.", "timestamp_created": 1513461916, "timestamp_updated": 1515325747, "voted_up": false, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.730374395847320557", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15261282": {"recommendationid": "15261282", "author": {"steamid": "76561198030932351", "num_games_owned": 70, "num_reviews": 3, "playtime_forever": 1799, "playtime_last_two_weeks": 0, "last_played": 1451576083}, "language": "english", "review": "Bear with me as this is my first game review on Steam:\n\nPros:\n- Great customization (Skills, Freestyle variability, Clothing, Stat allocation)\n- Requires teamwork (Heavy)\n- Crew matches (Like GvG in MMORPGs)\n- Easy to pick up, Hard to master\n\nCons:\n- Community can be toxic (Will explain more later)\n- You can pay for stats\n- Fluid gameplay relies heavily on latency (ping)\n\nFreestyle2 is a great Multiplayer Online 3v3 Streetball game that pleases my thirst for basketball games.\nIt is very easy to pick up (You only use direction keys + 4 basic keys + 2 or 3 more for specific skills),\nbut hard to master.\n\nIt relies moderately on basketball knowledge, such as actual basketball tactics like Pick and Roll, which can be executed in the right situation. To win, you will have to try your best to fulfill your one of five (C, PF, SF, SG, PG) position's purpose.\n\nPositions and their roles are generalized in FreeStyle2, although adventurous stat allocation may lead to fun and creative plays (like improving 3 pointers success rate on C or PFs). \n\nC: Rebounding and blocking, setting up plays under the paint\nPF: Similar to C, but takes an offensive role\nSF: All-rounder (Dunk, rebound, middle jumper, 3s)\nSG: Also an all-rounder with heavier emphasis on 3s\nPG: Playmaker (Passing and loose ball grabbing)\n\nPlaying the position that fits you and doing it right comes with a great rewarding feeling.\nAlso, there are many team compositions which are strong, but you will run into hell lot of weird ones online (Triple Cs)\n\nIf you aren't good at what your position is supposed to be doing by Major (past level 11), you will most likely be dealt with offensive words, telling you that you suck and that you should quit.\n\nThe playerbase isn't large enough to have the greatest matchmaking system and tiers - and this is why sometimes you will face teams that will totally shit on your face. Knowing your position and having individual skills is very important in this game and when a single teammate is not pulling their own weight, it shows definitely. \n\nI highly suggest trying each of the 5 positions before moving onto Major (level 11+)\n\nYou can pay for extra stats (btw you can also do this for free, but not as much). \nDoes it help? Yeah, I guess.\nDoes it win games? Maybe - it makes minimal difference.\n\nWhy is that?\n\nLet's say a player purchased items and also obtained cards to improve his 3 pointers.\nIf you are guarding him perfectly, he won't score any 3 pointers.\nIf you don't and give him open shots on 3s, you should really blame yourself.\n\nTeamwork (Strategy, Individual talent, knowing how each other reacts in certain situations) is much much much much holy freaking so much more important and impactful than stats.\n\nGamekiss will be adding controller support very soon, and I am so excited for that!\n\nGive this game a try. If you like working as a team and enjoy basketball in general, you will love it!", "timestamp_created": 1428481873, "timestamp_updated": 1428482069, "voted_up": true, "votes_up": 138, "votes_funny": 13, "weighted_vote_score": "0.80302661657333374", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26176093": {"recommendationid": "26176093", "author": {"steamid": "76561198176041586", "num_games_owned": 12, "num_reviews": 5, "playtime_forever": 179155, "playtime_last_two_weeks": 11, "last_played": 1551558101}, "language": "english", "review": "Great game but pay to win...", "timestamp_created": 1477198712, "timestamp_updated": 1477198712, "voted_up": false, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.679606854915618896", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33013475": {"recommendationid": "33013475", "author": {"steamid": "76561198212490921", "num_games_owned": 90, "num_reviews": 11, "playtime_forever": 8792, "playtime_last_two_weeks": 0, "last_played": 1506530306}, "language": "english", "review": "The management only care about money not the players #pay2win", "timestamp_created": 1498776308, "timestamp_updated": 1498776308, "voted_up": false, "votes_up": 29, "votes_funny": 4, "weighted_vote_score": "0.708440065383911133", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24520695": {"recommendationid": "24520695", "author": {"steamid": "76561198123371173", "num_games_owned": 205, "num_reviews": 3, "playtime_forever": 9336, "playtime_last_two_weeks": 0, "last_played": 1507146475}, "language": "english", "review": "MY ANTIVIRUS LEGIT PICKED UP A BITCOIN MINER WHEN I UPDATED THIS GAME. THIS NEEDS TO BE OFF THE STEAM STORE. WHAT KIND OF SHIT IS THIS?\n\nEVERYONE REPORT THIS GAME", "timestamp_created": 1469462838, "timestamp_updated": 1469462959, "voted_up": false, "votes_up": 32, "votes_funny": 9, "weighted_vote_score": "0.689844667911529541", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40453052": {"recommendationid": "40453052", "author": {"steamid": "76561198261145232", "num_games_owned": 57, "num_reviews": 7, "playtime_forever": 7526, "playtime_last_two_weeks": 0, "last_played": 1546996326}, "language": "english", "review": "I'd say its a pretty fun games but there are countless thngs that ruin the game.\n\nFirst, the people, some people are cool but most people just hog and be toxic. Second, once you reach a certain rank all the characters are pay2win because the things you buy with money correlates with how much stats you gain in a match. Third, the gameplay gets old after a while (mainly talking about how people go SG, buy all the items that boost 3point and do the same combo over and over again that is really hard to block unless you dish out money to get block stats. Fourth, there are a lot of try hards, no lifers, etc. but thats pretty normal considering this is a pay2win game.\n\nBut, if you dont care about these and want a fun basketball game to play with your friends, you can get this game and make a 3-man team and have fun.", "timestamp_created": 1519791160, "timestamp_updated": 1519791337, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.689692378044128418", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33863258": {"recommendationid": "33863258", "author": {"steamid": "76561198056700248", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 36790, "playtime_last_two_weeks": 0, "last_played": 1541536694}, "language": "english", "review": "P2W", "timestamp_created": 1501269453, "timestamp_updated": 1501269453, "voted_up": false, "votes_up": 18, "votes_funny": 4, "weighted_vote_score": "0.637869596481323242", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24783754": {"recommendationid": "24783754", "author": {"steamid": "76561198048561335", "num_games_owned": 137, "num_reviews": 2, "playtime_forever": 968, "playtime_last_two_weeks": 0, "last_played": 1528999625}, "language": "english", "review": "hey guys i mined one bitcoin for these guys i should get all dlc free also when u uninstall the game doesnt even uninstall it's still in your steam apps folder", "timestamp_created": 1470691631, "timestamp_updated": 1470691631, "voted_up": false, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.586503148078918457", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25183944": {"recommendationid": "25183944", "author": {"steamid": "76561198151762132", "num_games_owned": 30, "num_reviews": 2, "playtime_forever": 4070, "playtime_last_two_weeks": 0, "last_played": 1466103895}, "language": "english", "review": "At first,when i saw the game i was like,OHMIGOD THIS LOOKS SO AWESOME I CAN'T WAIT TO DOWNLOAD THIS RIGHT NOW!\n\nOh how wrong i was...\n\nOk so let's start with this. This is not NBA basketball,this is street Basketball,which basically means 3v3 on one court 5 minute basketball matches,no fouls,no overtimes,no free throws. The gameplay is really fun,addictive and easy to understand,but hard to master. There are 5 classes for you to choose,plus 3 more if you want an advanced class of sorts. The game has MMORPG elements such as skills(fade away,double clutch etc)and things like tricks that can be used for doing 3pts or dunks or blocks (Twister,The Shot,etc). Plus you have a level up system,which awards with attribute points so you have better chances of doing 3pts dunks or blocks.\n\nBut once you realize the faults of this game,you are better off uninstalling it.\n\nFirst off,the game is Pay-to-Win-ish,a F2p game for me should have at least micro-transactions for cosmetics and stuff like that,not for special characters like point guard son goku over there.\n\nSecond,the game has a lot of bugs,connection issues,freezes,which need to be fix ASAP.\n\nThird,the community i say is more like CS:GO's and LOL's community long lost son who was adopted by an Asian. It's filled with ungrateful assholes,12 year old's who say that they are fucking your mom,and just toxicity all around. And it dosen't help that once you leave rookie and have an unbalance between veteran players and rookies (basically think of it as a Team of LVL 12 novices vs LVL 50 veterans)\n\nFourth. BITCOIN MINER\n\nFifth. HACKERS. I have at least spotted 3 hackers in 3 games. If this doesn't get fixed,it will be S4 League all over again.\n\nIn conclusion,without the Hackers,the shitty community,the bugs,the Bitcoin Miner,and the skill gap when you leave rookie servers. This game would be better than an NBA game for at least 5 years due to it's potential.\n\nIt's just the potential,is stuck under the river of cons i said.\n\n", "timestamp_created": 1472312316, "timestamp_updated": 1472312316, "voted_up": false, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.657243251800537109", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33859398": {"recommendationid": "33859398", "author": {"steamid": "76561198276991303", "num_games_owned": 37, "num_reviews": 12, "playtime_forever": 725, "playtime_last_two_weeks": 0, "last_played": 1500366003}, "language": "english", "review": "I like concept of this game.\nBut this game is just pay to win game. This is what I don't recommended this game.  You just have a money then upgrade skill, buy some cool costume. But I play this game for 12Hr xD ❤❤❤❤❤\n*** Sorry If my English so bad ***", "timestamp_created": 1501258872, "timestamp_updated": 1501258872, "voted_up": false, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.628771126270294189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32347846": {"recommendationid": "32347846", "author": {"steamid": "76561198043609639", "num_games_owned": 97, "num_reviews": 15, "playtime_forever": 17170, "playtime_last_two_weeks": 0, "last_played": 1507300421}, "language": "english", "review": "The game is fun but there are so many things wrong with it like being heavily pay2win\n\n[h1]Cons[/h1]\n[list]\n[*]Game engine is outdated and buggy (constant disconnects from log-in screen, slow startup and loading)\n[*]Visually okay but looks cluttered and the art direction is all over the place\n[*]Servers are okay but the game relies heavily on latency (constant disconnects and server kickouts for no reason)\n[*]Game relies heavily on latency and has \"hit\" detection issues (trying to rebound but some players get it even though it looks like you have it / getting out rebounded by low-reb stat classes [C/PF/CT vs SF/PG/SG/etc]\n[*]No means of checking latency in-game only when in the room and players with low latency still are able to play (at a disadvantage to the team)\n[*]Balance issues with classes (some classes are outright better than others)\n[*]SPC are way better than base character (pay2win issue)\n[*]Character upgrades in terms of Cosmetics, Cards and Toys are too random (magic ball and toy draw lottery) and pay2win (cosmetic with stats are not permanent unless bought with cash)\n[*]Crafting system is utter garbage (takes too long to farm regularly and needs cash)\n[*]Card system, especially the upgrade and stat change is garbage (takes too long to farm regularly and needs a lot of cash to get what you want)\n[*]Toy system is utterly garbage (too random, takes too long to grind for special toys and leveling up regular toys, takes too long to find the toys you want and they don't even always give you stats because they activate it randomly/percentage)\n[*]Crew system is not viable or too clunky (what's the point really?)\n[*]Reward system in terms of loss and win needs rework (some people are already doing forfeit matches @ 2:30 to get more exp especially during exp events)\n[*]Player population distribution is too far in between (1-23 and then 24-50). Although the previous servers were less populated if distributed even further so this is kind of understandable. But this turns players off when 24 faces up against 40-50\n[*]Spectating is okay but is very basic and takes so long to connect\n[*]Player progression is very slow in terms of levels because rewards are utter garbage especially when hitting 24 and up which makes players play less (This also plays towards pay2win because of cash boosts when it comes to \"sponsors\" and golden bell events)\n[*]Skills are unbalanced which makes the meta game very rigid if you want to play this game competitively if that is even possible\n[*]Skill slots require cash to open up which is another form of pay2win (you only get a few skill slots and need to reach certain levels to unlock them)\n[*]Freestyles need more rework in tweaking and balancing them out\n[*]Selling certain skills and freestyles during events is a garbage move and should be added permanently to the game (another form of randomness + pay2win)\n[/list]\n\n[h1]Pros[/h1]\n[list]\n[*]Fun casual basketball game, especially with friends\n[*]Improved engine compared to the first game\n[*]Better controls and movement compared to the first game\n[*]Better game mechanics compared to the first game which sort of balances out the class/character imbalances\n[*]Good music\n[*]Added training mechanic for AFK exp farming\n[*]Added better tutorial and mini-games to practice your skills (helps newbies and helps farming\n[/list]\n\nIn conclusion I wouldn't recommend anyone playing this game seriously but do it from time to time only. It is just not as rewarding as you want it to be and it is just frustrating how much pay2win there is in this game and the other stupid randomness they put in it to get maximum profit. Bad business model for an okay game.", "timestamp_created": 1497202111, "timestamp_updated": 1497202111, "voted_up": false, "votes_up": 46, "votes_funny": 0, "weighted_vote_score": "0.713329195976257324", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24766529": {"recommendationid": "24766529", "author": {"steamid": "76561198139595094", "num_games_owned": 592, "num_reviews": 70, "playtime_forever": 62, "playtime_last_two_weeks": 0, "last_played": 1464610512}, "language": "english", "review": "[h1] I just read some comments, and they have this sentence: **DO NOT DOWNLOAD, CONTAINS BITCOIN MINER**[/h1]\n[h1]Soo just don't download![/h1]\n[h1]They said, the bitcoin miner will apear after first update.[/h1]\n[h1]Anyway is  Pay to win.[/h1]", "timestamp_created": 1470603555, "timestamp_updated": 1470603653, "voted_up": false, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.62429356575012207", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37365770": {"recommendationid": "37365770", "author": {"steamid": "76561198309463245", "num_games_owned": 33, "num_reviews": 4, "playtime_forever": 118274, "playtime_last_two_weeks": 314, "last_played": 1551677563}, "language": "english", "review": "Is Gud Again", "timestamp_created": 1511539877, "timestamp_updated": 1550260435, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.696476638317108154", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24395818": {"recommendationid": "24395818", "author": {"steamid": "76561198111717416", "num_games_owned": 93, "num_reviews": 1, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1463845961}, "language": "english", "review": "I have just got a pop up saying that there was a bitcoin miner in the folder for this do not download!", "timestamp_created": 1468871987, "timestamp_updated": 1468871987, "voted_up": false, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.626062333583831787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24395854": {"recommendationid": "24395854", "author": {"steamid": "76561198125505807", "num_games_owned": 128, "num_reviews": 6, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1463845834}, "language": "english", "review": " ____BITCOIN MINER DECTECTED DO NOT DOWNLOAD____", "timestamp_created": 1468872136, "timestamp_updated": 1468872136, "voted_up": false, "votes_up": 32, "votes_funny": 7, "weighted_vote_score": "0.67426830530166626", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33382712": {"recommendationid": "33382712", "author": {"steamid": "76561198261893317", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 27350, "playtime_last_two_weeks": 0, "last_played": 1544999123}, "language": "english", "review": "Love the game but Pay2Win", "timestamp_created": 1499539950, "timestamp_updated": 1499539950, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.637858867645263672", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15801053": {"recommendationid": "15801053", "author": {"steamid": "76561198002236929", "num_games_owned": 150, "num_reviews": 4, "playtime_forever": 5672, "playtime_last_two_weeks": 0, "last_played": 1460306436}, "language": "english", "review": "Having played this game for quite some time this is how I feel about it:\n\nPositive:\n+ It's fun: Seriously, the game is really fun.\n+ Has a nice mixture of simplicity and complexity: The game is easy to get into, the controllers are kind of basic but it has a high skill cap, it's hard to master them.\n+ Character Costumization: It's really nice.\n+ The game has tons of features to keep you entertained: Bingo, My Ball, Freestyles, Challenges, etc.\n+ It's rewarding to play: The achievement system combined with Bingo, My Ball, Freestyles, etc. makes you feel like a winner even when you're losing, so there's some reward in actually playing the game, even if you're not that good at it and just like playing it for the sake of having fun.\n+ MVP: MVP rewards the player that contributes more for the team instead of the one that just scores all the time. Maybe it could be a bit more balanced, but it's nice to see the game reward team play.\n\nOfcourse there are negative points too.\n\nNegative:\n- Paying actually makes you better: Or atleast makes you seem like you are. Paid characters, like Ginger, for example, WILL punish you if you make a mistake, they are deadly because of the bonus they are given. Maybe in higher levels of gameplay that becomes less noticeable, but in lower levels it's really noticeable, they barely miss. And also there are skill slots unlockable by paying, and that gives more options to people that pay to unlock them, giving them an advantage over free plays. I'll put this on capslock: THE GAME IS NOT FULLY PAY TO WIN. That's not what I'm saying here! What I'm saying is the feeling that I got, that if you're a free player and paying against a paid character in a similar player skill level it's more likeable that he will easily punish your mistakes thanks to the character he has than you are likely to punish is, since you don't have as much stats and special bonus as he has.\n- Matchmaking is... weird: I dont know how matchmaking works on this game, but more than a few times I got to play against players that you could see by the skills they were using that they were atleast 10 levels above the players on my team. And I also felt the reverse on some games, that I was being matched with people levels below. Most of the time it felt fine, but I think it was like 80/20, so I thought it would be worth to mention.\n- Menus: Menus can be a bit confusing for newer players, since they are presented with a huge BOOM of stuff.\n- Clarity: The game isn't very clear on some stuff. For example, I had to go google for quite a bit of time why I couldn't level any stat after putting 5 points into it and the game doesn't tell you what keys to use on your controller, so even if it supports it, it's kind of better to play on the keyboard. That kind of stuff.\n\nOverall it's a good and fun game. I recommend it, even if you don't like basketball that much, give it a shot and try to bring your friends to play it with you, only makes it more fun. I'm curious to see the game evolve, since It's kind of new, from what I've read.", "timestamp_created": 1431446164, "timestamp_updated": 1431446164, "voted_up": true, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.761747777462005615", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29787101": {"recommendationid": "29787101", "author": {"steamid": "76561198126836098", "num_games_owned": 33, "num_reviews": 3, "playtime_forever": 54, "playtime_last_two_weeks": 0, "last_played": 1486579298}, "language": "english", "review": "Great game, terrible community I'm so done already.", "timestamp_created": 1486579345, "timestamp_updated": 1486579345, "voted_up": false, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.628503799438476563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "15320095": {"recommendationid": "15320095", "author": {"steamid": "76561198074714508", "num_games_owned": 99, "num_reviews": 3, "playtime_forever": 410, "playtime_last_two_weeks": 0, "last_played": 1432641297}, "language": "english", "review": "Bear in mind that this review comes from a person who used to play Freestyle 1 a lot of years ago. I've played in Thailand servers, in Gamekiss (NA) servers, in 4Game (Russian) servers and my country always had a big community in this game because we are big on basketball. There will be a lot of comparing\n\n[h1]Before my rant, remember: I HATE BASKETBALL.[/h1]\n\nYes, I hate basketball. I've played this game for so long (the Freestyle 1 version) even though I hate basketball. You know why? Because this game is super fun even if you don't know anything about basketball. There is constant action, it's super rewarding to block, rebound and when you hit a 3-pointer, it's the best feeling ever.\n\n[h1]Freestyle 1 was actually rather bad.[/h1]\n\nIt was full P2W, clothes that give attributes were all costing money, the OP moves that were difficult to block were all expensive and you HAD to buy them with real life money. There were serveral exploits like when you receive a pass, you get a speedboost. Exploiting that, you could always step back faster than your opponent and make yourself unblockable. Level system was awful, you only got your real position at level 15 and the grind to 45 (max level) was like the whole game. High level people could do anything and everything so you had to block them every time because they would hit every shot. You know why that was awful? That's right, the speed boost exploit.\n\n[h1]Freestyle 2 possibly improves every mechanic that existsted in FSSB1.[/h1]\n\n[list]\n[*] Skills costs like 3k at the start, meanwhile you get like 50k points at the start by registering, eliminating the grinding element of the game.\n[*] Freestyles (Skills that only makes your shot/dunk different, making it harder to be blocked) can now be used only once or twice per game because you have to meet the requirements to do them. However, once you do them, it's garanteed points, so I think that's a nice touch.\n[*] You choose freestyles on your own, instead of them spinning in the exact same order for the whole game.\n[*] Music is constantly playing in game, making you feel in action. Also, the soundtrack makes you super pumped, while you can also configure it\n[*] FSSB1 Games were all the same: PFs/Cs rebound, pass it to SGs and they shoot 3points OR PFs just dunking and you can't block them because they have paid for the awesome almost unblockable dunks. In FSSB2, or at least in early stages of FSSB2, it won't be like this. SGs can be blocked easily, there are way more rebound patterns for rebounders to learn, etc.\n[*] Bigger skill variety\n[*] Can be played with a controller. I haven't tried it yet, but I think it might be really fun\n[*] Awesome rewarding system, making you feel progressing, most daily quests  aren't considered grinding and there are constant events. You also constantly get items and a lot of points, also making the game not P2W\n[/list]\n\n[b] EVEN IF YOU DON'T LIKE BASKETBALL, YOU WILL ENJOY THIS GAME [/b]\n\nIt's super rewarding. I watched a streamer play it with friends in front of 13k thousand viewers yesterday and he had a blast, meanwhile not even knowing that you can't shoot while you are getting defended by someone. He still had fun, I saw the excitement in his eyes meanwhile he was watching whether  the ball will go into the basket or not. [b] ALSO, IT'S SUPER FUN TO PLAY WITH FRIENDS[/b]\n\n[b]Even if you dislike basketball, dislike sports games like I do, you might still have a blast. It might still be super fun for you, or at least fun for 3-10 hours. You have nothing to lose, it's  free to play. Grab some friends, put your game pants and gunnars and go play it! This game is awesome and the devs definitely stepped up their game, adding new elements and improving  the old ones.[/b]\n\n\n\n\n", "timestamp_created": 1428834580, "timestamp_updated": 1428834580, "voted_up": true, "votes_up": 44, "votes_funny": 6, "weighted_vote_score": "0.74957430362701416", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21432706": {"recommendationid": "21432706", "author": {"steamid": "76561198004829118", "num_games_owned": 114, "num_reviews": 17, "playtime_forever": 1734, "playtime_last_two_weeks": 0, "last_played": 1460775414}, "language": "english", "review": "My game was stuck on the loading screen on 40%. My brother walks into my room and looks at the screen and says why is there a white chick with big breasts on your computer screen, are you loading your porn?\n\nchange the damn loading menu", "timestamp_created": 1456349127, "timestamp_updated": 1456349127, "voted_up": true, "votes_up": 72, "votes_funny": 231, "weighted_vote_score": "0.719696521759033203", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15342619": {"recommendationid": "15342619", "author": {"steamid": "76561197967490224", "num_games_owned": 221, "num_reviews": 18, "playtime_forever": 1649, "playtime_last_two_weeks": 0, "last_played": 1463379107}, "language": "english", "review": "It's fun for a bit and the game runs pretty well. I only experience small amounts of latency issues that really changed the tide of the match but it was rare. \n\nMy true gripe with the game is the balancing as you level up, not so much the balance once you're at the top of level and have unlocked all the skills and attributes. During the first few levels on the beginner server, the game is fun but it's ruined by ball hogs and people who don't understand the sport or the game at all. I think out of 50+ Matches I had in the beginner server, very very few of the matches were competitive. Either your team stomped the other team or your team got stomped because you were paired up with people who didnt understand the fundamentals to the game (would try to do half court shots with a C, SG's would just stay under the rim for a rebound) But the games that were closer in score were actually really fun. Once you're fresh out of the beginner server, thats when the game gets even worse, you still have people who don't understand the game at all but not only that, you are matched up against people who have unlocked very strong skills that you don't have access to until you grind out several dozen matches. These skills literally make the player exponentionally overpowered compared to the skills you have when you are a fresh level 12 (Alley-Oop spam, Back Step dribble, etc.) So you have to endure through these matches because more often then not, you will be paired up with people still learning the game and have no idea how to play against teams that are already overpowered so they resort to afk exp farming. That alone is abused like heck, people just matches just to afk and get the match experience because they know they will most likely lose to higher level players. \n\nI'd love to recommend the game because it can be really fun, but it just gets worse until you get to much higher level and everyone balances out and the game becomes more skill based. But enduring the grind of the early levels coupled with players that don't understand the game and the afk farm, just ruins it all for me.", "timestamp_created": 1428969764, "timestamp_updated": 1428969764, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.510355889797210693", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24891981": {"recommendationid": "24891981", "author": {"steamid": "76561198177475769", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1533477246}, "language": "english", "review": "Do not download this game it has a BitCoin Miner\n\nfucking bastards who made this game \n!!!!!!!!!!!!!!!!", "timestamp_created": 1471112739, "timestamp_updated": 1471112739, "voted_up": false, "votes_up": 21, "votes_funny": 4, "weighted_vote_score": "0.520307481288909912", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20596516": {"recommendationid": "20596516", "author": {"steamid": "76561198077488157", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 32944, "playtime_last_two_weeks": 0, "last_played": 1540304496}, "language": "english", "review": "I have this game now only for 2 days but if youre an BBall Fan you will love it.\n\nI played today 16h i mean wth...\n\nAnime Style and Street basketball.. \nget it !\n\nUpdate :\nStill playing. They are some points in this game who suck but overall you should try it :)", "timestamp_created": 1453078253, "timestamp_updated": 1480012315, "voted_up": true, "votes_up": 20, "votes_funny": 7, "weighted_vote_score": "0.689132571220397949", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42493147": {"recommendationid": "42493147", "author": {"steamid": "76561198149634043", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 92796, "playtime_last_two_weeks": 5019, "last_played": 1551877394}, "language": "english", "review": "It's a good game, but we still need a South American Server, we can't play with big characters because of the high ping in game, it be hard to rebound and we get lag blocked a lot of times", "timestamp_created": 1528130108, "timestamp_updated": 1528130108, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.63218390941619873", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33196590": {"recommendationid": "33196590", "author": {"steamid": "76561198070079217", "num_games_owned": 683, "num_reviews": 68, "playtime_forever": 18841, "playtime_last_two_weeks": 2383, "last_played": 1551832098}, "language": "english", "review": "Pay to win basketball game that requires you to spend 100$ to win and people brag about wasting their money and majority of high rank players hack. So no do not play if you want to actually have a good street basketball game that is fair.\n\n\nUpdate: It is still pay to win, but I play it occassionaly to just troll just be a center and shoot 3s even if you miss because if they cannot make a good game then why should you even bother trying hard to be good at it.", "timestamp_created": 1499107416, "timestamp_updated": 1551588432, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.622199296951293945", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "15454065": {"recommendationid": "15454065", "author": {"steamid": "76561198043995203", "num_games_owned": 72, "num_reviews": 3, "playtime_forever": 808, "playtime_last_two_weeks": 0, "last_played": 1434479807}, "language": "english", "review": "Fun, but the servers are horrible, people lag like crazy making it imposible to defend against, and the game seems to delete core files everytime I close it... forcing me to redownload it constatly... even then it rarely works.", "timestamp_created": 1429471848, "timestamp_updated": 1429472142, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.528795838356018066", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30723434": {"recommendationid": "30723434", "author": {"steamid": "76561198111344478", "num_games_owned": 48, "num_reviews": 11, "playtime_forever": 3023, "playtime_last_two_weeks": 0, "last_played": 1549233123}, "language": "english", "review": "Toxic people.", "timestamp_created": 1490436829, "timestamp_updated": 1490436829, "voted_up": false, "votes_up": 19, "votes_funny": 6, "weighted_vote_score": "0.639228105545043945", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15612719": {"recommendationid": "15612719", "author": {"steamid": "76561198136875146", "num_games_owned": 73, "num_reviews": 6, "playtime_forever": 616, "playtime_last_two_weeks": 0, "last_played": 1431196296}, "language": "english", "review": "Real basketball fans and players wouldn't be impressed with this game's mechanics or animations because this game doesn't  go for a realistic basketball simulation. Instead this game focuses on team play and player customisation and most of customisable things are aquired by playing the game, not by spending real money. Post game rewards and leveling up keeps you playing and grinding through the game. Just remember that if you want the best experience , team up with 2 of your buddies and it will be a lot more fun and enjoyable to play :) \n\nOverall: If your looking for a realistic basketball simulation - don't bother, It's not NBA 2K, but if your looking for a fun, grindy,arcady team game - try it out.", "timestamp_created": 1430328087, "timestamp_updated": 1430328357, "voted_up": true, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.694012224674224854", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36904965": {"recommendationid": "36904965", "author": {"steamid": "76561198096756246", "num_games_owned": 279, "num_reviews": 36, "playtime_forever": 7372, "playtime_last_two_weeks": 0, "last_played": 1543545973}, "language": "english", "review": "One of the best Basketball games I had ever played. Highly recommended over 3on3 (Which is more pay to win). But there are some bugs in the game as well such as those random crashes with no error log or a match loads and we get kicked back into the lobby. If these can be fixed it would be a really good game", "timestamp_created": 1511404936, "timestamp_updated": 1511404936, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.589041054248809814", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43348268": {"recommendationid": "43348268", "author": {"steamid": "76561198170352878", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 156931, "playtime_last_two_weeks": 0, "last_played": 1549056630}, "language": "english", "review": "Repeated login !!! All the time !!!", "timestamp_created": 1530875035, "timestamp_updated": 1530875035, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.630400300025939941", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23211481": {"recommendationid": "23211481", "author": {"steamid": "76561198118440165", "num_games_owned": 72, "num_reviews": 29, "playtime_forever": 8030, "playtime_last_two_weeks": 0, "last_played": 1494915536}, "language": "english", "review": "\"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \"Pass the ball\" \n\nAbove is basically the standard chat you'll see the entire time you play.", "timestamp_created": 1464230084, "timestamp_updated": 1464230084, "voted_up": true, "votes_up": 21, "votes_funny": 44, "weighted_vote_score": "0.641767740249633789", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15433393": {"recommendationid": "15433393", "author": {"steamid": "76561198052426486", "num_games_owned": 655, "num_reviews": 63, "playtime_forever": 7348, "playtime_last_two_weeks": 0, "last_played": 1460837167}, "language": "english", "review": "10/10", "timestamp_created": 1429373297, "timestamp_updated": 1429373297, "voted_up": true, "votes_up": 47, "votes_funny": 5, "weighted_vote_score": "0.699467003345489502", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28644139": {"recommendationid": "28644139", "author": {"steamid": "76561198068841404", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 178244, "playtime_last_two_weeks": 2546, "last_played": 1551852151}, "language": "english", "review": "Too easy. Not Addictive.  Trash community. Trash gamekiss. Trash game 6/9 would not recommend.\n\nEdit: Ok, honest review : Unless you plan on dropping a few hundred bucks on a game that doesnt even have more than a hundred players on at once, or are extremely skilled/asian/no life at games, dont pick up this game. IT will suck away your already non-existant life and make you miserable. This game is not for the weak. The skill difference between top players and beginners is like a pro player in League vs a Bronze player. With the ASTOUNDING 50 active playerbase, you will eventually get put up against players that will destroy you sooner than you know(probably 1 week into the game).  Those that cannot survive a TOXIC COMMUNITY WHERE EVERYONE THINKS THEY ARE THE BEST and insanely unbalanced games due to THOUSANDS OF DOLLARS BY MOST PEOPLE SO THEY CAN BE OVERPOWERED should just leave. Backed with the fact that the company running this game wants to take your money, you will be pounded in AND out of game. Sure, the gameplay itself is fun and addictive. But still IT ISN'T WORTH IT. As a player who has achieved the PINNACLE OF FS2(becoming a major tournament champion), I would trade back these 2000 HOURS WASTED for a pack of condoms. Don't do this to yourself. Stay in school kids.\n\n2nd Edit : Forgot to mention 30% of the community hacks and gamekiss does nothing to ban/update the 2 year old hackshield. \n\nTL;DR -  FK YOU READ MY REVIEW IM A GOD.", "timestamp_created": 1482693110, "timestamp_updated": 1485131092, "voted_up": false, "votes_up": 28, "votes_funny": 5, "weighted_vote_score": "0.633046805858612061", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24645677": {"recommendationid": "24645677", "author": {"steamid": "76561198111515063", "num_games_owned": 146, "num_reviews": 5, "playtime_forever": 468, "playtime_last_two_weeks": 0, "last_played": 1461543475}, "language": "english", "review": "My computor said it was a trojan horse virus...", "timestamp_created": 1470021633, "timestamp_updated": 1470021633, "voted_up": false, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.547104716300964355", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30112148": {"recommendationid": "30112148", "author": {"steamid": "76561198155241903", "num_games_owned": 7, "num_reviews": 6, "playtime_forever": 1076, "playtime_last_two_weeks": 0, "last_played": 1443332160}, "language": "english", "review": "So many bugs . And too much toxic player", "timestamp_created": 1487822756, "timestamp_updated": 1487822756, "voted_up": false, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.604401528835296631", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16436931": {"recommendationid": "16436931", "author": {"steamid": "76561198065625676", "num_games_owned": 93, "num_reviews": 15, "playtime_forever": 39020, "playtime_last_two_weeks": 0, "last_played": 1497442045}, "language": "english", "review": "this game is ... no pay , you can win\n\nhighly recommend it :) !", "timestamp_created": 1434437830, "timestamp_updated": 1434437830, "voted_up": true, "votes_up": 36, "votes_funny": 10, "weighted_vote_score": "0.648900210857391357", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34626926": {"recommendationid": "34626926", "author": {"steamid": "76561198015173082", "num_games_owned": 166, "num_reviews": 6, "playtime_forever": 20598, "playtime_last_two_weeks": 0, "last_played": 1525497381}, "language": "english", "review": "Played it for a while, spent a lot of money on it. Stopped playing. \n\nUnfortunately, the issues that are obvious aren't obvious enough, apparently. There is no beginner server, you have to play from level 1-23 (or 24, can't remember), which is a big gap. When you are level one, you have almost no skills, no stat points, and no idea how to play. By the time you reach level ~15, you have a basic understanding of the game. \n\nThen starts the next problem, after 1-23, you have 23-50. \n\nThen you start to regret playing the game. Community is extremely toxic since you play with your level 24 against people who could have hundreds of hours on the game over you. All of the skills unlock at 24 but you need in-game points to buy them, something you need to play a lot to buy. Even if you were to buy them all, you need to level up to get the skill-slots. Most of the time you will get stomped on in whatever role you chose, get made-fun-of by your teammates and called a noob and worthless. You will not learn anything unless you meet the rare 1/50 nice person who will play with you anyway. Most of the time, you go back and make a new character, just to play in the low level server again. \n\nIf you decide to go through the game with friends, it will make the experience slightly better. Only thing is you and your friends have to dedicate to losing a lot. It takes dedication to get better in this game, learning the jank controls and precise timing (especially if you don't have a ping of under 50.) That dedication can certainly be broken by losing to P2W characters non-stop for a whole night.\n\nAlso, the game is P2W. You get more stat points for purchasing special characters and more stats for buying points on your clothes. Pay money, get better/more stat points. Also, the game is dictated by what skills you attach, and you can pay to get more skill slots therefore have an even bigger advantage.\n\nI would avoid this unless you have two friends who enjoy sports games.", "timestamp_created": 1504159667, "timestamp_updated": 1504159667, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.649631023406982422", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48257342": {"recommendationid": "48257342", "author": {"steamid": "76561198168567609", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 25245, "playtime_last_two_weeks": 0, "last_played": 1547682133}, "language": "english", "review": "[h1][b] Illegal Gambling to Win. [/b][/h1]\n\nI will review the gameplay, pay model, and community here, in that order.\n\n[u] Gameplay [/u]\nThe gameplay is fun. You can practice for hours mastering different skills, and skill combinations to compete with other players. Games are pretty quick, and the arcade feel and cartoon graphics will initially draw you in as you realize how much potential this game has. Every other aspect of the game will do the opposite and push you away.\n\n[u] Illegal Gambling to Win [/u]\n[b] This is quite possibly the worst and most predatory business model gaming has ever seen. [/b]\nYou will need to spend $20 - $40 to create a character. A regular character! A special character can cost you $200 - $1000+ as you need to gamble and get lucky. \n\nThen you will need clothes, $5 - $10 for each piece then add another $3 - $10 to add stats.  \n\n$20 for skill slots. You can purchase 2 more skill slots for a monthly fee of $3. And you will need to pay $15 a month for a VIP subscription that adds another skill slot, and if you keep your subscription for a year, you can get another skill slot.\n\nAt this point you are about $100 deep and you now have an $18 monthly subscription!\n\nAnd now we get into cards. If you want to actually be competitive you will need cards that increase your stats even further. Expect to spend hundreds if not thousands of dollars gambling for the cards you want. To get the best cards, you will need the full set of 3. Once you have those cards you will also need to re-roll the secondary stat lines, that actually improve your character more than the primary stats. You can spend a few hundred more getting those.\n\nThis will not be the only system you will find yourself gambling in by far. Even things you get with in game currency is attached to a gambling system. Toys that have a small chance to activate every game you will purchase with points in loot box form. The freestyle skills, which give you special animations with a higher chance of succeeding will be granted at random with coupons.\n\nThere are 3 different gambling balls you can purchase to access 3 different item types. \n\nEven the events are gambling. While they may provide some cash shop items during these, sometimes, the majority of them will involve gambling. Right now it is a \"Wheel of Fortune.\" \n\nEven the new enhance system is just another loot box system, that requires you to keep on pumping in cash to access the rewards you got from the loot box. \n\nIt is no mistake that this game is cartoon and anime themed with all of these gambling mechanics. Korean games have a very long history of aggressively pushing gambling to the extreme on games targeting kids and teenagers. \n\n [u] Community [/u]\nIf you are new, you can expect to have a terrible time while trying to learn this game. It doesn't help that at level 24 you are thrusted head first to play in the pro lobby where you will compete with people twice your level who have invested tons of money. \n\nYou will find that some players will automatically kick you from their lobbies, and when there are only 8 lobbies, you may have a hard time even playing a match. \n\nOr you will find that there are a lot of individuals who get mad if anybody except for them touches the ball. They will throw full blown tantrums. \n\nOnce you do get the hang of things, you will still run into completely toxic individuals.\n\n\n\n[u] A few other problems to note [/u]\n[list]\n[*] Servers are based in california so no matter how good you are, you can not compete with 10-20 ping individuals\n[*] Game crashes frequently\n[*] Racial slurs as usernames \n[*] Very little information on game features\n[*] Skills not working properly\n[*] Very few people playing (2-24 people in total in pro lobby)\n[/list]\n\nStay away from JoyCity Corp.", "timestamp_created": 1547230755, "timestamp_updated": 1547230755, "voted_up": false, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.665882349014282227", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30051400": {"recommendationid": "30051400", "author": {"steamid": "76561198144783197", "num_games_owned": 45, "num_reviews": 14, "playtime_forever": 12509, "playtime_last_two_weeks": 0, "last_played": 1488602634}, "language": "english", "review": "Great game. 10/10\nPlayers 3/10\n\nThe people in it? Almost like a bunch of immature brats trying their best flaming each other, looks silly, quite entertaining may I add. \n\nPretty rare to not see: \n-people arguing on megaphones\n-people arguing in-game match (if you argued as much as you did played... -Oh, let me just stop myself)\n-people spamming chat\n-people putting down other people\n-arrogant players (met quite a lot of these players)\n-the one that talks a lot (talking [insert poop emoji])\n-people kicking you from the match/court whatever\n-toxic and salt (aka ill-mannered according to FS2)\n-pay-to-win/obvious pay-to-win with skills (which is not a bad thing, you invest in what you want)\n\n\n\nWhere the GM's at..?\n\nI'd recommend this game, but I wouldn't at the same time. The community (not all) is toxic. There's just one event I will never forget, which scarred my life. I would be glad if the GM's removed the chat completely while in-game, or at least the \"All,\" chat because people somehow can't help it and cry or the need to trash talk.", "timestamp_created": 1487569798, "timestamp_updated": 1488602036, "voted_up": false, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.596447885036468506", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17727759": {"recommendationid": "17727759", "author": {"steamid": "76561198126084626", "num_games_owned": 45, "num_reviews": 4, "playtime_forever": 14780, "playtime_last_two_weeks": 0, "last_played": 1500537237}, "language": "english", "review": "I started playing this because its free and I actually enjoyed it. I had like 100+ hours on it creating new accounts to earn 150k points. Bought 500 Gkash for the event.\n\nI was able to feel satisfied with how my character looks and plays. But as soon as I reach level 24. No one would play with you. If there is, they will call you NOOB throughout the whole game. Then use a microphone and harass you throughout. \n\nCommunity sucks! People are jerks~! There are some who would play with you but for the most part everyone is a jerk. \n\nDownfall of this game is how jerks high level people or seasoned people are and it really sets me back.\n\nGoodluck to this game. Its fun till 24 and if you like getting called noob and doesnt bother getting owned by seasoned players or getting kicked from room to room spending 15 minutes just to play 1 game then get called a noob then kicked then this game is for you.", "timestamp_created": 1440614487, "timestamp_updated": 1440614487, "voted_up": false, "votes_up": 107, "votes_funny": 27, "weighted_vote_score": "0.681733489036560059", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23683817": {"recommendationid": "23683817", "author": {"steamid": "76561198144685610", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 6871, "playtime_last_two_weeks": 0, "last_played": 1515927798}, "language": "english", "review": "pay to win", "timestamp_created": 1466507048, "timestamp_updated": 1466507048, "voted_up": false, "votes_up": 24, "votes_funny": 3, "weighted_vote_score": "0.612406909465789795", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15490226": {"recommendationid": "15490226", "author": {"steamid": "76561198055072347", "num_games_owned": 231, "num_reviews": 50, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1430383533}, "language": "english", "review": "+ Nice game mechanics..blocking,rebounding,shooting etc feels real and timing based..\n+ Graphic style is decently good..\n+ Various challenges and daily quests\n\n- Heavy money involved..like around 50% of the game content needs you to pay real money..i haven't been too deep into the game but seen the cool chars costs like $20 per character..\n- Level grind is quite slow\n- Servers still quite troublematic..sometimes you have auto win or auto lose because someone instantly DC'ed\n\nupdate:\n- stopped playing the game since it's DCing all the time (im using the asian server)\n- played against a paid character and she had like 10 consecutive 3pt's (30 points)..its quite ridiculous even in real life basketball..", "timestamp_created": 1429707812, "timestamp_updated": 1429759276, "voted_up": false, "votes_up": 93, "votes_funny": 17, "weighted_vote_score": "0.656017184257507324", "comment_count": 16, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30678280": {"recommendationid": "30678280", "author": {"steamid": "76561198108760208", "num_games_owned": 64, "num_reviews": 4, "playtime_forever": 2225, "playtime_last_two_weeks": 0, "last_played": 1535560846}, "language": "english", "review": "what a great game! and its free too! the only problem is it takes quite a while to start up, so that kinda bothers me. but otherwise, 9/10, what an awesome game! keep it up joy corp.", "timestamp_created": 1490232639, "timestamp_updated": 1490232639, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.569351255893707275", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24033022": {"recommendationid": "24033022", "author": {"steamid": "76561198075883398", "num_games_owned": 21, "num_reviews": 12, "playtime_forever": 2511, "playtime_last_two_weeks": 0, "last_played": 1535060025}, "language": "english", "review": "It is a pay to win game which bought characters have better stats over you making it impossible to beat them,\nBut the game itself is nice though, it has one of the worst community I've ever seen.", "timestamp_created": 1467507162, "timestamp_updated": 1467507162, "voted_up": false, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.641697049140930176", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41327385": {"recommendationid": "41327385", "author": {"steamid": "76561198391979267", "num_games_owned": 13, "num_reviews": 2, "playtime_forever": 69453, "playtime_last_two_weeks": 4270, "last_played": 1551795496}, "language": "english", "review": "Firstly, the game is very unfriendly to totally new players, who didn't have any experience at all. Secondly, if you are still considering playing the game then good, you don't actually need to do any in game purchase, the only thing you need to play the game is patience and practise. As a die-heart player since the release and the termination of FS1, I indeed enjoy this game a lot. Though sometimes bug does annoys me, but the overall gaming experience is quite entertaining. With few basketball related games on the market, this game is a really nice choice.\nMore detail version of the game review starts from here:\nPros:\n1. Nice user interface design.\n2. Easy to understand what is going on while playing. (Of course you need to at least know how to play basketball in real life)\n3. Great sense of rewarding.\n4. Really need to grind to master the skills and the different play styles with different positions as teammates.\n5. P2W rarely exist in the early stage of playing this game.\n6. Very nice character customise system.\n7. Good music.\n\nCons:\n1. Very unfriendly towards newbies. (Potential name calling all game long)\n2. P2W becomes more and more obvious because of the latest updates.\n3. Players with money can outplay you every single time even you have tried your best since they have better cards. (This happens even when you hit lvl50, and the good cards are just too OP.)\n4. Need a lot of patience and luck if you are a \"I won't pay sht for gaming\" player, this especially applies to the card drawing. (I mean, to get legend cards that suit your positions is just almost so depressing at times. I waited until lvl43 to finally get some good cards with pure luck.)\n5. P2W when you hit lvl40.\n6. SW side step is just OP.\n7. I don't even want to mention SG after updates.\n8. PF who knows how to dunk makes you look silly because you can only guess the block if you don't have OP block attribute.\n9.ISO games are really boring. If you are C/PF/CT, go get rebs, other people stand and watch.\n10. Too many people think CT is C, SF is SW, and PG should be like Stephen Curry hitting every three.\n\nOverall, if you do not have passion toward basketball, just leave it intact.", "timestamp_created": 1523051681, "timestamp_updated": 1523055032, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.60000002384185791", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47838397": {"recommendationid": "47838397", "author": {"steamid": "76561198134544594", "num_games_owned": 37, "num_reviews": 3, "playtime_forever": 102927, "playtime_last_two_weeks": 776, "last_played": 1551582270}, "language": "english", "review": "Do not waste yout time on this pay2win,toxic community dead playebase game.", "timestamp_created": 1545839085, "timestamp_updated": 1545839085, "voted_up": false, "votes_up": 8, "votes_funny": 5, "weighted_vote_score": "0.582231879234313965", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30053083": {"recommendationid": "30053083", "author": {"steamid": "76561198115381942", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 291865, "playtime_last_two_weeks": 151, "last_played": 1551827012}, "language": "english", "review": "Background of me:\n\nI spent around $200 on this game for its gamble like draws to aquire items.\nI have 1 lvl 50 character(max) , 2 level 40 characters.\nI have some great friends to play this game with.\n\n------------------------------------------------------------------------------\n\nRecently after i obtained indepth knowledge of this game, I have to tell you this game is filled with Pay to Win cash players and hackers. After exiting the rookie channel, Every game you play, you will face either P2W players or hackers. Maybe at peak hour you can find some normal players. I don't know p2w, but the hacks are getting out of hands and it really destoryes the gaming experience and the game company is not doing anything to punish the hackers. This game is going down hill, with very few player base. Even at peak hour you owuld see about 30 games.", "timestamp_created": 1487579031, "timestamp_updated": 1487579031, "voted_up": false, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.612174570560455322", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42069946": {"recommendationid": "42069946", "author": {"steamid": "76561198048027156", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 152139, "playtime_last_two_weeks": 0, "last_played": 1542101524}, "language": "english", "review": "Game is cool if you're into basketball. This is a ping-reliant game if you're playing a Bigman. The Asia sucks though, always unstable", "timestamp_created": 1526493039, "timestamp_updated": 1526493039, "voted_up": true, "votes_up": 10, "votes_funny": 4, "weighted_vote_score": "0.587328016757965088", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18731578": {"recommendationid": "18731578", "author": {"steamid": "76561198065286380", "num_games_owned": 297, "num_reviews": 5, "playtime_forever": 5526, "playtime_last_two_weeks": 0, "last_played": 1541957204}, "language": "english", "review": "Me and my friend love to play Basketball but we where too poor to buy NBA, but i saw this game was free so we said lets give it a try. After 24 hours spend in the i Bought a character causse i loved the game and I wanted to support the community. I still do not regret it though. I am having fun with my bro and random peeps from over the word.\nSo all by all i would reccoment this game if you wanne have a blast.\nMayby i'll see you on the court", "timestamp_created": 1446061487, "timestamp_updated": 1446061487, "voted_up": true, "votes_up": 42, "votes_funny": 15, "weighted_vote_score": "0.697300910949707031", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24306666": {"recommendationid": "24306666", "author": {"steamid": "76561198046337516", "num_games_owned": 206, "num_reviews": 18, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1454685929}, "language": "english", "review": "**DO NOT DOWNLOAD, CONTAINS BITCOIN MINER**\n\nGame was just updated with a new patch a few minutes ago - received a notification from AVG that it contains a Bitcoin Miner", "timestamp_created": 1468460511, "timestamp_updated": 1468460511, "voted_up": false, "votes_up": 44, "votes_funny": 9, "weighted_vote_score": "0.657487750053405762", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34855892": {"recommendationid": "34855892", "author": {"steamid": "76561198025365309", "num_games_owned": 296, "num_reviews": 52, "playtime_forever": 1938, "playtime_last_two_weeks": 0, "last_played": 1429215786}, "language": "english", "review": "Same reason as any other negative review. P2W, laggy, poor customer support, toxic community.", "timestamp_created": 1505030400, "timestamp_updated": 1505030400, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.574380636215209961", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31309485": {"recommendationid": "31309485", "author": {"steamid": "76561198000400287", "num_games_owned": 136, "num_reviews": 4, "playtime_forever": 1134, "playtime_last_two_weeks": 0, "last_played": 1493332516}, "language": "english", "review": "pay to win.", "timestamp_created": 1492910219, "timestamp_updated": 1492910219, "voted_up": false, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.655598700046539307", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24341405": {"recommendationid": "24341405", "author": {"steamid": "76561198121072133", "num_games_owned": 89, "num_reviews": 6, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1433019379}, "language": "english", "review": "Tried updating a Bitcoin miner into my computer, The game is dull and the bots suck, all the things you can do are buggy half the time, And the community sucks", "timestamp_created": 1468616279, "timestamp_updated": 1468616279, "voted_up": false, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.575107336044311523", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26068561": {"recommendationid": "26068561", "author": {"steamid": "76561198084388292", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 1638, "playtime_last_two_weeks": 0, "last_played": 1491909661}, "language": "english", "review": "pay to win 0/10", "timestamp_created": 1476621245, "timestamp_updated": 1476621245, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.61481022834777832", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42191283": {"recommendationid": "42191283", "author": {"steamid": "76561198190986254", "num_games_owned": 35, "num_reviews": 5, "playtime_forever": 4171, "playtime_last_two_weeks": 0, "last_played": 1540995377}, "language": "english", "review": "2/10\nKeeps crashing, keep up the good work.", "timestamp_created": 1527069759, "timestamp_updated": 1527069759, "voted_up": true, "votes_up": 22, "votes_funny": 42, "weighted_vote_score": "0.65764164924621582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15607317": {"recommendationid": "15607317", "author": {"steamid": "76561198083255608", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 450, "playtime_last_two_weeks": 0, "last_played": 1475828052}, "language": "english", "review": "Please Can We Have Full Court!?! This Would Be One Of The Best Basketball Games If It Featured Full Court/Half Court/1on1", "timestamp_created": 1430294815, "timestamp_updated": 1430294815, "voted_up": true, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.685220003128051758", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34161404": {"recommendationid": "34161404", "author": {"steamid": "76561198123519814", "num_games_owned": 1404, "num_reviews": 11, "playtime_forever": 21465, "playtime_last_two_weeks": 0, "last_played": 1531594497}, "language": "english", "review": "Yeah, p2w game. although the game is F2P but in-game items are too expensive. imo.", "timestamp_created": 1502428471, "timestamp_updated": 1502428471, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.558643639087677002", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15455637": {"recommendationid": "15455637", "author": {"steamid": "76561197992994313", "num_games_owned": 515, "num_reviews": 4, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1429015515}, "language": "english", "review": "Tried playing with an Xbox 360 controller. Start the game. get half a dozen free pay-to-play drops for some reason. That can't be good. Go to the tutorial. No controller button mapped for run. Right-o. I'll switch to keyboard. Time to shoot. \"Hold D to shoot\". Hold D. Nothing happens. Try again. Same thing. Try tapping D. Nothing. \"Hold D to shoot\". Naah. Press Esc. \"Hold D to shoot\". Alt-F4 that shit.", "timestamp_created": 1429479134, "timestamp_updated": 1429479134, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.523622035980224609", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29008611": {"recommendationid": "29008611", "author": {"steamid": "76561198056389254", "num_games_owned": 88, "num_reviews": 3, "playtime_forever": 89, "playtime_last_two_weeks": 0, "last_played": 1514398247}, "language": "english", "review": "I played a lot of this game with a Gamekiss account (not on Steam). It's actually pretty fun, but I started getting BugTrap errors after I updated to Windows 10 (the game wouldn't launch). The devs said they were working on a fix. That was like 1.5 years ago. Tried every fix I could find online. Still doesn't work. I've contacted their customer support. Their final solution was 'idk reinstall windows lol fuck you'.", "timestamp_created": 1483542470, "timestamp_updated": 1514398185, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.564777076244354248", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40873538": {"recommendationid": "40873538", "author": {"steamid": "76561198436802102", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 11793, "playtime_last_two_weeks": 889, "last_played": 1551876695}, "language": "english", "review": "Played this game for 2 years (not on steam). It's a great game if you like basketball. Otherwise it's mediocre. Can't say it's p2w, but at times players who invest cash in to the game get a significant advantage. Also it relies heavily on your internet speed. Tends to crash from time to time. The community is 50/50, a lot of cancerous kids calling you 'a noob' for making a mistake, but also plenty of friendly people who help you get better. All in all, I still recommend this game if you're somewhat into sports or basketball.", "timestamp_created": 1521294986, "timestamp_updated": 1521294986, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.628019332885742188", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22529870": {"recommendationid": "22529870", "author": {"steamid": "76561198150753438", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 104440, "playtime_last_two_weeks": 0, "last_played": 1546424874}, "language": "english", "review": "Ok, first, it's really fun. But not when you created a new level 1 character and being called noob. Nevertheless, you'll level up eventually, so it's not really a problem to me. For the gameplay, it's smooth and good-looking. The graphic is weird but it does give you a fresh feeling, like, you know, first time playing a game that is made in Korea. Despite the community is a little bit bad, but, just stay strong and ignore them, like you're deaf or something. It's not a big deal, but the big deal is dealing with yourself. It's F**KING HARD to ignore them, and I've played this game for 700+ hours, you know how much pain I've gone through. But it's really fun, trust me. If you're a fan of basketball, or you love to play basketball but never had the chance to play it, it's a good game. And it becomes addictive when you play it for a several hours. So, for those who want to play it(after reading my review), please do play it with your friends, because everyone there is your rival. Only some of them are friendly(just like me), so I'll see you on the court. My name is qpJackqp in-game. Now here is the rating:\nAudio:7/10\nGraphic:7/10\nGameplay:9/10(because some player afk)*I assume you guys know what is \"afk\"\nCommunity:6/10\nOverall:8/10\n*Also, I spent RM120 on this game, LOL", "timestamp_created": 1461139677, "timestamp_updated": 1461140001, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.562468111515045166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25428121": {"recommendationid": "25428121", "author": {"steamid": "76561198081299007", "num_games_owned": 664, "num_reviews": 56, "playtime_forever": 10011, "playtime_last_two_weeks": 0, "last_played": 1547286714}, "language": "english", "review": "Quick review for those who want to try this game.\nPros:\n+ Decent gameplay.\n+ Character customization.\n+ Nice BGM and in-match commentary.\nCons:\n- Bitcoin miner inside gamefiles (fixed ?).\n- Unrealistic physics.\n- Pay2win: \n* Special Character have 40 more attribute points than normal characters. You can either get Buzzer Beater (which have no additional passive) from reaching lvl-50, purchase from the cash shop or pray to rngesus to get it from balls (similar to gacha).\n* Cosmestic's stats boost which cost real money to add it permanently.\n* Stats boost card gacha.\n* Skill slots which cost real money (can get from event which occur once a year[?] )\n\nConclusion: It's a nice game to play if you have a lot of money to spend.", "timestamp_created": 1473437724, "timestamp_updated": 1473437724, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.620346963405609131", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25309272": {"recommendationid": "25309272", "author": {"steamid": "76561198309245780", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 55759, "playtime_last_two_weeks": 0, "last_played": 1547646261}, "language": "english", "review": "GAME PAY TO WIN , #THISISSHIT", "timestamp_created": 1472838465, "timestamp_updated": 1472838465, "voted_up": false, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.572004556655883789", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16214289": {"recommendationid": "16214289", "author": {"steamid": "76561198069880892", "num_games_owned": 255, "num_reviews": 19, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1428987694}, "language": "english", "review": "B-BALL BABY, SHIEETTT!\n\nfreestyle 2 is an excellent sports game. probably the only basketball game i would ever be willling to play, it has simple but fun gameplay and acool cell shaded  graphics. The character customization is great and there are alot of different clothes that you can choose from. the only cons are the dirty korean free to play tactics that they use.\n\n6-7/10", "timestamp_created": 1433550920, "timestamp_updated": 1433550920, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.645518183708190918", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42002009": {"recommendationid": "42002009", "author": {"steamid": "76561198177612931", "num_games_owned": 15, "num_reviews": 6, "playtime_forever": 3470, "playtime_last_two_weeks": 0, "last_played": 1534621280}, "language": "english", "review": "Too Much bugs, dev dont care ths game anymore, devs only care bout your money.", "timestamp_created": 1526146286, "timestamp_updated": 1526146286, "voted_up": false, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.589565157890319824", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24653758": {"recommendationid": "24653758", "author": {"steamid": "76561198196922549", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 10245, "playtime_last_two_weeks": 0, "last_played": 1501574603}, "language": "english", "review": "Can't play this game, don't know why, the app is just crashes", "timestamp_created": 1470064271, "timestamp_updated": 1470064271, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.53910982608795166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25016920": {"recommendationid": "25016920", "author": {"steamid": "76561198147302963", "num_games_owned": 42, "num_reviews": 8, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1460135671}, "language": "english", "review": "Fuckers put bitcoin miner in this shit", "timestamp_created": 1471629401, "timestamp_updated": 1471629401, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.543913066387176514", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24512631": {"recommendationid": "24512631", "author": {"steamid": "76561198115913586", "num_games_owned": 79, "num_reviews": 14, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1498095907}, "language": "english", "review": "DO NOT DOWNLOAD IT HAS A BITCOIN MINER", "timestamp_created": 1469423654, "timestamp_updated": 1469423654, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.561233043670654297", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42946447": {"recommendationid": "42946447", "author": {"steamid": "76561198397449185", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 1509, "playtime_last_two_weeks": 0, "last_played": 1529707277}, "language": "english", "review": "Unbalanced, pay2win, too easy to score, the game becomes a ping pong match where both teams just iso and score at will. Defense is damn near non-existent. The skills are 99% offensive giving players every bs way of scoring. SW's are stupid OP. Shoot like gods, dribble like gods, layup like gods, dunk like gods. Played a lv50 SW, felt like I met the 2nd coming of Christ. Good lord is the skill gap from 1-23->24-50 a turn off. Players just spamming the same OP dribble moves while you contemplate why you're even playing since 80% of contested shots go in. This game is so bad it makes me want to go back to 2K...yes that bad.", "timestamp_created": 1529708478, "timestamp_updated": 1529708478, "voted_up": false, "votes_up": 13, "votes_funny": 17, "weighted_vote_score": "0.6071929931640625", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19268218": {"recommendationid": "19268218", "author": {"steamid": "76561198020562623", "num_games_owned": 154, "num_reviews": 2, "playtime_forever": 1288, "playtime_last_two_weeks": 0, "last_played": 1448553967}, "language": "english", "review": "[h1] Pros [/h1]\n\nF2P\nExcellent tutorials\nGreat gameplay\nGreat customization\n\n\n[h1] Cons [/h1]\n\nPay to win\nPay to win stuff is overly priced.\nNot enough lobbies. I am forced to play with 30 lvls while im 5 lvl because i won against rookies. WTF?\nDid i mention horrible prices?\nYou need to grind a lot if you are not gonna pay.\n\n5/10", "timestamp_created": 1448469963, "timestamp_updated": 1448469963, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.640919089317321777", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32831026": {"recommendationid": "32831026", "author": {"steamid": "76561198098285419", "num_games_owned": 30, "num_reviews": 16, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1476529498}, "language": "english", "review": "absolutely pay to win system like freestyle 1.If special character have no status effect and just a skin maybe this will be a new revolution of freestyle but the fact its not,its just same game with a bit of new feature and same P2W system", "timestamp_created": 1498511834, "timestamp_updated": 1498511834, "voted_up": false, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.594128727912902832", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31334005": {"recommendationid": "31334005", "author": {"steamid": "76561198254420438", "num_games_owned": 5, "num_reviews": 3, "playtime_forever": 159636, "playtime_last_two_weeks": 0, "last_played": 1548913816}, "language": "english", "review": "kill me", "timestamp_created": 1493012885, "timestamp_updated": 1493012885, "voted_up": true, "votes_up": 15, "votes_funny": 15, "weighted_vote_score": "0.634158611297607422", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23087534": {"recommendationid": "23087534", "author": {"steamid": "76561198153103763", "num_games_owned": 40, "num_reviews": 15, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1462486714}, "language": "english", "review": "When defending you feel like trying to stop Aston Villa from getting relegated....", "timestamp_created": 1463690697, "timestamp_updated": 1463690697, "voted_up": true, "votes_up": 18, "votes_funny": 52, "weighted_vote_score": "0.631391227245330811", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22735149": {"recommendationid": "22735149", "author": {"steamid": "76561198028730043", "num_games_owned": 127, "num_reviews": 34, "playtime_forever": 1987, "playtime_last_two_weeks": 0, "last_played": 1547277149}, "language": "english", "review": "The Community is a bunch of tryhards\nMiss a shot Prepare to get Raged at.\nFail a Dunk Prepare to get Raged at.\nDont Block Prepare to get Raged at.\n\nThey will find ways of yelling at you for 1 Small Mistake\n \nThats like 90% of this Games Community\n\nOh and the Game is fully Pay2Win.", "timestamp_created": 1462072214, "timestamp_updated": 1546003306, "voted_up": false, "votes_up": 61, "votes_funny": 18, "weighted_vote_score": "0.613922834396362305", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34359767": {"recommendationid": "34359767", "author": {"steamid": "76561198036191710", "num_games_owned": 139, "num_reviews": 8, "playtime_forever": 48462, "playtime_last_two_weeks": 0, "last_played": 1550587804}, "language": "english", "review": "I wish i could recommend it, but i cant, lately the game's been a huge shit fest. Lag more than occasionally. The game closing on you, several shots say 7/10 missing that should go in. PG's stealing balls they should have never gotten or be able to steal at all. Delays, ping issues. Missing several Chip-outs that you clearly had. Rebound's tipins etc you name it. I regret spending money on this game with the state it is in lately. The issues with balls missing have been playing for longer and have yet to be fixed. Not to mention the bullshit 0.5cm in reach and still block your ball PF luckers, to elaborate you shoot the ball they are 2m away from you and barely touch the ball but still get the full block. AKA Mad bullshit Blocks.\n\nWould not recommend this game at all untill these keypoints have been fixed and the game is enjoyable again.", "timestamp_created": 1503178685, "timestamp_updated": 1503178685, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.58211815357208252", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15730773": {"recommendationid": "15730773", "author": {"steamid": "76561198067147615", "num_games_owned": 540, "num_reviews": 2, "playtime_forever": 1160, "playtime_last_two_weeks": 0, "last_played": 1430944008}, "language": "english", "review": "Pros:\n- easy to get into with a bit of basketball knowledge\n- first hours are really fun\n- if you get good teamplayers and go on a winning streak, it is really fun but..\n\nCons:\n- ..but that nearly never happens, toxic community, lot of ego players, who only spam \"pass me the ball\" and never pass back and insult you anyway\n- the game supports this ego style because being open isnt as important as individual skill and outplaying your direct opponent\n- simple but sometimes weird acting controls (buttons have 2-3 different functions, dunk and postgame for example), different results in same spots and blocks and rebounds seem a lot like coin flips most of time, or i didn't play long enough to understand the mechanics.\n- lags are a huge issue, a lot of players warp around the court and score or rebound or get lose balls without the game even showing anything. it just happens.\n- terrible UI, lots of bugs, long loading times, the game hides a lot of information for example skills and stats of other players, which i guess is intended because..\n- .. massive P2W, you can buy toys, cards, skills, freestyles and clothing with bonus stats\n- no real matchmaking, you could get a team of 3 Cs who just afk or a perfect P2W team with a 5 game winning streak, both games are going to be no fun at all.\n\nSummary:\nIt really has a lot of potential and could be fun, but the issues and the community are just to bad to keep playing it for longer.", "timestamp_created": 1431025718, "timestamp_updated": 1431025718, "voted_up": false, "votes_up": 49, "votes_funny": 5, "weighted_vote_score": "0.614513635635375977", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30226109": {"recommendationid": "30226109", "author": {"steamid": "76561197999341489", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 90936, "playtime_last_two_weeks": 1765, "last_played": 1551834465}, "language": "english", "review": "I like this game, I really do.. Its one of hte funner basketball games out there (outside of NBA 2k), The controls are relatively simple,  and it can be real competitive. The only REAL problem is all the hazers and people giving newbies hell for not be an instant legend. Its unreal how some people int his game just jump down someones throat if you miss one shot.. Overall, If you have tough skin, and dont let words and critisism bother you, I think its a game worth playing.", "timestamp_created": 1488223210, "timestamp_updated": 1488223210, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.630108654499053955", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34117401": {"recommendationid": "34117401", "author": {"steamid": "76561198135790425", "num_games_owned": 101, "num_reviews": 11, "playtime_forever": 273, "playtime_last_two_weeks": 0, "last_played": 1502406493}, "language": "english", "review": "PIE OF SHITE", "timestamp_created": 1502251755, "timestamp_updated": 1502251755, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.531068801879882813", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15179272": {"recommendationid": "15179272", "author": {"steamid": "76561198072690956", "num_games_owned": 141, "num_reviews": 7, "playtime_forever": 5419, "playtime_last_two_weeks": 0, "last_played": 1528517002}, "language": "english", "review": "Been playing this game since release, and played way back since Freestyle 1 when Sierra own the game, still overall fun and enjoyable, don't really care much if it's pay to win, It's fun, the graphics doesn't really matter since it's cell shaded, and overall there are tons of skills to use. When it comes to BallingIsLife™ this game still deserves the award of being fun and even if you don't like sport games, this is still an enjoyable game due to the mechanics of it and animation which I find humorous. Game was my childhood and I'm still playing it.\n\nPros: \nEasy to learn\nFun to play\nLots of clothes and customizations\nLots of skills\nToy system is interesting to play around for stats\nStill feels like the old free style games\nDunking on people feels amazing!\nTournaments\nGrowing community\n\nCons:\nPay to win *Debatable*\nLots of foreign people play so teamwork is hard to communicate\nServers are a little unbalance from level caps\nLots of people sliding due to the lag of the server\n\nReasons why I say pay to win is debatable is because I have accounts that have never touched a single cent from my wallet, and overall I am still able to win games, on my main accounts I have 85% win rates on them and played over thousands of games with them, My personal opinion it really depends on your skill level and how you play the game, because when you're playing the game, you'll see that anyone can shoot and make baskets, or defend and block shots, its really how well you play with your team and how good your offense and defense is. Overall good game, I enjoy it and Its free, so play the game.", "timestamp_created": 1428030692, "timestamp_updated": 1428035449, "voted_up": true, "votes_up": 45, "votes_funny": 7, "weighted_vote_score": "0.683661878108978271", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29513195": {"recommendationid": "29513195", "author": {"steamid": "76561198331555006", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 8012, "playtime_last_two_weeks": 0, "last_played": 1522374443}, "language": "english", "review": "i like this game but the servers wont wurk and i wanna die", "timestamp_created": 1485483511, "timestamp_updated": 1485483511, "voted_up": true, "votes_up": 6, "votes_funny": 10, "weighted_vote_score": "0.605734765529632568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "44896596": {"recommendationid": "44896596", "author": {"steamid": "76561198043960745", "num_games_owned": 77, "num_reviews": 1, "playtime_forever": 12455, "playtime_last_two_weeks": 103, "last_played": 1551732866}, "language": "english", "review": "dis game ass.\n\n\n\nsrs review, just got to LVL 50 SF and here are my impressions: \nPros\n1) it's very fun, addictive, and appealing to basketball fans and non alike. \n2) Customization is very very good and most characters do not look alike. The leveling system feels fleshed out and rewarding.\n3) It's a visually beautiful game. The cel shading, while causing depth issues with my bad eyes, is a really nice theme and makes me feel like i'm in a basketball manga.  \n4) All the positions feel unique\n5) Very skill based.\n6) You can mute chat \n\nCons\n1) Major issues with matchmaking and queue time. The suggested queue is 2:30 but outside of peak hours in pro channel sometimes it'll take up to 10 minutes to find a match. \n\n2) Ded game xd. Small would definetely describe the community. Not only massive queue times, but expect to replay teams. I've played the same team four times in a row before. That also applies to joining teams. This game is like a shitty highschool where everyone knows eachother. If you play about 50 matches in a week it feels like you've pretty much versed the entire active playerbase. Before you know it you'll be instakicked from a random lobby you matchmaked to enter cause the host thought you were ass on Tuesday. \n\n3) The game doesn't teach you how to play defense. The game tells you to stay in front of your opponent and that's it.  Most new players will be left on an island trying to figure out how to block long directional layups and directional dunk or correctly face up. The most effective guide to defending is on YouTube because this game gives you no good advice in it's practice mode.  \n\n4) Clunky Controls. I have almost 200+ hours in the game and movement is still awkward, clunky, and boxy on every character I play. Say, you're chasing down a shooter running to the corner, and you're inbetween the corner and the wing, your first instinct is to run in a straight line at the shooter. You'll be going in the direction of the shooter but if you're using arrow keys there's no guarantee you're running at the shooter in a straight line which means you might have to slightly shift directions with your keys and lose speed. \n\n5) Crashes. This games crashes like a drunk cousin on your couch. Some days my game will crash up to 5 times in a row at tip off. This also happens with other players all the time sending you continously back to matchmaking.\n\n6) Very very very P2W elements in the game. GK tries to give out free stuff during it's events to distract you from that. You can grind missions all day for like 3 card balls or spend $10 right now and get 14. Or log on all week for a single prism card when they're on sale right now for 10 for $5. Most people wonder how the game is P2W if it's skill based but, stats and good cards matter and make a difference. \n\nFinal thoughts: \nFS2 is a brilliant concept with fun gameplay but poor execution in general. I'd only recommend the game in a few scenarios: \n-With a group of friends you'd have fun with win or lose. \n-If you're a basketball fan who can't afford 2k. \n\nBut for the most part just taking the game seriously or a ladder daddy as a free to play isn't really fun at this point.", "timestamp_created": 1537720475, "timestamp_updated": 1537720475, "voted_up": false, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.593195259571075439", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15274409": {"recommendationid": "15274409", "author": {"steamid": "76561198073820151", "num_games_owned": 74, "num_reviews": 5, "playtime_forever": 1107, "playtime_last_two_weeks": 0, "last_played": 1462022431}, "language": "english", "review": "Fun, cool game and when u look at it u think oh it is a shit game but infact it is so enjoyable I love it to bits and the crew system they have in the game is amazing I do recommend this game to kids above 10+ years of age.", "timestamp_created": 1428561559, "timestamp_updated": 1428561559, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.594952046871185303", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25028098": {"recommendationid": "25028098", "author": {"steamid": "76561198116714353", "num_games_owned": 165, "num_reviews": 11, "playtime_forever": 4954, "playtime_last_two_weeks": 0, "last_played": 1544252219}, "language": "english", "review": "This game in short is a great experience by yourself until a point.  In the game they're 2 types of \"ranking\" leagues Major and Pro.  Major is 1-24 and Pro is 24-50.  Major is more friendly and kind this is also where playing solo is fine.  But... Pro is just about impossible to play solo you NEED people to que who won't say your bad when you make one mistake and in a sense throw the game.  So in total Major is really fun, Pro, playing solo is a bad decision you pry have a better chance of throwing yourself off a cliff and hoping you don't hit your skull and have your brains splatter everywhere.", "timestamp_created": 1471681280, "timestamp_updated": 1471681280, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.515357494354248047", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48223897": {"recommendationid": "48223897", "author": {"steamid": "76561198127567438", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 3368, "playtime_last_two_weeks": 0, "last_played": 1548427937}, "language": "english", "review": "At the start of the game its fun to play....but slowly but surely you will get the flavour that its a pay to win game...\nYou'll think that still are beating pay2win players you can continue....the better you get the larger the difference between pay2win and normal players.\nBesides, there are 2 different rooms...one for 1-24 lvl characters and one for higher than 24.... in higher than 24lvl lobbies you will have a tough time finding lobbies because its full of pay2win people and they will probably kick you because it becomes almost impossible to win with normal players.\nThis review is for people who are entering the game with the mentality to invest zero cents into the game. (btw it takes a hefty ammount of money to become a proper pay2win player)", "timestamp_created": 1547127458, "timestamp_updated": 1547127607, "voted_up": false, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.583275258541107178", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34333361": {"recommendationid": "34333361", "author": {"steamid": "76561198245598964", "num_games_owned": 222, "num_reviews": 6, "playtime_forever": 30634, "playtime_last_two_weeks": 0, "last_played": 1547244650}, "language": "english", "review": "The classes are but you have to pay to get more skill slots, and the chances of getting free items that are good are slim to none.\n[*] Laggy - Lot of ddos loading time to recieve items after clicking button takes quite awhile sometimes....\n[*] Buggy - Bad module error on Windows 10, crashes often.\n- Game does not load into starting the game but freezes and you are put back to lobby.\n[*]Toxic players - kicking people from room majority of the time for no reason (banned from room no just a kick option)\nPile of ♥♥♥♥ community, no support.\n[*]Dying Game\n[*]P2W\n[*]Smurfs - pregroup in rooms (pro only kicking is reel)\n[*]Not noob friendly when there is experienced players hammering you with hate\n[*]Buggy ball\nAesthetics:\n-only best items are Gkash\n-gifting isn't available", "timestamp_created": 1503078514, "timestamp_updated": 1519347948, "voted_up": false, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.565793871879577637", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26021370": {"recommendationid": "26021370", "author": {"steamid": "76561198149691696", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1476404547}, "language": "english", "review": "Don't waste your time on getting this game.This game is pay to win game.Everytime developers try to fix a bug 2 new ones appear.Bugs are expected but how do  you have bug that crashes the sever everytime.If you want to waste your money don't waste here it's not worth it.Lvl 60's of this game are pay to win players that give their money to this game, they make this game hell when trying to lvl up.The only time your going to win is when you are 1-30 lvl.This game is waste of time because once you reach the lvl 50 milestone you never see the light and day until you open your pockets for the game.Why should waste your time on this game that breaks because of giltches and pay to win players.Don't get me started with the chat in this game, the people in this game will tell you how bad you are every single day of life until you make the right decision and unistall this game.If you want to go through hell play this game you'll experince it.", "timestamp_created": 1476404865, "timestamp_updated": 1476404865, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.524632692337036133", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18119824": {"recommendationid": "18119824", "author": {"steamid": "76561198105954782", "num_games_owned": 39, "num_reviews": 20, "playtime_forever": 5504, "playtime_last_two_weeks": 0, "last_played": 1517464593}, "language": "english", "review": "i'm very love with street ball basket, and its also online ! but not like nba or fifa street or ther games,\nthis games is typichal pay to win games T_T such a pity . .\n\nenjoy play as street gank basket ball !\n\neven the skill is needed, but rich player with pro skill will unbelieveable super strong and just mock newbie . . \nactually im mixed , i prefer recommend it, because i love this game hehe \ngood luck & have fun !", "timestamp_created": 1442766166, "timestamp_updated": 1442766166, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583333313465118408", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29244205": {"recommendationid": "29244205", "author": {"steamid": "76561198254598661", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 5013, "playtime_last_two_weeks": 0, "last_played": 1515174889}, "language": "english", "review": "Good game bad server.", "timestamp_created": 1484390106, "timestamp_updated": 1484390106, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584905624389648438", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41216525": {"recommendationid": "41216525", "author": {"steamid": "76561198159248723", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 119453, "playtime_last_two_weeks": 3119, "last_played": 1551654097}, "language": "english", "review": "I have played this game for a good amount of time now, maybe 2 years. A lot of pros and cons...I'll list the pros first. I honestly have a lot of fun playing this game and it rarely ever got boring. Unique character appearance and customizations, arcade like, but still requires strategy to win consistently. Every once in awhile there are some really helpful events for free special characters and item draws and stuff like that too. It starts of slow because rookie channel is very basic and you are in rookie channel for a good amount of time (for like the first 24 lvls or so, in my opinion way too long) but once in pro channel is when the fun starts. You can get a group of 3 friends in a private room or just play with randoms to get a game going.  \n\nNow there are many cons to this game as well. The game is definitely dying because the devs are not doing anything to really help this game or the players. As a result, there are not many new players making rookie channel seem very dead and can often be hard to get into a game. Pro channel is a lot better but not like how it was 2 years ago. Next, this game is p2w. There's no doubt that spending some cash will get you an advantage over others. Characters don't matter, it's really the card system in the game that can really boost your stats. There are also good amount of hackers in this game now due to the lack of management. Lastly this game is heavily reliant on ping. If your ping is anything over 60ish, playing big man will be difficult. You can get away with it in rookie but pro channel won't be as forgiving, this is coming from a player whose main position is PF with a ping of 80.\n\nIn summary, I really do like this game... a lot...but at it's current state it's no wonder that it is dying off. Maybe a miracle will happen and devs will actually get their sh*t together but that is very unlikely. Whatever new players that join the community can hopefully turn it back around to what it was when I first started lol", "timestamp_created": 1522625460, "timestamp_updated": 1522626316, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583333313465118408", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15160435": {"recommendationid": "15160435", "author": {"steamid": "76561198099675160", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 5067, "playtime_last_two_weeks": 0, "last_played": 1440887992}, "language": "english", "review": "I've been playing Freestyle for 7 long years. Since I was 12 years old, Freestyle has been my favorite game.\nIt has been with me throughout all my teenage years, and I don't regret a thing.\n\nEver since it first came out in 2006 (published by Activision), the game has had issues maintaining a good population due to lack of advertising and support from the foreign developers (JCE).\n\nThat's all hopefully going to change now that it has been released on Steam. It's a shame how we had to wait so many years for this because this is one of the most competitive games in the world.\n\nEverybody who plays this game strives to ultimately be the best, and it's a team game so you have to find 2 other players who share the same mindset as you and want to be the best just as bad as you are.\n\nA lot of this game consists of managing egos of not only your rivals, but your teammates also.\nThere is only one ball in the game of basketball, and scoring is only one part of it.\nYou have to have a good overall team that can not only score, but rebound, defend, block, steal, and pass at the right times.\n\nThis game is all about customization and making your player unique. There is a big item shop in the game that allows you to buy headgear,tops,bottoms, shoes, and accesories to make your baller look unique.\n\nThere are also Freestyles that allow you to change basic animations like dunks and shots so you can turn your simple one handed dunk in to a crazy 360 between the legs dunk!\n\nThen you have your skills. Skills are new animations and upgrades you unlock through leveling your character.\nSkills are the most important part of the game since they give really useful animations like diving for the ball or fading away.\n\nWhen you first start the game and you go in to Rookies, you will be playing versus new players such as yourself who are also learning the game and it will be a cake walk for those who learn faster than others.\n\nBeware though, there is a huge learning curve when you reach the big leagues (PRO Channel).\nPeople do NOT like losing in Pros because it will result in their win % going down and the person that beat you having proof of them beating you.\n\nI was never a guy to make many friends on this game, in fact I made a lot more enemies than I did friends and I am very hated but my advice to you new players is, make some friends before you reach Pros.\n\nTry your hardest to communicate and socialize, post on the forums. MAKE FRIENDS. You do not want to be that \"random\" \"unknown\" person in Pros because nobody knows you and you will be kicked out of teams that have good players when you try to join because they simply don't know you.\n\nYou will be stuck on the \"Noob Treadmill\". That means you will be stuck playing only with players who are really bad and don't care who they play with, and other unknown players like you are which means you will lose A LOT and people will never see you as good.\n\nSo make friends before you get to pros! Get your name out there.\nIf you pick up this game and decide you like it and you're either a PG,PF,or C then you can add my character in game, I will help you. My IGN is: Zarry\n\nSo yeah, that is it for my long review and although my time on this game is coming to an end, I am happy it is finally getting the exposure it deserves because I know theres a kid out there right now maybe even reading this whos 12 or 13 years old that will fall in love with this game and aspire to be the very best player just like I did.\n\nGood look in the pros, newbs.", "timestamp_created": 1427922326, "timestamp_updated": 1427922326, "voted_up": true, "votes_up": 132, "votes_funny": 23, "weighted_vote_score": "0.711421668529510498", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 8, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 3157, "total_negative": 1322, "total_reviews": 4479}}
