{"reviews": {"48859706": {"recommendationid": "48859706", "author": {"steamid": "76561198105561788", "num_games_owned": 548, "num_reviews": 317, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1549676309}, "language": "english", "review": "─▄▄█████▀▀▀▀▀███████████▀▀▀██▓\n███▀╙───────────╙▀███████▀─███▌\n█╙────║▓▓▓▓────────▀████▀▀┐███\n──────└└▀██▌─────────████████\n────────┌███▄─────────██████\n───────╓█████▄────────▐████\n──────╗███─███────────▐███┘\n────┌███▀───███───────▓██┘\n───╒███┘────└█████▄──▄██▀\n▄──╙╙╙───────╙▀╜└───▄██▀\nI want to believe", "timestamp_created": 1549676314, "timestamp_updated": 1549676314, "voted_up": true, "votes_up": 21, "votes_funny": 29, "weighted_vote_score": "0.672345995903015137", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48995705": {"recommendationid": "48995705", "author": {"steamid": "76561198014609422", "num_games_owned": 91, "num_reviews": 7, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1550213058}, "language": "english", "review": "http://teamfortressclassic.org/\n[AE]", "timestamp_created": 1550184147, "timestamp_updated": 1550184147, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.573943674564361572", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "49072760": {"recommendationid": "49072760", "author": {"steamid": "76561198081750094", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 3494, "playtime_last_two_weeks": 49, "last_played": 1551472387}, "language": "english", "review": "A bit like dark souls, but in more need of medical attention.", "timestamp_created": 1550496937, "timestamp_updated": 1550496937, "voted_up": true, "votes_up": 3, "votes_funny": 4, "weighted_vote_score": "0.566929101943969727", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48872564": {"recommendationid": "48872564", "author": {"steamid": "76561198272685783", "num_games_owned": 23, "num_reviews": 2, "playtime_forever": 748, "playtime_last_two_weeks": 0, "last_played": 1539820564}, "language": "english", "review": "This game has many good and bad aspects. Here's a quick list:\n\nThe Good:\n> The game is really fun with a handful of people\n> There are a ton of maps (This is both an upside and a downside, mostly due to new players not knowing what to do in some game-modes)\n> The classes (Scout, Soldier, Pyro, Demo-man, Heavy Weapons Guy, Engineer, Sniper, Medic, & Spy) are very fun to play as.\n\nThe Bad:\n>Some classes, such as Pyro and Medic, are very overpowered. (Pyro has a rocket launcher that sets the enemy on fire, and Medic has two shotguns.)\n>There are very little people who still play this game, all in 3 servers.\nOverall I give this game a 9.5/10. There just isn't much wrong with the game, or I didn't pick some of the flaws.\n", "timestamp_created": 1549719804, "timestamp_updated": 1549719804, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545112788677215576", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49129515": {"recommendationid": "49129515", "author": {"steamid": "76561198310575050", "num_games_owned": 150, "num_reviews": 58, "playtime_forever": 84, "playtime_last_two_weeks": 4, "last_played": 1550711342}, "language": "english", "review": "Team Fortress Classic is a game by Valve (I've been doing so many Valve games this month o.o) and it is probably one of my favorites. It is the reason that one of the best games ever (Team Fortress 2) exists. I REALLY love this one. So it's an online FPS game where you can play as a certain character, they are all the same as in TF2 I believe, I haven't played TF2 for years and since this new laptop only plays older games, there is not even a way to play TF2 at this point, but maybe when I get a harddrive, I'll be able to play it.\n\nAnyway, TFC is just Team Fortress 2 with better maps, older graphics, different character design (while still having the same names), and the voice is also completely different. The one in Team Fortress 2 is a female and in this one, it is the normal (kind of creepy) voice that tells you when the round will be over or something simple like that. The sound design is amazing, it is a big improvement for all the previous games by Valve, CS did have some good sound design except the voices sounded like they were talking while a fan was on.\n\nThe other things I liked about this game is the character design. Exactly what you'd expect from a Valve game, but with more detail. The characters have personalities in TF2, here it is just Counter-Strike pretty much. But yeah the character design slightly gives off how they might be if they were an actual person. I guess you could say it gives off their personality? I don't really know how to say that one but, yeah, Team Fortress Classic has amazing character design!\n\nThe controls are every other Valve game, as I've said about 2000 times at this point, I've review the entire Half-Life 1 Anthology, Counter-Strike Anthology, and some other Valve games that nobody really talks about anymore. But Team Fortress still holds up and has many nice players that I've met in the game. I've played enough of it to really get good at the game and get to know the community of people there that were actually really cool people. Since TFC is an old game, it is kind of dead, but if you wait around a bit, more people start joining the servers.\n\nBut another thing I am glad about, this was actually a game from the 90s so it wasn't stupid like every other god damn game by Valve (other than Half-Life series, Counter-Strike, and I guess Ricochet...?) so I'm glad about that. The fun I've had in this game was so much fun. I really recommend this game, it goes for 99 cents during sales but full price it goes for $4.99 USD, so it is a pretty cheap game and I recommend buying it if you're into these old games, so yeah, go for it, definitely, I say do it quick because the game might die. It's still pretty active today and I'm super surprised. In 10 or 20 years, Steam might be gone or something or the game may have 0 players on every server. Many Steam games that are multiplayer might have 0 players, unless they are new, so I recommend you to buy this one quick before anything sad like that happens. Anyway, lets get to the final score.\n\nFinal score: 100%\n\nI'm dead serious about the final score. I really am serious. It is pure fun, I REALLY recommend this, I really really REALLY recommend it. It is that good, and I hope you think of buying this sometime soon and I'll meet you there. It is such a good game, a classic. It was out a long time before I even existed but it's still a pretty damn good game. But yes as I've stated millions of times by now, I recommend it. Really. I really really really really really REALLY REALLY recommend it. Bye now, and hope you consider buying this amazing title.", "timestamp_created": 1550710527, "timestamp_updated": 1550710536, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48937867": {"recommendationid": "48937867", "author": {"steamid": "76561198142807305", "num_games_owned": 218, "num_reviews": 54, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1549924610}, "language": "english", "review": "Even though its a a old game. A lot of people are still playing it.its still fun.", "timestamp_created": 1549930164, "timestamp_updated": 1549930164, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503816783428192139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49030471": {"recommendationid": "49030471", "author": {"steamid": "76561198132425204", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 3226, "playtime_last_two_weeks": 1082, "last_played": 1551869850}, "language": "english", "review": "honestly in a lot of ways i think this game is better than tf2\n\n+theres no picking hats, no annoying taunts, no worthless reskins\n+pick your guy and get straight to business\n+loads incredibly fast\n+nice people\n+medic class actually appreciated/has a chance of survival\n\nthe only con:\n-if you want to know why valve didnt add class exclusive grenades for tf2, play tfc", "timestamp_created": 1550325110, "timestamp_updated": 1550538641, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49158110": {"recommendationid": "49158110", "author": {"steamid": "76561198064022698", "num_games_owned": 46, "num_reviews": 20, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1483313748}, "language": "english", "review": "I forgot I had this in my library and I don't know how it got there. It has team fortress in the name so I'll assume that it's good.", "timestamp_created": 1550852815, "timestamp_updated": 1550852815, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48936309": {"recommendationid": "48936309", "author": {"steamid": "76561198180674691", "num_games_owned": 40, "num_reviews": 2, "playtime_forever": 524, "playtime_last_two_weeks": 1, "last_played": 1550680030}, "language": "english", "review": "gud", "timestamp_created": 1549922733, "timestamp_updated": 1549922733, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503472208976745605", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48956498": {"recommendationid": "48956498", "author": {"steamid": "76561198334398251", "num_games_owned": 1011, "num_reviews": 28, "playtime_forever": 77052, "playtime_last_two_weeks": 14388, "last_played": 1551876431}, "language": "english", "review": "i don't know how to open this thing.", "timestamp_created": 1550005008, "timestamp_updated": 1550005008, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49308656": {"recommendationid": "49308656", "author": {"steamid": "76561198153706200", "num_games_owned": 58, "num_reviews": 58, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1527677623}, "language": "english", "review": "Dead community.", "timestamp_created": 1551507217, "timestamp_updated": 1551507217, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497987955808639526", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12733892": {"recommendationid": "12733892", "author": {"steamid": "76561197988356095", "num_games_owned": 25, "num_reviews": 4, "playtime_forever": 593, "playtime_last_two_weeks": 0, "last_played": 1426563270}, "language": "english", "review": "When I got this for Christmas in 1999 along with Half-Life, I didn't even know what it was. \nWhen I got home two days later and installed it, my family wouldnt have access to our computer again. \nI used to trade off every 5 deaths or 20 kills with my little brother until the late hours of the night. When I would get in trouble, TFC would be taken away, and I would have to go outside and play. I can still remember my best friends names, though I doubt they still play it. I can even still remember my favorite medic. I remember mulching until I could finally kick the shit out of anyone (this was before stat tracking, though I would assume the hours would be in the thousands.) VIP, Climb, and Jump maps were perfect to kill time and be silly with all your friends. \nThough I havent played since TF2 came out, I miss this game more than anything ever. Definitely the fondest memory I have as a child. This game made me fall in love with Sierra (VALVE), and to know what real FPS's should be like. \nI have purchased this game three times after the initial gift, to install on friends and girlfriends computers so that I could play at their houses. \nBuy this even if it's just to have it in your collection and you never play it. At least you can say that you have it and pretend that you are OG. \nI love you TFC.", "timestamp_created": 1414884597, "timestamp_updated": 1414884597, "voted_up": true, "votes_up": 631, "votes_funny": 126, "weighted_vote_score": "0.931198179721832275", "comment_count": 29, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13788067": {"recommendationid": "13788067", "author": {"steamid": "76561198095248961", "num_games_owned": 642, "num_reviews": 26, "playtime_forever": 122, "playtime_last_two_weeks": 0, "last_played": 1514837368}, "language": "english", "review": "[h1] Here is the Review for non-tf2 players: [/h1]\nA pretty neat old online multiplayer shooter using the GoldSource engine\nits not dead, it still has great community servers and is fun\nwith friends (if you have any) or with strangers you can annoy by simply saying tf2 is better because of hats\n\n[h1] Review for Tf2 Players:\t [/h1]\n> No Hats\n> Nobody plays Pyro because he sucks\n> spy has a shotgun and a smg\n> sniper plays like the tf2 sniper using classic (obviously)\n> no bonus ducks", "timestamp_created": 1420217976, "timestamp_updated": 1431108445, "voted_up": true, "votes_up": 414, "votes_funny": 734, "weighted_vote_score": "0.898720681667327881", "comment_count": 45, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13944106": {"recommendationid": "13944106", "author": {"steamid": "76561197977293398", "num_games_owned": 1290, "num_reviews": 1, "playtime_forever": 313870, "playtime_last_two_weeks": 0, "last_played": 1549215257}, "language": "english", "review": "A great underrated classic that still has populated servers 24/7. (You can check for players with the in-game server list, bots won't be shown.) TFC offers one-of-a-kind exciting fast paced gameplay with tons of tactics and ways of playing the game. Easy to get into and enjoy, hard to master. However, you're bound to have fun along the way.\n\nDespite old age, the game has a timeless design with a completely customizable appearance; you can choose from many custom models, sprites, skins, textures etc. There are active community servers hosting many of thousands of custom maps total with official game modes like; Capture The Flag, Control point, Attack/Defend, Escort, Deathmatch as well as custom ones like King of the Hill, Hold or Score Ball etc.\n\nIf you're interested in skill jumping (with weapons) there are servers hosting maps made for conc-, grenade-, rocket- and pipe jumping. There are also a lot of movement skill maps where you can climb, bunnyhop, strafe, surf, ramp slide and even water glide (shark) on a few servers. Or if you just want to play some random fun maps and mess around, there's escape, puzzle, hide & seek, sniping, role-play, secret hunting, low gravity and so on. As for mods, there's NeoTF (which gives you extra abilities and buildables), AdminOP (Ent Mod, Radio Mod, Hook Mod) and others.\n\nIt's not just one of, but [i]The[/i] most popular online multiplayer game of all back in 1999 before CS took the crown. Nowadays, there are barely any FPS games that don't get boring after a few hours. TFC will have you keep coming back for more, time and time again. Without relying on achievements or item drops.", "timestamp_created": 1420992812, "timestamp_updated": 1420992812, "voted_up": true, "votes_up": 123, "votes_funny": 17, "weighted_vote_score": "0.867745280265808105", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40814893": {"recommendationid": "40814893", "author": {"steamid": "76561197980241391", "num_games_owned": 102, "num_reviews": 2, "playtime_forever": 504713, "playtime_last_two_weeks": 0, "last_played": 1531935867}, "language": "english", "review": "I have read many TFC \"reviews\", and I use that term loosely, that express the reviewer's dismay at the lack of subtlety between classes. The use of grenades compared to the absence of grenades in TF2. STOP RIGHT THERE. You  must know your history before you can start comparing these two games from the same company that would indicate a sequential progression from one to another. Unfortunately, these are two completely different games that should technically have been named something completely different. Go read this for your history lesson: https://wiki.teamfortress.com/wiki/Team_Fortress_2\n\nTeam Fortress 2 was promised to be one thing and ended up being delivered almost 8 years later as something totally different. So different from it's predecessor as to be recognized as something totally different by TFC players. Those players have never gotten a true TFC sequel. TF2 forces the teamplay aspect by it's design. TFC to a contrast allows for a team oriented experience unparalelled by TF2 due to one aspect that was never added to TF2 and that is grenades. They grant special \"abilities\" in their class specific grenades that can soften defenses and allow a standout solo player to excel. I would wager that an experienced TFC team would completely destroy a TF2 team in either game because of the dynamics that can make TFC brutal.\n\nSome people hate TF2, some people love it, and the same goes for TFC. As we all know THAT part is subjective. What cannot be argued is the factual ways in which the game plays. When I read a review for a product I want facts. You can summarize your overall opinion but give people facts that they might decide whether or not to try the game based on those facts.\n\nGRAPHICS.\nThis is the new player's first hurdle. While not visually stunning the graphics were never meant to be beautiful. TFC is a dark, gritty world of killing and flag capturing. If you want to change the look of the game, amazingly, there are still sites around like https://gamebanana.com/ that still have custom textures, sprites, and models to change the look of many games older and current. No matter what you do you are not getting 2018 graphics on TFC - ain't happenin'. The good news is you aren't here for eye candy or hats, you are here for blood!\n\nGAMEPLAY.\nTeam Fortress was born from an age of death match (DM) games like Doom, Quake, and Duke Nukem. Having such a pedigree it is no wonder that it is 1 part DM, 1 part strategy, and 2 parts team play. The reason I say that is you have to understand the role of the various moving parts.\nGrenades - Your average TF2 player shows up on a TFC server and within 2 minutes chances are he has been killed multiple times with not a hat in sight! Most often with some variety of grenade. It can be a brutal and unwelcoming experience. One thing TFC is not is easy to jump in to and start \"competing\" with vets but that is the way of any established property. You have to go in knowing what you are getting into, hence the importance of a good, unbiased, educated review!\nYou have MANY types of grenades in TFC (in fact all classes get 2 types of grenades) and NO types of grenades in TF2. This statement leads us into classes. In addition to understanding what is up with all these grenades you must know what is up with these classes! All classes get a shotgun and regular grenades (frag grenades) beyond that read for specialties below:\n\nSoldier - Rocket launcher, nail grenades, Slower than average movement speed above average armor\nThis class is heavily utilized for defense but can also be a more than effective offensive player. His nail grenades spew nails for several seconds before detonating like a frag grenade. Great for shredding sentry guns and defender armor. He can also use his frag grenades in combination with a rocket to perform extraordinary jumps allowing him to get through even the heaviest defense.\n\nHeavy Weapons Guy – Auto Cannon (AC Gun or Gatling gun), MIRV grenades. \nVery slow moving, high armor and ammo capacity.\nThis class is primarily used as a defensive class. His auto cannon is a shredder and the MIRV grenade has an initial explosion which causes the grenade to then split into pieces causing several secondary explosions.\n\nPyro – Flame thrower, RPG that fires incendiary rockets, incendiary grenades that burst into a  small “field” of flames and burn several seconds before dieing out\nAverage Speed, average armor\nDefensive or offensive class the Pyro can use his burning mechanics to take out SGs on the one hand and create chaos in defenses or he can fortify the flag by keeping the floor around it on fire while pummeling enemies with incendiary rockets or his flame thrower. \n\nEngineer – Can build a Sentry gun in 3 various levels, can build ammo center for ammo and armor, has wrench to heal builds with, and has a “laser” gun that can push enemies and objects. He also possesses powerful grenades called emps. They are concussive and can destroy people and items thru walls.\nAverage speed, average armor\nPrimarily defense the engineer’s most effective weapon besides his builds are his emp grenades. They explode in a large radius and causes ammo packs laying about and on people to explode more powerfully than average. An engineer can also be good for offense to help break though a particularly sticky defense. He carries 4 emp grenades and 4 frag grenades. That’s A LOT of firepower!\n\nSpy – Tranquilizer gun, pill grenades, knife, ability to disguise as any enemy class\nFaster than average speed\nThe spy is generally offensive due to his lack of firepower but in the right hands a seasoned player can make ANYONE pay with a spy. Their special grenade is an area of effect device. When it discharges it sends out a field of dizzying particles that cause confusion and disorientation in players. This effect leaves them more susceptible to the spy’s knife and stealth tactics. The spy can also “feign death” which means he can play dead disguised as any enemy class and hide in plain sight.\n\nDemolition Man – MIRV grenades like the Heavy Weapons class, a special one use detonation device “det pack” , auto detonating pipe bombs and pipe bombs you can plant and detonate on command\nThe Demo as the class is generally referred to is an outstanding defensive OR offensive class player.\nHe can use MIRVS to clear a room or bring down sentry guns. He can use his det pack to blow up special walls or objectives or to wipe out unsuspecting attackers in large groups. His pipe bombs can be used to lay in wait for the unobservant or he can fire auto exploding ipe bombs into a crowded target. Very diverse and very powerful.\n\nSniper – Frag grenades only, shot gun, machine gun (AR), and sniper rifle.\nAbove average speed.\nWe all know what a sniper can do in any game where he can hide and ply his skills. This sniper is a bit different due to his speed and his machine gun. He can get himself out of certain situations and go back to being an effective sniper.\n\nMedic – Concussion grenades (Concs), Medkit used to heal friendlies or poison enemies, nail gun.\nThe medic be a versatile attacker or defender. He can use his medpack to keep friendly soldiers in the fight behind enemy lines, he can use his concussion grenades to make enemies dizzy and unable to aim properly then switch to his medpack to poison their ranks! He can use that same grenade to power tremendous jumps helping to cover great distances with flag in hand and score points for his team. Defensively he can heal wounded teammates and use the same effects on attacking enemies as he would if he were attacking the enemy!\n\nScout – Concussion grenades, caltrops (floor spikes), nail gun\nExtremely fast\nOffensive. Uses all mechanics to attack and capture flags and objectives. Uses concussion grenades like the medic only to even greater effect in combination with his amazing speed!\n\nThis basic overview will give you enough information to get an idea about how to use each class and their potential!", "timestamp_created": 1521053346, "timestamp_updated": 1521053346, "voted_up": true, "votes_up": 67, "votes_funny": 2, "weighted_vote_score": "0.849228978157043457", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17138665": {"recommendationid": "17138665", "author": {"steamid": "76561198092717711", "num_games_owned": 110, "num_reviews": 8, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1485889449}, "language": "english", "review": "Team Fortress Classic has nothing to do with Team Fortress 2. They are completely different games with different mechanics, although the classes seem similar.\n\nGeneral:\n-TFC has grenades.\n-Classes also have armor.\n-Health Pool is different.\n-Bhop is possible.\n-While in TF2, the best gamemodes are Control Points, King of the Hill and Payload, in TFC it is actually Capture the Flag.\n\nScout:\n-In TFC, he is used for his speed to cap the flag, rarely fights.\n-No double jump. Concussion grenades are used and they are way more powerful.\n-No Scattergun, has only a weak shotgun and a Nailgun used against sentries.\n\nSoldier:\n-Soldier has normal grenades and nail grenades - which shoot nails in 360 degrees and deal damage.\n-Has a normal weak shotgun and a more powerful one.\n\nPyro:\n-No airblast.\n-Flamethrower deals damage depending on the amount of armor the victim has.\n-Has an Incendiary Cannon which acts as a Rocket Launcher, but sets enemies on fire.\n-Has normal grenades and Napalm grenades - which set enemies on fire.\n\nDemoman:\n-No Stickybomb Launcher, replaced by the Pipebomb Launcher. Pipebombs don't stick to surface.\n-The Grenade and Pipebomb Launcher share the same ammo pool.\n-Has a single-barrel shotgun.\n-Has a detpack which has the ability to clear obstacles and open new entrances.\n-Has normal grenades and MIRV ones - they split into smaller grenades which explode.\n\nHeavy:\n-Has 2 shotguns.\n-Also has MIRV grenades.\n\nEngineer:\n-Cannot pick-up buildings.\n-Has powerful EMP grenades which blow up the enemy's ammo and cause damage.\n\nMedic:\n-Medic is also used for capping flags because of his speed and concussion jumping ability, but is more powerful than Scout.\n-Can infect classes with his medpack.\n-No Medigun therefore no Ubercharge.\n-His super nailgun is good against sentry guns.\n\nSniper:\n-Basically TF2 sniper with the Classic and grenades.\n\nSpy:\n-Has a Tranquilizer Gun.\n-Has a shotgun.\n-Can feign death. \n-Has Hallucination Grenades.\n\nCivillian is the last class which is used in special gamemodes.\n\nTeams are pit against each other where Red uses defensive classes to protect their flag from Blue, which use mainly Scouts and Medics to capture it.\n\nThe community is very small and there are only a couple of servers at a time, but the game is a classic and I recommend it.", "timestamp_created": 1437390503, "timestamp_updated": 1450610358, "voted_up": true, "votes_up": 315, "votes_funny": 35, "weighted_vote_score": "0.877474486827850342", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "45035761": {"recommendationid": "45035761", "author": {"steamid": "76561197963654620", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 201288, "playtime_last_two_weeks": 6116, "last_played": 1551857192}, "language": "english", "review": "I'm gonna have to play a few more hours to be sure, but it seems okay.", "timestamp_created": 1538376906, "timestamp_updated": 1538376906, "voted_up": true, "votes_up": 37, "votes_funny": 127, "weighted_vote_score": "0.807619273662567139", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21196502": {"recommendationid": "21196502", "author": {"steamid": "76561197986297256", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 391090, "playtime_last_two_weeks": 43, "last_played": 1551833489}, "language": "english", "review": "Been a fun game for many years.  Players come and go.  And one day I will go too.  Until then.  I'm playing hard.", "timestamp_created": 1455421267, "timestamp_updated": 1455421267, "voted_up": true, "votes_up": 70, "votes_funny": 25, "weighted_vote_score": "0.83596724271774292", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17111863": {"recommendationid": "17111863", "author": {"steamid": "76561198023464703", "num_games_owned": 255, "num_reviews": 6, "playtime_forever": 3291, "playtime_last_two_weeks": 0, "last_played": 1404409937}, "language": "english", "review": "I shot someone in the foot with a sniper rifle and got a headshot.", "timestamp_created": 1437245231, "timestamp_updated": 1437245231, "voted_up": true, "votes_up": 310, "votes_funny": 1219, "weighted_vote_score": "0.872717797756195068", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21281272": {"recommendationid": "21281272", "author": {"steamid": "76561197962263731", "num_games_owned": 92, "num_reviews": 9, "playtime_forever": 729249, "playtime_last_two_weeks": 145, "last_played": 1550897166}, "language": "english", "review": "Let me be honest right up front. This is for new and potentially new players. Vets of the game already know why TFC is still for sale, and not F2P like it's \"decendent\". \n\nTFC is a game I've been playing for over 15 years. It is, without a doubt, the most FUN game in my library. \n\nYou have the same 9 classes as TF2, however, with many differences. The Spy can't turn invisible, but can \"feign death\". Be careful with this ability, as it's not impossible to spot a Spy trying to pull their tricks.\n\nGrenades! TFC has grenades, and lots of them! Every class(except Sniper) has a class specific secondary grenade. All classes(except Scout) have your normal issue \"Frag\" grenade. Using these grenades can help you either kill an enemy, or assist your movements. \n\nWhen you first begin playing, you WILL get your butt handed to you. A lot. This is normal, and all TFC players have been through it. Don't let that deter you. The game engine has lots of nuances for you to learn, but it takes time. Really, it takes lots of time to learn, but many players are willing to teach you. All you have to do is ask. \n\nYou may encounter players who have forgotten what it's like to be new to the game. Ignore them, or mute them. I may not be the best TFC player around, but I'm a team player, and I don't mind teaching what I know. Feel free to friend me, and just ask.\n\nDon't expect \"Hats\". TFC is a game where tactics and skill are utilized, we don't need no stinking Hats. ;)\n\nEdit: One more thing I'd like to add...\n\nWhile I'm not the best player ever at the game, I do know lots of tricks, and skills. If anyone would like me to teach  you some of what I know, feel free to add me as a friend on Steam, and just ask. New players will keep this game alive for another 17 years, and if I can help you along to enjoy the game more, I'm quite happy to help.\n\nEdit 11/23/17:\n\nAnother sale comes, and along with it, many new players. With that in mind, I'm editing my review to be even more helpful.\n\n\"Beginners\" classes: Many new players choose the HW-Guy because of his strong health and armour. However, the class is the slowest in the game and the \"chain gun\" takes a second to \"spin up\", leaving you vulnerable to attack. Players with experience can evade your fire and kill you if no one interferes. With that in mind, I recommend NOT choosing that class.\n\nHere are general class desciptions, along with a rating for ease of learning basic skills:\n\nSoldier: I recommend this class to new players, as he has a good mix of speed(on the slower side, but still nimble for combat), strong weapons(Rocket Launcher and Super Shotgun), and good health/armour combination. Soldier is strong enough to utilize \"Rocket Jumping\", \"Grenade Jumping\", and the all important \"Combo(rocket/nade) Jumping\". His secondary grenade(Nail Grenade) is perfect for taking down enemy Sentry Guns, and cutting off a choke point for several seconds. Given the \"Splash Damage\" effect of rockets, I recommend this class for new players, as you don't have to actually HIT your target to damage/kill them.\n\nDemolitions Man: Another well balanced class for combat. Like the Soldier, you don't need to actually HIT your target to do damage. However, the downside to this is that your pipes bounce the way physics actually work. Blue pipes explode either when they hit a target, or after a few seconds. Green pipes, however, can be spread into a \"trap\", and detonated by the player. They will eventually explode if you don't detonate them, but that's after a few minutes of inactivity, or if you try to spread more than 8. The Demoman also carries a \"Detpack\". A heavy explosive that can be set for either 5 seconds, 20 seconds, or 50 second timers(bind a key to +det5/20/50, depending on how long you want it to sit before exploding). It takes a few seconds to set, during which you are vulnerable to attack. However, once set, only an EMP grenade from an Engineer can set it off prematurely, or it can be disarmed by a Scout. One skill that you can easily learn is \"pipe jumping\", whereby you place one or two pipes on the ground, run and jump over them, and detonate them. You will take some damage, but it's a great movement tool. The Demoman also carries your standard \"Frag\" grenade, and also the \"MIRV\" grenade(very high damage). \n\nEngineer: Engineers(Medium-Light class) can build Ammo/Armour dispensers, Teleporters, and Sentry Guns. His best combat weapon is the Super Shotgun. Sentry Guns are built at level 1, and can be upgraded to level 2 and 3. Sentry Guns are used primarilly for Defensive purposes, but can also be placed in enemy territory for a surprise. Sentry Guns can not detect disguised Spies, and are vulnerable to grenades and Nail Guns. An Engineer can also repair buildables, and team mates armour with their wrench(spanner). \n\nCombat Medic: The Medic is a light class, and probably the best class used for carrying/capturing flags. He's a speedy class, with light armour and health. However, the Medic regenerates his own health slowly but can use his Med-Kit to heal team mates instantly, and even give them a temporary \"boost\" of health above 100%. His best weapon for combat is the Super Shotgun. Aside from healing team mates, his Med-Kit can be used to \"infect\" enemy players. Infection can NOT be cured by health kits in resupply areas. Only another Medic can heal the infection, which will spread to team mates if they get too close to an infected team mate. Along with his primary \"Frag\" grenade, the Medic also carries the Concussion Grenade. This secondary grenade serves two very different purposes. It can be used either to give an enemy player a \"concussion\"(makes their screen spin for a few seconds), or as a movement tool. The Conc grenade can propel you very far, very fast. Combined with \"air strafing\", you can often evade enemy fire once you learn the mechanics of it.  Medic can be learned easily enough, but only practice will make you \"good\" at the movement skills. \n\nSpy: The Spy can disguise himself as any class of either his own team, or the enemy team. He carries enough health and armour to be able to use Frag grenades for a movement/jump boost, but it will cost pretty heavily. Once you learn the nuances of proper infiltration, this class can be used to rip an enemy's defenses to shreads. His primary combat weapons are the Super Shotgun and the Knife. The Knife can be used to \"Backstab\" an enemy for a 1-hit kill(takes practice). Along with the standard Frag grenade, the Spy carries up to 4 \"Gas\" grenades. These secondary grenades will cause an enemy player to halucinate, and disorient them. The Spy also carries a \"Tranquilizer\" gun(takes a LOT of practice to become proficient at). If  you hit an enemy with a Tranq dart, they will move very slowly, but it will also reveal you from being disguised. Another \"trick\" the Spy has, is the ability to Feign death. This can be done either loudly(lets out a \"death\" yell) or silently. Once feigned, a Spy can watch the area around him, wait for an enemy player to pass by, stop feigning, and knife them from behind. It is important to note that firing ANY weapon will reveal you. You can also lose your disguise if you're touched by an enemy Scout. Throwing grenades does NOT reveal your disguise.\n\nSniper: Sniper is another \"high skill\" class. Primary weapon is the Sniper Rifle(which also has an \"auto-fire\" version. The Sniper only carries Frag grenades, and has no secondary. In close combat, the Sniper is easily outmatched. From a distance, a fully charged shot can \"one-hit\" kill any class with a headshot. Sniper carries light-medium armour, and one Frag grenade can kill him. I do NOT recommend this class for new players.\n\n(See comments for the rest. I'm filled the buffer.)", "timestamp_created": 1455738569, "timestamp_updated": 1511454448, "voted_up": true, "votes_up": 76, "votes_funny": 16, "weighted_vote_score": "0.835703194141387939", "comment_count": 13, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48373237": {"recommendationid": "48373237", "author": {"steamid": "76561197984940983", "num_games_owned": 32, "num_reviews": 3, "playtime_forever": 92949, "playtime_last_two_weeks": 0, "last_played": 1547669999}, "language": "english", "review": "This was the best team shooter game ever made. It sucked up about 6 years of my life. It was that good. The only drawback is that it needs other human players to still be fun.  Team Fortress 2 killed its user base. As of 1/16/19, there are only 3 servers left with enough humans players on them to make the game still any fun. But all these servers have issues. Drippys 2fort is a one-map wonder, and the server owner is a ban freak.  The EVIL Battlezone server has too many map rotations that keep it from being fun and the humans leave after the map changes. Lastly, there is a Human vs Bot server that gets pretty boring.  So there just aren't any more servers or humans left for this game to be played the way it was intended and the way it used to be played before 2007.  This game should be given away for free now due to the lack of regular players.", "timestamp_created": 1547677794, "timestamp_updated": 1547677794, "voted_up": true, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.78936690092086792", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13677779": {"recommendationid": "13677779", "author": {"steamid": "76561198089072774", "num_games_owned": 28, "num_reviews": 7, "playtime_forever": 20883, "playtime_last_two_weeks": 0, "last_played": 1427036320}, "language": "english", "review": "This is an amazing game. You just have to know that if you treat it like Team Fortress 2, you're gonna have a bad time! This game is significantly different than Team Fortress 2. It has a more competitive, fast-paced feeling where people try to work together to complete the objective. If you're used to Team Fortress 2, you have to know some differences before you get in game, get your ass wooped then go to write a negative review about this. \n\nScouts are not designed for combat and are just for completing the objective. Getting a single kill as a scout is hard to do.  I personally like this scout concept over the Team Fortress 2 one. The people that still want a fast combat class in the game, don't worry! There's still a class for that. Recently, Team Fortress 2 got a new rifle called the 'Classic'. If you know how that works, you can grasp the concept of the classic sniper pretty well. Although, the TFC sniper does not suck as much as the classic. Soldier is the same except he has two shotguns. On the topic of shotguns, there are two of them. A double-barreled one that does more damage yet a slower fire rate and a slower reload and a single-barreled one that does more damage yet a faster fire rate and a faster reload. Shotguns in this game have no fall-off.\n\nDemoman is pretty similar. Your pipebomb launcher is your stickybomb launcher as Team Fortress 2 players are used to. Except the pipeboms do not stick. You have a single-barreled shotgun and you can place an instakill detpack that explodes in 5, 20, 50 seconds. The detpack can also be used to open entrances. Medic is the most changed class. Medic is for combat, healing, and capturing objectives. Your medkit can infect enemies and you have two shotguns. You also have a conc grenade that you can use to conc jump which we'll go over later. HWGuy has the same difference as soldier. You still have a minigun, but you have two shotguns.\n\nPyro is weaker than his Team Fortress 2 counterpart. Your main job is to confuse and it is not to wreck. You have an incendiary RPG and you cannot airblast. Spy is the second most different when compared to his Team Fortress 2 counterpart. You have a double-barreled shotgun, a pistol that slows enemies down, and a nailgun. You can disguise still and you can do a crappy feign death that makes you turn into a corpse. No one falls for it and it doesn't even show up in the killfeed. It's good for hiding yet it sucks for tricking. YES BACKSTABS STILL EXIST. Engineer is pretty similar. You cannot upgrade dispensers and teleporters, but you can upgrade sentry guns. Sentry guns can be upgraded in 1 hit as long as you have 130 cells (metal). You also have a weak railgun that's more for finishing off rather than taking on a full health target. Dispensers only give armor and ammo, but no health.\n\nGeneral Differences: \n\nThere are grenades. Grenades. Every Team Fortress Classic class has a frag grenade (except scout), and a special grenade. Scout has two special grenades.\n\nMovement is a lot more intricate. You can jump with grenades and bunnyhop. \n\nThere are more gamemodes and maps.\n\nOn flag capturing maps, you don't take the flag back to your flag and you take it to somewhere else.\n\nThere is armor.", "timestamp_created": 1419813882, "timestamp_updated": 1419813882, "voted_up": true, "votes_up": 48, "votes_funny": 12, "weighted_vote_score": "0.809430241584777832", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42378737": {"recommendationid": "42378737", "author": {"steamid": "76561198435723663", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 30475, "playtime_last_two_weeks": 0, "last_played": 1535078926}, "language": "english", "review": "[b]INTRODUCTION[/b]\nThis is Team Fortress Classic (TFC). Where do I even begin? This game is absolutely legendary. Most Team Fortress 2 players will look at this at first glance and be under the assumption that this game is nothing more than an abandoned predecessor that has nothing to offer over its popular, beloved sequel, but anyone who assumes such a thing would be very misunderstood as they'd be unaware of the strong legacy that this game holds. TFC is a one-of-a-kind game. In fact, it can even be described as the first of its kind, but in order for anyone to interpret what I mean by that, I must first get into some history. Before there was TFC, there was Quake, and what was significant about Quake is that the game came with the aspect of inventive modding capability as well as a multiplayer form of play. Three individuals by the name of Robin Walker, John Cook, and Ian Caughley used these two features as an opportunity to mold together a mod called Team Fortress (TF). This is where it all began.\n\n[b]GAMEPLAY MECHANICS[/b]\nTFC typically revolved around combat between two teams, a red team and a blue team. Most forms of play in TFC focused on a specific objective that was usually flag-based, with capture the flag being the dominating gamemode. TFC, like many other games of its time, is a highly fast-paced game which is why it incorporated instant respawning as one of its more prominent features. One of TFC's most substantial elements was the inclusion of different types of ammunition and armor. The different types of ammo consisted of shells, nails, rockets, and cells, and players had the ability to throw unneeded ammo to teammates. There were three types of armor: light, medium, and heavy. Light classes such as the scout and sniper were equipped with light armor while heavier classes such as the heavy weapons guy and soldier were equipped with heavy armor, and all the classes in between those four were equipped with medium armor. \n\nIn TFC, there are four major game modes: capture the flag, command point, assassination/escort, and deathmatch. There is a wide variety of playable maps that all represent each of these gamemodes, with some being official and some being community-made. The most popular map in TF history would be 2 Fortresses, better known as 2fort. It is a capture the flag map, meaning the objective was to penetrate enemy defenses, grab the enemy flag, and bring it back to your capture point. There were several variants of capture the flag maps such as reverse capture the flag, where the objective was to bring the enemy flag to their own base, football mode, where there was a neutral ball in the center that needed to be captured by one of the teams, and other variants of the mode that are best represented by maps like Rock 2. Command point mode consists of two variants, standard and attack and defend. In standard mode, the objective is to capture 5 different command points across the map. In attack and defend mode, the teams are split into offense and defense, and the offensive team must bring their flag to the enemy command points and it is the job of the defending team to prevent them from doing so. Assassination/escort mode is represented by one map and features the civilian class. In assassination/escort mode, a team entirely composed of snipers had the objective of taking out the civilian while a group of bodyguards had the job of defending the civilian and escorting him to a van at the end of the map. Last of all, there was deathmatch which included two extra teams, green and yellow. The objective of deathmatch was simply to frag.\n\nOne of the core elements of TFC's gameplay was the collection of 9 playable combat classes the game had to offer. This included the scout, the sniper, the soldier, the demoman, the medic, the heavy weapons guy, the pyro, the spy, and the engineer. The scout is the weakest class in terms of both weaponry (nailgun, shotgun, and crowbar) and armor, but ran so much faster than all of the other classes in the game, making him the best for completing objectives like capturing the flag. Scouts would use their concussion grenades to jump across the map and disorient enemies and their caltrops to slow them down. Snipers were equipped with high-powered sniper rifles capable of dealing locational damage (headshots) as well as a fully automatic mode for their rifle to help them engage enemies in close quarters. They made use of hand grenades as well. The soldier is the most well-rounded class in the game but moved much slower than many other classes. His primary weapon is a rocket launcher, and he also had a super shotgun as a sidearm and nail grenades as a custom grenade. \n\nThe demoman's main weapon is the grenade launcher which could be fired in two modes: grenade mode (explode on contact) and pipebomb mode (detonate at will). The demoman also carried a detpack for opening pathways on certain maps and the very powerful MIRV grenade. The medic is heavily favored for offensive gameplay because of his super nailgun, super shotgun, concussion grenades, and medikit which could spread a contagious infection and heal teammates. The heavy weapons guy is capable of sustaining more damage than any other class and carries a very powerful automatic gun known as the assault cannon, but he also moves much slower than every other class in the game. \n\nThe pyro's signature weapon is the flamethrower which has a large ammunition reserve and could ignite enemies. Alongside the flamethrower, the pyro carried an incendiary rocket launcher and napalm grenades which could be used in combination with the flamethrower to stack the damage-over-time effect. The spy in TFC's primary ability was the ability to disguise as any class on either team. The spy can kill players with a single hit by stabbing them in the back with his deadly knife and slowing enemies down by firing at them with his tranquilizer gun. The spy also spawned with hallucinogenic grenades which spout gas and confuse enemies with hallucinations. The engineer is the final class of TFC who held the ability to build certain devices to assist the team, especially on defense. The most important of these was his automatic turret, the sentry gun which could be upgraded twice. He could also build ammunition dispensers and teleportation devices and has deadly EMP grenades which detonated explosive ammunition.\n\n[b]CONCLUDING STATEMENTS AND RATING[/b]\nTF introduced so many solid concepts never before seen in shooters. Its most notable idea was the implementation of classes who all had fixed loadouts. There were also several exploits and bugs that the developers of TF decided to use as an opportunity to incorporate new gameplay components. For example, rocket jumping and bunnyhopping were initially bugs detected through the game and were not intended to be apart of the game itself, but the devs expressed approval for these ideas anyway.  Even the headshot, one of the most ubiquitous elements of many first person shooters you see today, was first implemented by the developers of TF. All of these ideas and concepts, many of which are very common in modern-day shooters, are the result of TFC, and that's why it's so special.  Combine this with the fact that TFC still incorporates many aspects of old-school shooters while sticking to what defined a new wave of shooters, and you can really say there's no other game like it. The legacy of this game actually makes me quite emotional especially when you consider the community that was built up. I wasn't even actively playing TFC in the 1999/early 2000's period, but I'm fully aware of what this game was like back in the day. The clans, the community-funded sites, the competitive scene of back in the day, and everything that made TFC seem so significant are still being greatly represented by the digital relics stored on the internet, and I'm thankful for that. TFC will always be my favorite game of all time.\n\n[b]FINAL RATING[/b]: 10/10", "timestamp_created": 1527668814, "timestamp_updated": 1527818148, "voted_up": true, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.775652706623077393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12851274": {"recommendationid": "12851274", "author": {"steamid": "76561198068104173", "num_games_owned": 150, "num_reviews": 49, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1463364600}, "language": "english", "review": "if we did not like this game number 2 would not exist", "timestamp_created": 1415483551, "timestamp_updated": 1415483551, "voted_up": true, "votes_up": 79, "votes_funny": 26, "weighted_vote_score": "0.822799980640411377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43726729": {"recommendationid": "43726729", "author": {"steamid": "76561198021373101", "num_games_owned": 180, "num_reviews": 11, "playtime_forever": 994, "playtime_last_two_weeks": 0, "last_played": 1532548358}, "language": "english", "review": "Spy has a shotgun \nPyro has a rocket launcher \n\n\n\n10/10", "timestamp_created": 1532481421, "timestamp_updated": 1532481421, "voted_up": true, "votes_up": 30, "votes_funny": 48, "weighted_vote_score": "0.756811678409576416", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42905058": {"recommendationid": "42905058", "author": {"steamid": "76561198253522335", "num_games_owned": 123, "num_reviews": 37, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1529601604}, "language": "english", "review": "---{Graphics}---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☑ Paint.exe\n\n---{Gameplay}---\n☐ GOTY\n☑ Very good\n☐ Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Starring at walls is better\n☐ Just don‘t\n\n---{Audio}---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Average Solitare Players\n\n---{PC Requirements}---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press 'A‘\n☐ Easy\n☐ Significant brain usage\n☐ Easy to learn / Hard to master\n☑ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if you care about leaderboards/ranks\n☑ Isnt necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You‘ll need a second life for grinding\n\n---{Story}---\n☑ If you want story, then go read a book.\n☐ Text or Audio floating around\n☐ Average depends an DLC\n☐ Good \n☐ Lovley\n☐ It‘ll replace your life \n\n---{Game Time}---\n☐ Long enough for a cup of tea\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{Price}---\n☐ There is no \"price“\n☑ Worth the price\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money \n\n---{Bugs}---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ Assassin‘s Creed: Unity\n☐ Get a bug spray. Or more. A lot more. Or maybe a flamethrower. Or a nuke.\n\n7/10", "timestamp_created": 1529595600, "timestamp_updated": 1529595600, "voted_up": true, "votes_up": 70, "votes_funny": 104, "weighted_vote_score": "0.795363962650299072", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23446664": {"recommendationid": "23446664", "author": {"steamid": "76561198079862586", "num_games_owned": 18, "num_reviews": 15, "playtime_forever": 12192, "playtime_last_two_weeks": 29, "last_played": 1551552782}, "language": "english", "review": "I played Team Fortress Classic for the first time in 2013, it wasnt my game, it was awful for me, couldn't stand a chance agaisnt scouts, I was really really bad at the game. But now,after 8 months of not playing it, I understand that this is a huge game with lots of things to do, and guess what? You need skill. How much skill? Lots, lots of skill, the first class I played as was as the Scout, it was fun to mess around and die in 1 hit by a direct rocket hit, hehe, but then I got serious in the game, started playing it like a competitive game, and then, I got good at it, I played lots of matches, some were versus bots and some with veterans, then, I started playing with the most ''useless'' classes that people think that are really bad and that people should never play with them, played as demoman, got a 4 kill streak once, played as pyro, killed the entire opposing team in a match, and they say that the game is dead, bad, unbalanced, not fun, not worth buying, those people are wrong, very very wrong, this game is worth all of your time and your money. Buy it, you will not regret this massively fast paced first person shooter. \n\n\nPlayer name: Johneehboi, you can find me playing on medium populated servers such as Twisted Dustbowl and some others. \n\nMany thanks to the Steam user ''Tom Fortress Classic'' for giving me this game as a gift, thank you very much.", "timestamp_created": 1465360946, "timestamp_updated": 1465360946, "voted_up": true, "votes_up": 41, "votes_funny": 3, "weighted_vote_score": "0.770590364933013916", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31350638": {"recommendationid": "31350638", "author": {"steamid": "76561198332581380", "num_games_owned": 83, "num_reviews": 16, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1493419903}, "language": "english", "review": "Good game.\n\nDead community.", "timestamp_created": 1493093615, "timestamp_updated": 1493093615, "voted_up": true, "votes_up": 29, "votes_funny": 9, "weighted_vote_score": "0.771390140056610107", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "14931467": {"recommendationid": "14931467", "author": {"steamid": "76561197991970056", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 128022, "playtime_last_two_weeks": 0, "last_played": 1539470704}, "language": "english", "review": "This is by far the most interesting game ever made.\nEven in 2015, with the outdated graphics, many people keep TFC alive and I am proudly part of them.\nKeep going !", "timestamp_created": 1426587518, "timestamp_updated": 1426587518, "voted_up": true, "votes_up": 165, "votes_funny": 39, "weighted_vote_score": "0.820629358291625977", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28243548": {"recommendationid": "28243548", "author": {"steamid": "76561197970739339", "num_games_owned": 472, "num_reviews": 390, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "It's TFC, baby. Wether you like TF2 or you're one of those diehards that prefered Fortress Forever, it all started... with the Quake mod, sure, but for me, it started here, in all it's bizarre, rocket-jumping, conc-jumping, double-shotguns-for-everybody-shooting, tranq-darting, overpowered-sentry-killing, \"Excuse me, I'm in need of medical attention\" getting, unbelievable-shitstorm-of-grenades-everywhere glory. Love it or hate it, it's an important title in the history of multiplayer FPS.", "timestamp_created": 1481148766, "timestamp_updated": 1481148766, "voted_up": true, "votes_up": 43, "votes_funny": 16, "weighted_vote_score": "0.768218159675598145", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47055448": {"recommendationid": "47055448", "author": {"steamid": "76561197961748565", "num_games_owned": 222, "num_reviews": 7, "playtime_forever": 202598, "playtime_last_two_weeks": 3, "last_played": 1551522859}, "language": "english", "review": "My favourite game, been playing it for 18 or 19 years and there are still things I have not or just cannot figure out. There's so much you can do in this game if you're willing to put some time and effort in it. The movement it has is just incredible and there's much to discover about this aspect of the game. The gameplay or the way it plays is unmatched. People who dislike this game simply do not understand what it is.", "timestamp_created": 1543249138, "timestamp_updated": 1543249138, "voted_up": true, "votes_up": 26, "votes_funny": 6, "weighted_vote_score": "0.735742807388305664", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "11300355": {"recommendationid": "11300355", "author": {"steamid": "76561198092755452", "num_games_owned": 272, "num_reviews": 15, "playtime_forever": 2503, "playtime_last_two_weeks": 0, "last_played": 1466674999}, "language": "english", "review": "You must try this game, who knows, maybe you will like it.\n\nThe game mechanics are somewhat different from the ones used by TF2, and I could explain most of them:\nAnd yes, I will try to compare this game's features with TF2's, assuming that most players are now coming from it.\n\n[b]Control point maps[/b]\nIn control point maps, instead of staying on a capture point until it gets claimed, you have to bring a flag on it. While this doesn't support much the teamwork strategy because everyone is like \"The flag is now mine, I am going to cap\",  some people play the right way and let the scout do the job while they offer covering fire.\n\nHowever, some maps like Dustbowl on the first stage are messed up, the RED team camping near the grenade backpack and spamming all the way until the round ends.\n\n[b]Capture the flag[/b]\nSame as you can see in TF2, that's how CTF acted in all team fortress stages, excepting that, unlike TF2, the place where you have to bring the flag is different from the place the enemy can find your flag, making this a bit confusing for new players.\n\nEven in this moment I bring the enemy flag to my team's flag in 2fort.\n\n[b]Escort[/b]\nA great gamemode, that in TF2 got brutally converted into payload. (there where alot of reasons I will explain later)\nIn this gamemode you will have to escort (AKA help a a guy reach a place alive) a class called \"Civillian\" (yes, TFC  has 10 classes).\nThe civillian features low stats, having only 50 health points, no armor, grenades or weapons other than an umbrella, which is a crowbar reskin.\n\nThere are 3 teams:\nThe escort- only the civillian available. Only 1 can play as the civilian in a game.\nThe bodyguards - the people who must escort the civillian to the destination. Only soldier, heavy and medics available.\nThe assasins - must prevent the civillian to reach the destination. Only playable as snipers.\n\nIn TF2, the escort mode was scrapped for multiple reasons, such as the fact it had too many limits.\nYou had class limits, being forced to play as medic, heavy and soldier as bodyguards and as sniper on the assasins.\nAlso, certain civillians were trolls, refusing to get out from the spawn or jumping in front of the enemy.\nNo more saying there could only be 1 civillian, releasing many flamewars between players.\n\nThen Valve made a similar gamemode, where you have to 'escort' a bomb cart by staying near it so you can 'push' it, while the other team prevents you for doing that.\n\n[b]Classes[/b]\n\n[b]The scout:[/b]\nUnlike in TF2, the scout was NOT made for agressive combat, not even for combat itself. It has a 'syringegun' called nailgun and a single-barrel shotgun.\nPlayers use the scout's speed and the conc-jump technique to quickly complete the objectives.\nUnfortunatelly, the scout has low health, being able to be killed by a single rocket, and lacks double jumping.\n\n[b]The soldier:[/b]\nThe soldier from TF2 seems to not have changed much.\nThe only differences between them is that the TFC soldier has 2 types of shotguns equipped at once and also has hand grenades.\n\n[b]The pyro:[/b]\nOh pyro... poor pyro, the class valve forgot to buff.\nYou basically have a flamethrower that shoots rapid-fire 'bubbles' of fire, that will never hit someone.\nAlso, the afterburn is only like 2 seconds and deals like 4 damage/tick.\nThe pyro also has a rocket launcher that does not need to be realoaded, but deals no damage at all and ignites the enemies that stay in range, but again, the aferburn is weak.\nYou also have a single barrel shotgun...\n\n[b]The demoman:[/b]\nA class you will rarely see played, same as in TF2.\nPeople don't know the air detonation technique, which is deadly in TFC.\n\nAs the demoman, you have a grenade launcher with a clip of 6 and a sticky launcher with also a clip of 6. They use the same ammo and clip, tough.\nThe demoamn also has a single-barrel shotgun, and the unique abbility to set a bomb that is able to open new routes on a map by removing certain walls.\n\n[b]Heavy weapons guy:[/b]\nThe heavy is more decent to play that in TF2, you have a plenty of health and armor, and a powerful MIRV granade that creates explosions similar to the Sentry buster from TF2.\n\nYou also have 2 shotguns types: The one-barrel and 2-barrel.\nYou cannot deploy your minigun without firing, so you will stay more in combat rather than camping near corners, like people do in TF2.\n\n[b]Engineer:[/b]\nThe engineer is quite weak compared to the TF2 one. I mean, you have a double barrel shotgun, which is very good, and a railgun, which is the worst weapon in the game due to the slow projectile and low damage.\n\nThe sentry upgrades instantly if you have enough 'metal' (called 'cells' in TFC) and is the only upgradable building.\nThe sentrygun cannot rotate, the engineer being forced to place the sentrygun in corners, or to rotate it manually.\n\nThe dispenser is not upgradable and does NOT generate ammo, health and metal, as it does in TF2, so the engineer has to fill it manually.\nAlso, the enemy can use your dispenser.\nYou will rarely see an engineer building a dispenser, unless they are really bored, because it does not heal, does not provide ammo unless filled with, and does not give metal, so players preffer to collect backpacks filled with goods at every corner.\nThe only good thing about dispensers is that they can repair armor (if filled).\n\nThe teleporter is not upgradable, but efficient.\n\nThe lack of hauling buildings and the addition of grenades in TFC makes it hard to be an engineer, trust me.\n\n[b]Medic:[/b]\nThe medic is actually an upgraded version of the scout, but not worth playing.\nThe lack of 'assist' in the kill feed and the fact that you don't get points for healing, will end up with you having 0 points even if you were an efficient medic that deserved #1 in TF2.\n\nWhat do I mean by upgraded scout?\nRemind scout's weapons? Nailgun and single barrel shotgun, also a crowbar.\nMedic's loadout? SUPER Nailgun, DOUBLE barrel shotgun and the medkit (as melee).\n\nThe medkit is the most overpowered weapon.\nWhy? once hitting an enemy with it, it will become infected, causing his health to drain constantly until dies or healed by a medic. Also, the infection can be spread trough teammates... darn it valve.\n\nAlso, the medic is designed more for combat, and healing teammates that are hiding, because you cannot heal while you or your teammate move.\n\nThe sniper:\nRemember the sniper rifle in TF2 called \"the Classic\"?\nUse it to see how being a sniper is like in TFC.\n\nThe spy:\nThe spy, a kinda broken class, has a tranquilizer gun that slows down enemies, a double barrel shotgun and a knife.\nThe stupid thing about the spy is that the disguise takes about 5 bloody seconds (while just like 2 in TF2) and you have no cloak feature.\nHowever, the lack of spychecking weapons other than the medic's medkit, may do the job.\nYou can feign death, but you have to stay down, as a random dead body, and if you move, you actually spin like a drunk hobo and suspicious players will shoot.\n\nThe backstab seems to be broken most of the time, resuting in failed facestabs.\nAdditionally, if an enemy scout or spy runs into you, your disguise is removed.\n\n\nOnly things I don't like on this game (along with the broken classes) are these:\n-Lack of resupply cabinets: If someone spawn camps you and you are hurt badly (or infected) you are forced to die.\n-Solid hitboxes: You cannot get past teammates as in TF2 and you cannot do the bump-spycheck.\n-All classes use the same voice, the only lines you will hear being \"Medic!\" and \"Excuse me, I'm in need of medical attention.\" thus making it hard to see which class is approaching.\n\n\nOn short, totally worth playing, and if you are bored you can try the FUN servers (which are better than the TF2 ones because the civillian class is used alot in them), and if you totally suck like me, you can enjoy playing singleplayer with bots.\n\n+8/10", "timestamp_created": 1405672612, "timestamp_updated": 1407696818, "voted_up": true, "votes_up": 56, "votes_funny": 1, "weighted_vote_score": "0.812309086322784424", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31305598": {"recommendationid": "31305598", "author": {"steamid": "76561198170641595", "num_games_owned": 292, "num_reviews": 67, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1496340685}, "language": "english", "review": "When you can't choose between playing TF2 and Half-Life.", "timestamp_created": 1492893871, "timestamp_updated": 1492893871, "voted_up": true, "votes_up": 25, "votes_funny": 24, "weighted_vote_score": "0.747862577438354492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "47793104": {"recommendationid": "47793104", "author": {"steamid": "76561197989445803", "num_games_owned": 172, "num_reviews": 2, "playtime_forever": 549, "playtime_last_two_weeks": 0, "last_played": 1539478420}, "language": "english", "review": "This game brought me into online gaming. Pre steam days, valve was just valve, and I got disconnected when my mom picked up the phone without checking with me first. ~RECONNECT\n\nThis game, 2fort, and dustbowl, will always hold a special place in my heart.", "timestamp_created": 1545699509, "timestamp_updated": 1545699509, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.731707274913787842", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "8861642": {"recommendationid": "8861642", "author": {"steamid": "76561198045381877", "num_games_owned": 257, "num_reviews": 1999, "playtime_forever": 468, "playtime_last_two_weeks": 0, "last_played": 1390953512}, "language": "english", "review": "Team Fortress Classic is not at all what I was expecting when I launched it for the first time. I went in assuming I was going to be playing an old school downgrade of Team Fortress 2. I was wrong, TFC is in its own rights a completely different game at first glance. The story, the graphics, and even the controls feel different, but if you play it long enough you will come to find that the game is Team Fortress at its core. The game itself has all the Team Fortress 2 \"DNA\" in there you just dont quite see it at first. If you play a while you will not only feel the Team Fortress-ness in the game (its the original Team Fortress so obviously) But you will get to see where the masterpiece that is Team Fortress 2 comes from, you get to see its \"roots\" so to speak. That in and of itself should be reason enough to play, but If I have not convinced you yet here is another reason, the best reason to play as a matter of fact. Team Fortress Classic is fun!", "timestamp_created": 1390772777, "timestamp_updated": 1402212588, "voted_up": true, "votes_up": 161, "votes_funny": 0, "weighted_vote_score": "0.795009911060333252", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44229501": {"recommendationid": "44229501", "author": {"steamid": "76561197961665709", "num_games_owned": 117, "num_reviews": 11, "playtime_forever": 8516, "playtime_last_two_weeks": 0, "last_played": 1534598445}, "language": "english", "review": "Old school", "timestamp_created": 1534598550, "timestamp_updated": 1534598550, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.704315245151519775", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29582278": {"recommendationid": "29582278", "author": {"steamid": "76561198215020869", "num_games_owned": 68, "num_reviews": 9, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1502326856}, "language": "english", "review": "I remember when I was younger this was the one game that my dad would always play. He was always a Sniper or a Soldier. The servers he played on mostly consisted of his friends.\n\nFast forward a decade later. I finally get this game along with the Valve Complete Pack for Christmas. I go in, and well, not surprised to see how many servers are open and the most I can ever find is 10 people in just one. But goddamn, the nostalgia. That booming voice, the triumphant music, the grenades... All sounds just spamming together into one huge orgy that even porn websites can't compete with.\n\nThe game is really fun, has mechanics so different from Team Fortress 2, that it will be confusing for those who only play its sequel. Grenades are so fun to mess around with until you throw one at yourself. I suggest actually finding a server to practice with each class and all features that each class has, and obviously, must read what the default key binds are. You don't want to be spending 4 minutes trying to find the grenade button or the Medic button.\n\nI recommend new players or curious TF2 players to try this. But don't think just because you're good at other shooting games or good at TF2, that you're gonna do well in this. Oh, and also:\n\nYOUR TEAM CAPTURED. THE FLAG.", "timestamp_created": 1485769775, "timestamp_updated": 1485769775, "voted_up": true, "votes_up": 31, "votes_funny": 10, "weighted_vote_score": "0.749295294284820557", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42627159": {"recommendationid": "42627159", "author": {"steamid": "76561198124224005", "num_games_owned": 124, "num_reviews": 28, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1529134349}, "language": "english", "review": "Spy has shotgun.Best game 10/10", "timestamp_created": 1528632783, "timestamp_updated": 1528632783, "voted_up": true, "votes_up": 35, "votes_funny": 41, "weighted_vote_score": "0.744469225406646729", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16319665": {"recommendationid": "16319665", "author": {"steamid": "76561198147868601", "num_games_owned": 254, "num_reviews": 23, "playtime_forever": 1169, "playtime_last_two_weeks": 0, "last_played": 1518900630}, "language": "english", "review": "A perspective from a 500 hour TF2 player: \n\nThis game is interesting. That's the word I would use to describe it. It hasn't aged the greatest, though.\n\nStory: Doesn't need one.\nGraphics: Quite good for 1999, Actually. The textures are bland, but quite detailed for when this was made. \nGameplay: It appears TF2 significantly streamlined the experince. The gameplay isn't bad at all, but it's very unintivutive.\nGrenades: It has. \n\nOverall. you have to appreciate it as a product of it's time. I would give it a 8/10.", "timestamp_created": 1434078024, "timestamp_updated": 1434078024, "voted_up": true, "votes_up": 74, "votes_funny": 14, "weighted_vote_score": "0.74746173620223999", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26402263": {"recommendationid": "26402263", "author": {"steamid": "76561198176417930", "num_games_owned": 43, "num_reviews": 5, "playtime_forever": 318, "playtime_last_two_weeks": 0, "last_played": 1497032249}, "language": "english", "review": "No kids\n\nChill af\n\nGonna b hard to convert from TF2 to TFC \n\nIf the graphics annoy u then download tf forever \n\nJust buy it", "timestamp_created": 1478192735, "timestamp_updated": 1478192735, "voted_up": true, "votes_up": 25, "votes_funny": 4, "weighted_vote_score": "0.736012935638427734", "comment_count": 5, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "34134601": {"recommendationid": "34134601", "author": {"steamid": "76561198077721610", "num_games_owned": 91, "num_reviews": 31, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1538766345}, "language": "english", "review": "Team Fortress 2 is F2P, why not this one as well?", "timestamp_created": 1502318218, "timestamp_updated": 1502318218, "voted_up": true, "votes_up": 29, "votes_funny": 6, "weighted_vote_score": "0.742706239223480225", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32779681": {"recommendationid": "32779681", "author": {"steamid": "76561198370138662", "num_games_owned": 85, "num_reviews": 5, "playtime_forever": 670, "playtime_last_two_weeks": 0, "last_played": 1503532326}, "language": "english", "review": "Talk about a throw-back.  While not quite the Grand-Dadddy of team based shooters, it is a recreation of the Grand-Daddy of team based shooters.  To think that this reincarnation of the game is almost two decades old is amazing.\n\nThis game comes from an age of abstract level design, lag, and ridiculously fast paced action.  With different maps being designed for different team based games.  But, possibly the most popular of all time was Team Capture The Flag, and most likely on the map 2Fort (or if you were a Quake gamer, 2Fort5).\n\nYounger gamers may have a little trouble adapting to the old-school style of online battle...Strafe Shooting and Rocket Jumping, all while piles of Gibs expload all around you. But the fact that almost 20 years later this game is still actively played online gives testament to the amount of fun to be had while playing.  If you want to know what the average gamer spent his entire summer, and every night, playing back in 1999...until he passed out from exhaustion, this is it (or possibly the original Team Fortress).\n\nFor the Older Gamers who wonder whether this is still worth downloading.  As of 25 June, 2017, there were about 6 dozen servers available, with about a dozen of them heavily populated.  I played nonstop in a packed server for 4 hours in one sitting before my old age got the best of me.  If you are looking to play a game you grew up with and loved, this is still a valid option.", "timestamp_created": 1498409552, "timestamp_updated": 1498409552, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.692511022090911865", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30027055": {"recommendationid": "30027055", "author": {"steamid": "76561198112217077", "num_games_owned": 142, "num_reviews": 11, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1450918660}, "language": "english", "review": "tf2 without the hats", "timestamp_created": 1487486170, "timestamp_updated": 1487486170, "voted_up": true, "votes_up": 35, "votes_funny": 27, "weighted_vote_score": "0.747005581855773926", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "47165062": {"recommendationid": "47165062", "author": {"steamid": "76561198202441820", "num_games_owned": 38, "num_reviews": 6, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1547871484}, "language": "english", "review": "The medic has a shotgun.......10/10", "timestamp_created": 1543410306, "timestamp_updated": 1543410306, "voted_up": true, "votes_up": 15, "votes_funny": 21, "weighted_vote_score": "0.670990228652954102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39887328": {"recommendationid": "39887328", "author": {"steamid": "76561198798941808", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1516386297}, "language": "english", "review": "Servers are too empty", "timestamp_created": 1517923849, "timestamp_updated": 1517923849, "voted_up": true, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.66841435432434082", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23596595": {"recommendationid": "23596595", "author": {"steamid": "76561198007202312", "num_games_owned": 49, "num_reviews": 1, "playtime_forever": 193326, "playtime_last_two_weeks": 0, "last_played": 1550310332}, "language": "english", "review": "its a fun game", "timestamp_created": 1466086158, "timestamp_updated": 1466086158, "voted_up": true, "votes_up": 43, "votes_funny": 26, "weighted_vote_score": "0.737470746040344238", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32245380": {"recommendationid": "32245380", "author": {"steamid": "76561198081862874", "num_games_owned": 178, "num_reviews": 170, "playtime_forever": 1507, "playtime_last_two_weeks": 0, "last_played": 1497059232}, "language": "english", "review": "Team Fortress Classic Review – Raymond KT\n\nSummary: One of the most popular online action games of all time, Team Fortress Classic features over nine character classes -- from Medic to Spy to Demolition Man -- enlisted in a unique style of online team warfare. Each character class possesses unique weapons, items, and abilities, as teams compete online in a variety of game play modes\n\nTo me, Team Fortress Classic was unfairly dumped in a bin called “a team-based multiplayer shooter like Counter-Strike only messy and guff.” As I say, I know that’s an unfair comparison, but I stand by thinking the game messy. I never ever joined a Team Fortress Classic server and had a pleasant experience. It was always chaotic; it was always full of conc-jumping wunderkids; I always seemed to pick a class that felt useless; its maps always seemed to result in stalemates around single, narrow chokepoints. I never had fun. Or, well, that’s not true. There was one thing I liked about the game: feign death. The ability to at any point press a button and pretend to be a corpse. Most players would be wise to the trick and would shoot you as you lay prone on the ground, but occasionally you’d experience the wonderful thrill of watching a player walk by you unknowingly. I think I only managed to use that scenario to my advantage a few times, but it was worth it each time. A preview of what the Spy brought as a matter of course to Team Fortress 2. Before you take to the comments to lambast me: I can appreciate that Team Fortress Classic had a lot going for it. I think maybe if I’d been in a clan then I’d have liked it. Sing its praises in the comments if you feel like it. Team Fortress Classic is awesome. There are many different game types you can play on it. You can play a game with two teams where you have to capture the flag. You can play a game where you have to hunt a important person, or you can be one of the people protecting him. There are also games where both teams consist of only snipers. You do need to have the Internet to play the game, but if you are reading this review, then you already have the Internet. This game is worth playing because once you start playing, you can pick it up really easy. If you like team-play and shooting games this is for you. For being an older game TFC (Team Fortress Classic) has very nice graphics. The levels look really good and have been put together very nicely. The teams are easily distinguishable due to their obvious red and blue colors. The guns all look god and most are based of real weaponry, they are tru to form. TFC has everything Counter-Strike(CS) has but even more. The mission of the game is to attack or defend a fort (depending on which team you are). If you are on the attack team you must do your best to invade the fort with your flag. This is no easy task though as the defending team gets high powered weaponry to defend their fort with. Using your skill you need to infiltrate the base through secret passageways or just blasting in the front door guns blazing. The movement is extremely fast, but not out of control, which make the game much more fun and easier t move around without getting blown to pieces. This is purely a multiplayer game so there is a ton of replay value. Just keep playing rounds to improve your skill or play on the different team for some variety, or even try a different type of soldier to be! There is plenty of possibilities.\n", "timestamp_created": 1496866025, "timestamp_updated": 1496866025, "voted_up": true, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.700452148914337158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12915617": {"recommendationid": "12915617", "author": {"steamid": "76561197997504576", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 392376, "playtime_last_two_weeks": 1558, "last_played": 1551842939}, "language": "english", "review": "13 Years later still the ONLY FPS game on PC that I can actually play for more than 5 mins at a time.  In fact I can play for days at a time.  The speed, control, strategy and overal logic this game uses is pure beauty.  Although it blatantly breaks nearly every realistic law of physics known to man kind, it still easily trumps all of the zombie filled, fantasy land, role-playing nonsense this next generation has grown to obsess over.  It makes no sense how fun and enjoyable this game STILL is, regardless of it being ''dead'' and bereft of nearly all organized play (outside off all of the low-lifes wasting everyones time using Perfect Player packages in the pickups ofc).  You may need to be born before 1990 or so to truly grasp the awesomeness of this game, but if you do, kudos and thank you for playing.  Nuff said.\n\nrufi0", "timestamp_created": 1415825067, "timestamp_updated": 1415825067, "voted_up": true, "votes_up": 201, "votes_funny": 33, "weighted_vote_score": "0.782879412174224854", "comment_count": 28, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9467750": {"recommendationid": "9467750", "author": {"steamid": "76561198024595988", "num_games_owned": 107, "num_reviews": 7, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1444547005}, "language": "english", "review": "I saw this game a while back when my dad played it a lot and got to try it but i got my ass rekt too hard. It's hard to find players for it these days, but when you do it gets pretty fun. It takes a bit to get used to the game, especially if you're coming down from Team Fortress 2 to try this out. Conc jumping is one of the coolest things about this game among other stuff.\n\n*9000 RANDOM EXPLOSION NOISES GOING ON FOR LIKE 8 HOURS AND SOME GUY SCREAMING \"EXCUSE ME, I NEED SOME MEDICAL ATTENTION\"*\n\nFind a group for it on Steam like the TFC Revivers or something and jump in. As the son of a TFC player who is part of the TF2 generation, I can say we (The 2 gen) should respect TFC for what it is even if you don't personally enjoy the game.", "timestamp_created": 1394817152, "timestamp_updated": 1394989481, "voted_up": true, "votes_up": 154, "votes_funny": 3, "weighted_vote_score": "0.767057716846466064", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18115273": {"recommendationid": "18115273", "author": {"steamid": "76561198129967099", "num_games_owned": 135, "num_reviews": 107, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1450022108}, "language": "english", "review": "Back there, my children, THERE WERE NO HATS OR 12 YEAR OLDS.", "timestamp_created": 1442747324, "timestamp_updated": 1442747324, "voted_up": true, "votes_up": 185, "votes_funny": 374, "weighted_vote_score": "0.76652061939239502", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28655251": {"recommendationid": "28655251", "author": {"steamid": "76561198218379705", "num_games_owned": 80, "num_reviews": 15, "playtime_forever": 6103, "playtime_last_two_weeks": 0, "last_played": 1544290877}, "language": "english", "review": "Great game, it's 1990's fps in it's purest form. If you can look past the dated graphics, then you are in for a great time. \n\n- The community may be pretty small, but they are still humble and not totaly toxic. (Looking at you Fortress Forever)\n\n- The classes are all well balanced. Except combat Medic and Scout who can go totaly ham when in the right hands.\n\n- There are only a handful of constantly populated servers left, but when you find them it's really fun.\n\n- Very high skill ceiling. It's the defenition of easy to learn, hard as balls to master. So if you want a rewarding and chalenging fps, then this is up your alley.\n\n- Pretty dated graphics, but again, try your best to look past them.\n\n- When the game is on sale it is dirt cheap. I picked it up for 1 dollar, worth every penny.\n\n\n8/10 - Good game.\n\n\n\n\n", "timestamp_created": 1482717573, "timestamp_updated": 1482717573, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.681986212730407715", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25923774": {"recommendationid": "25923774", "author": {"steamid": "76561197967241706", "num_games_owned": 167, "num_reviews": 56, "playtime_forever": 6470, "playtime_last_two_weeks": 0, "last_played": 1534544750}, "language": "english", "review": "I remember playing Team Fortress Classic in my friend's basement while watching the James Bond marathon on TBS in 1999. Half-Life included a copy of it, and I absolutely fell in love.\n\nMy favorite map was Well, playing as a spy, sneaking around the enemy base and stabbing defenders in the back and then playing dead while others unwittingly walked by. Along with Counter-Strike, this was my favorite Half-Life mod and I sunk hundreds of hours into it in High School. TFC will always have a special place in my heart. \n\nIt's still good fun but, for a more modern gamer, it may be dated. Consider downloading Fortress Forever instead. It's an HD remake, it's free and it's fantastic.", "timestamp_created": 1475928664, "timestamp_updated": 1511954213, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.699946105480194092", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44337646": {"recommendationid": "44337646", "author": {"steamid": "76561198802738953", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1547959563}, "language": "english", "review": "I can't run tf2. But i can run this. Despite the crappy graphics, its a really fun game.\n", "timestamp_created": 1535053092, "timestamp_updated": 1535053092, "voted_up": true, "votes_up": 18, "votes_funny": 15, "weighted_vote_score": "0.692907333374023438", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34830310": {"recommendationid": "34830310", "author": {"steamid": "76561198193867986", "num_games_owned": 49, "num_reviews": 3, "playtime_forever": 2317, "playtime_last_two_weeks": 3, "last_played": 1551844524}, "language": "english", "review": "Team Fortress Classic is not just one of the best FPS games out there, it's probably one of the best games of all time. I really love playing this game. Everything about it is just so perfect. Sure, the graphics are outdated and there may be some sound glitches here and there, but overall, the game is amazingly well done. I definitely recommend playing this if you haven't. It's only 5 dollars, it runs on almost any PC (because of its primitive graphics and engine), and it's a fun, addicting 90's gaming experience. And I also think it's a little better than Team Fortress 2. I also recommend that you play the game because there aren't a lot of players (last time I was on, there were less than 100 players playing on a total of 73 servers) and we NEED more players! PLEASE buy this game! I definitely recommend this game.", "timestamp_created": 1504938319, "timestamp_updated": 1504938319, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.667178928852081299", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10516401": {"recommendationid": "10516401", "author": {"steamid": "76561198059318191", "num_games_owned": 247, "num_reviews": 22, "playtime_forever": 360, "playtime_last_two_weeks": 0, "last_played": 1424625747}, "language": "english", "review": "You can pee into the urinal.\n\n10/10", "timestamp_created": 1403111924, "timestamp_updated": 1403111952, "voted_up": true, "votes_up": 757, "votes_funny": 7, "weighted_vote_score": "0.761423110961914063", "comment_count": 61, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32195238": {"recommendationid": "32195238", "author": {"steamid": "76561198198765459", "num_games_owned": 100, "num_reviews": 19, "playtime_forever": 1238, "playtime_last_two_weeks": 0, "last_played": 1502259626}, "language": "english", "review": "99% Of TF2 players don't even know this old school game.... :( Amen...", "timestamp_created": 1496654351, "timestamp_updated": 1496654351, "voted_up": true, "votes_up": 137, "votes_funny": 34, "weighted_vote_score": "0.75145721435546875", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28568984": {"recommendationid": "28568984", "author": {"steamid": "76561198163704510", "num_games_owned": 64, "num_reviews": 21, "playtime_forever": 540, "playtime_last_two_weeks": 0, "last_played": 1484366668}, "language": "english", "review": "This game can be very challenging and frustrating at first, and is almost an entirely different game than Team Fortress 2. If you are an experienced TF2 player, do not expect to be able to walk right into this easily. This game was released in 1999, and there are people that started playing that year, and still play to this day. This is one of the main reasons this game is so difficult. However, I personally enjoy a challenge, and like TFC better than TF2. It just has the classic game design that I love. It also has a wider variety of practical strategies and more maps. Unfortunately though, it has a relatively small community and few servers. If you are questioning whether you'll buy this game or not, I highly recommend waiting until a Steam sale to do so.", "timestamp_created": 1482525837, "timestamp_updated": 1482525837, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.71352386474609375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38508772": {"recommendationid": "38508772", "author": {"steamid": "76561197981188310", "num_games_owned": 194, "num_reviews": 18, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1440020075}, "language": "english", "review": "I remember playing it on my Voodoo 3 video card and a 56k internet connection.", "timestamp_created": 1513900380, "timestamp_updated": 1513900473, "voted_up": true, "votes_up": 28, "votes_funny": 11, "weighted_vote_score": "0.70912700891494751", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25432424": {"recommendationid": "25432424", "author": {"steamid": "76561198043609914", "num_games_owned": 2360, "num_reviews": 398, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1471895833}, "language": "english", "review": "Team Fortress Classic is a precursor to TF2 a highly popular Hat Simulator made by valve, so let's take a step back and look at the first game in the series. \n\nTeam Fortress Classic is similar to all early valve multiplayer games and by that I mean, Counter Strike and Half Life Deathmatch. The gameplay is similar, but there is a different gameplay spin in each game. For example in Counter Strike you use real life weapons, in Half Life you use iconic weaponry from the games and in Team Fortress you have classes.\n\nClasses range from a heavy who uses a mini gun, to a spy and a medic and many many more. All of them have different weaponry and all function differently on the field. Some weapons do more damage, but fire slower or vice versa. It all boils down to skill and it's really fun.\n\nGameplay wise, I only got the chance to try out Capture the Flag as it's the only server I found which still contains a nice amount of dedicated players which is nice. Other gamemodes have a few players, but the game is pretty much dead and I will get into that a bit later.\n\nGraphically this is a mod of the Half Life game similar to Counter Strike, so a lot of the same assets and models are in this game. It's not aged well, but overall graphics are not the selling point for this game.\n\nGameplay is really fun, it's challenging and rewarding and it's general a really good gameplay design.\n\nNow the only bad thing is a major problem with the game. It has a dying community and it's dying rapidly. I only found one server that had 13 people in total, while others only had 2 or no players. It's a dying game, but the people that play it, they are very dedicated players so you can get in touch with a community and get  a game going.\n\nOverall Team Fortress Classic is a fun game, is it as good as Team Fortress 2 ? No, not really. While I like the gameplay more in this game, I still think Team Fortress 2 is the better game.\n\nFinal Rating:\n6/10 \n\nPros:\n+ In Depth Gameplay\n\nCons:\n-Dying Community", "timestamp_created": 1473455948, "timestamp_updated": 1473455948, "voted_up": true, "votes_up": 24, "votes_funny": 5, "weighted_vote_score": "0.704046010971069336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16006327": {"recommendationid": "16006327", "author": {"steamid": "76561198085178570", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 546, "playtime_last_two_weeks": 0, "last_played": 1475466257}, "language": "english", "review": "This game's nostalgic feel reminds me of the time I first loaded it back in 1999, and I still have that feeling of it to this day.\n\n10/10", "timestamp_created": 1432607647, "timestamp_updated": 1432607647, "voted_up": true, "votes_up": 38, "votes_funny": 9, "weighted_vote_score": "0.675510942935943604", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40205002": {"recommendationid": "40205002", "author": {"steamid": "76561197993406766", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 2012, "playtime_last_two_weeks": 0, "last_played": 1527723857}, "language": "english", "review": "Best online multiplayer I've ever played, it's a shame all the servers are empty most of the time...", "timestamp_created": 1518987593, "timestamp_updated": 1518987593, "voted_up": true, "votes_up": 20, "votes_funny": 7, "weighted_vote_score": "0.69857865571975708", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38089053": {"recommendationid": "38089053", "author": {"steamid": "76561198133086581", "num_games_owned": 222, "num_reviews": 87, "playtime_forever": 25987, "playtime_last_two_weeks": 0, "last_played": 1496000678}, "language": "english", "review": "Team Fortress Classic\n\nTeam Fortress Classic is really good olf fps game, it is one of the best at the time it was released. It still is enjoyable to this day. Game is well put together, it is old but still enjoyable experience. You might encounter small bugs, but nothing too big to ruin the gaming experience. There is not that many players in this game anymore, but still enought to play games every now and then. Worth picking up at sale.\n\nGrade: 8/10", "timestamp_created": 1512508364, "timestamp_updated": 1512508364, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.676130354404449463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30638002": {"recommendationid": "30638002", "author": {"steamid": "76561198043912504", "num_games_owned": 174, "num_reviews": 55, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1412131164}, "language": "english", "review": "tf2 without hats", "timestamp_created": 1490028724, "timestamp_updated": 1490028724, "voted_up": true, "votes_up": 30, "votes_funny": 37, "weighted_vote_score": "0.672477185726165771", "comment_count": 3, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35955166": {"recommendationid": "35955166", "author": {"steamid": "76561198136939558", "num_games_owned": 175, "num_reviews": 7, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1544148951}, "language": "english", "review": "If you took Quake II's CTF mode and injected it with steroids and liquid cocaine, this game would be the outcome. If you want to know where TF2 sort of started, then you're in for a fun time. It retains all of the classic Quake sound effects, the wacky physics of the GoldSrc engine, and the classic class-based gameplay that Team Fortress is known for. I've owned this game for a long time (in fact, I've owned this since I created my Steam account,) but I never got around to writing a review for it until now. The classes have COMPLETELY different weapons and playstyles compared to the sequel's counterparts. The spy has a \"feign death\" option, but no invis-watch, so you need to have good timing and hide in the shadows when playing Spy. Every class has a shotgun or nailgun of some kind, sometimes even both. Every class has grenades, so every class can jump across the map just as their heart desired. Just imagine a Medic jumping across the map with a Nailgun, completely obliterating people. Oh, did I mention that the Medic can infect a player on the opposing team with a deadly virus? No? Well, he can. Here are some other pros and cons about this game:\n\nPROS:\n*A whole butt-load of fun\n*A relatively inexpensive game\n*Graphics are still decent for today's standards\n\nCONS:\n*Has a sequel\n*The sequel is free\n*The sequel has hats, weapons, and a NEW UPDATE that came out a few days ago.\n\nTo be honest, I think if you're buying this with the rest of the Half-Life Anthology, you'd be getting a very good value. But, I don't think you should get it standalone. Although the game is fun, it stopped getting updated at around 2004 with its Steam Update. The sequel is free, so if you want to play Team Fortress, play the second one. I still recommend this to people who either want to get the entire Half-Life Anthology or are just curious about what Team Fortress looked like during the Early 2000s.\n\nFinal Score:\n9 Flying Medics out of 10", "timestamp_created": 1508799091, "timestamp_updated": 1508799091, "voted_up": true, "votes_up": 16, "votes_funny": 5, "weighted_vote_score": "0.653764128684997559", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36420997": {"recommendationid": "36420997", "author": {"steamid": "76561197963648881", "num_games_owned": 126, "num_reviews": 3, "playtime_forever": 103357, "playtime_last_two_weeks": 0, "last_played": 1535230613}, "language": "english", "review": "Ok first review on Steam, ever. This is because I have 1700 hours on this game, since 2003 and still playing in 2017.\n\nThis game is very dynamic, teamplay is a must. How could you really enjoy the game? Playing pickups.\nServers for pickups are in US (http://www.ffpickup.com/tfc/), Australia, Europe and Latinamerica (Argentina).\nYou should friend someone to get into the servers.\n\nWhat's fun about the game? Continuous respawns and class specific skills (bunnyhopping, concussion grenades). Capture the flag mode.\n\nIf you don't play competitive, I strongly suggest not to buy this game.", "timestamp_created": 1510327484, "timestamp_updated": 1510327484, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.673681855201721191", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30619080": {"recommendationid": "30619080", "author": {"steamid": "76561197999151078", "num_games_owned": 449, "num_reviews": 240, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1507602711}, "language": "english", "review": "This is a historically important game as far as multiplayer FPSes are concerned, but is it worth playing now? Well...if it's on sale and/or if you adore vintage shooters, I'd say yes.\n\n\nComparing this to [url=http://steamcommunity.com/id/trar/recommended/440]Team Fortress 2[/url] is kind of like looking into a time capsule. It's janky, not [i]that[/i] well-balanced, and the grenade spam is real (real stupid, even.) The Spy has no cloak or sapper, instead he can feign death as a fake corpse, and if anything that makes him even harder to play. The Pyro is kind of useless, and the Medic usually ends up launching himself at the enemy team to poison them with his medkit, which let me tell you is far harder to use than TF2's mediguns.\n\nBoth he and the Scout have concussion grenades that let experienced players literally fly all over the map, in addition to bunnyhopping letting you go faster in general, although at least the game doesn't totally revolve around them like [url=http://steamcommunity.com/id/trar/recommended/253530/]Fortress Forever[/url] does.\n\nOn the other hand, there's not hundreds and hundreds of hats bloating the game, and since there's no unlockable weapons as well as fewer hidden \"pro level\" mechanics to learn about, it's actually a little more intuitive overall than TF2 is at this point.\n\n\nIt can still be fun - it still has that Team Fortress magic, but with the high percentage of veterans in the playerbase and the age of the game, you'll have to come to terms with it like most old school titles. There's not that many players; the daily average is around 100. Some of them [i]will[/i] clean your clock if you're new, as mentioned before. If you want to experience this, ideally you'd get a couple friends to join you, or find a 'TFC revival' group that arranges pick-up games.", "timestamp_created": 1489940774, "timestamp_updated": 1551459801, "voted_up": true, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.692319154739379883", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "43143518": {"recommendationid": "43143518", "author": {"steamid": "76561197960385162", "num_games_owned": 27, "num_reviews": 14, "playtime_forever": 595, "playtime_last_two_weeks": 0, "last_played": 1529026370}, "language": "english", "review": "\nTeam Fortress Classic is a precursor to TF2 a highly popular Hat Simulator made by valve, so let's take a step back and look at the first game in the series. \n\nTeam Fortress Classic is similar to all early valve multiplayer games and by that I mean, Counter Strike and Half Life Deathmatch. The gameplay is similar, but there is a different gameplay spin in each game. For example in Counter Strike you use real life weapons, in Half Life you use iconic weaponry from the games and in Team Fortress you have classes.\n\nClasses range from a heavy who uses a mini gun, to a spy and a medic and many many more. All of them have different weaponry and all function differently on the field. Some weapons do more damage, but fire slower or vice versa. It all boils down to skill and it's really fun.\n\nGameplay wise, I only got the chance to try out Capture the Flag as it's the only server I found which still contains a nice amount of dedicated players which is nice. Other gamemodes have a few players, but the game is pretty much dead and I will get into that a bit later.\n\nGraphically this is a mod of the Half Life game similar to Counter Strike, so a lot of the same assets and models are in this game. It's not aged well, but overall graphics are not the selling point for this game.\n\nGameplay is really fun, it's challenging and rewarding and it's general a really good gameplay design.\n\nNow the only bad thing is a major problem with the game. It has a dying community and it's dying rapidly. I only found one server that had 13 people in total, while others only had 2 or no players. It's a dying game, but the people that play it, they are very dedicated players so you can get in touch with a community and get a game going.\n\nOverall Team Fortress Classic is a fun game, is it as good as Team Fortress 2 ? No, not really. While I like the gameplay more in this game, I still think Team Fortress 2 is the better game.\n\nFinal Rating:\n6/10 \n\nPros:\n+ In Depth Gameplay\n\nCons:\n-Dying Community", "timestamp_created": 1530234320, "timestamp_updated": 1530234320, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.652942061424255371", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43952090": {"recommendationid": "43952090", "author": {"steamid": "76561198209505537", "num_games_owned": 58, "num_reviews": 17, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1540781398}, "language": "english", "review": "I heard the sequel was better", "timestamp_created": 1533494710, "timestamp_updated": 1533494710, "voted_up": true, "votes_up": 22, "votes_funny": 25, "weighted_vote_score": "0.679328322410583496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "210569": {"recommendationid": "210569", "author": {"steamid": "76561197965341208", "num_games_owned": 69, "num_reviews": 39, "playtime_forever": 2, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "I bought this game in 1999 and it changed my life.  I never liked first person shooters so much but this thing was sheer genius.  I flunked out of law school because of this game.  It was worth it, though.  That law school was awful and I never would have found a job as a lawyer graduating from that shitty law school.  So in that sense, this game really saved me.  I played it loads.\n\nThen TF2 came out.  I was skeptical but TF2 really is a superior game.  Since 1999 the only games I've played on a regular basis have been Team Fortress Classic and Team Fortress 2.  Of course I don't play Team Fortress Classic anymore but it was great for it's time.  \n\nPwninator score: 10/10", "timestamp_created": 1379363245, "timestamp_updated": 1385405541, "voted_up": true, "votes_up": 225, "votes_funny": 0, "weighted_vote_score": "0.745288312435150146", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13488560": {"recommendationid": "13488560", "author": {"steamid": "76561198083263380", "num_games_owned": 313, "num_reviews": 4, "playtime_forever": 1293, "playtime_last_two_weeks": 0, "last_played": 1481500695}, "language": "english", "review": "The game is named Classic for a reason. Try it out.", "timestamp_created": 1419134410, "timestamp_updated": 1419134410, "voted_up": true, "votes_up": 55, "votes_funny": 19, "weighted_vote_score": "0.683218538761138916", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24669190": {"recommendationid": "24669190", "author": {"steamid": "76561198026403147", "num_games_owned": 176, "num_reviews": 7, "playtime_forever": 580, "playtime_last_two_weeks": 0, "last_played": 1496966683}, "language": "english", "review": "Jump around corners as the Heavy Weapons, put booby-trapped dispensers in doorways as Engineer, fake your own death to avoid attending church this week as Spy, use Scout's concussion grenade to make your assailants puke, and give your enemies the Bubonic Plague with Medic's first-aid kit full of bacteria.\nBut for the love of god, do not forget to cook your grenades!", "timestamp_created": 1470141110, "timestamp_updated": 1470141110, "voted_up": true, "votes_up": 15, "votes_funny": 11, "weighted_vote_score": "0.67968517541885376", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33068219": {"recommendationid": "33068219", "author": {"steamid": "76561197960949599", "num_games_owned": 104, "num_reviews": 20, "playtime_forever": 649, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "the original game that started my FPS career", "timestamp_created": 1498884490, "timestamp_updated": 1498884490, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.676365196704864502", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "805723": {"recommendationid": "805723", "author": {"steamid": "76561197978902089", "num_games_owned": 8192, "num_reviews": 74, "playtime_forever": 728796, "playtime_last_two_weeks": 0, "last_played": 1548517130}, "language": "english", "review": "I am a true lifelong fan of TFC, being the best Half-Life 1 MOD since 1999, the fact that this game now has its own series gives Valve a hefty profit. Whilst I'm not much of a fan of TF2, the huge differences are the fast-paced gaming and the seriousness of the actual game, especially for the year it was made. Ever since OpenGL took place it's still been a brilliant game and still has a working public server list with users player. It's a shame it's almost dead but still a fantastic game and beats TF2 by far.", "timestamp_created": 1290763760, "timestamp_updated": 1385432539, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.724394559860229492", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42474284": {"recommendationid": "42474284", "author": {"steamid": "76561198327206452", "num_games_owned": 189, "num_reviews": 10, "playtime_forever": 2286, "playtime_last_two_weeks": 0, "last_played": 1530825260}, "language": "english", "review": "TF2 is for men\nTFC is for legends", "timestamp_created": 1528046035, "timestamp_updated": 1528046035, "voted_up": true, "votes_up": 28, "votes_funny": 14, "weighted_vote_score": "0.703838884830474854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "839131": {"recommendationid": "839131", "author": {"steamid": "76561197979911480", "num_games_owned": 529, "num_reviews": 85, "playtime_forever": 81188, "playtime_last_two_weeks": 0, "last_played": 1545779996}, "language": "english", "review": "This TF game is better for professional TF gamers and to avoid any things or Mann Co. items that may blow things outta proportion. The TFC concs, HH nades and detpacks makes this game better as well.", "timestamp_created": 1290200884, "timestamp_updated": 1290200884, "voted_up": true, "votes_up": 24, "votes_funny": 1, "weighted_vote_score": "0.694527268409729004", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12878346": {"recommendationid": "12878346", "author": {"steamid": "76561197977913023", "num_games_owned": 78, "num_reviews": 27, "playtime_forever": 8659, "playtime_last_two_weeks": 0, "last_played": 1526936235}, "language": "english", "review": "Was my first PC game.\nHad the best community in all of the gaming communites I've ever seen.\n\nMade lots of memories on this game, not just from its fundamental gameplay of team vs team\nbut had fun with the imaginative mods too\nhide and seek\nminigolf\nentmod (the gmod before gmod)\nescape\nsurf\nfun tdm (powerups, hook, jetpack etc...)\nfree for all\nradiomod\nNeoTF\nthe list goes on, but this was off the top of my head\n\nIt will always be my favorite\ntoo bad its dead c:", "timestamp_created": 1415647694, "timestamp_updated": 1415647694, "voted_up": true, "votes_up": 53, "votes_funny": 15, "weighted_vote_score": "0.748979032039642334", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23912733": {"recommendationid": "23912733", "author": {"steamid": "76561198154401287", "num_games_owned": 140, "num_reviews": 18, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1517105662}, "language": "english", "review": "No 12 year old, no hats, pyro can talk, nobody plays pyro, spy has a shotgun and smg. 10/10", "timestamp_created": 1467168329, "timestamp_updated": 1467553247, "voted_up": true, "votes_up": 40, "votes_funny": 24, "weighted_vote_score": "0.704427719116210938", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32279234": {"recommendationid": "32279234", "author": {"steamid": "76561198008530522", "num_games_owned": 266, "num_reviews": 46, "playtime_forever": 546, "playtime_last_two_weeks": 0, "last_played": 1496965767}, "language": "english", "review": "See where the iconic Team Fortress 2 came from. Team Fortress Classic is a class based Team vs Team game using Half Life's mechanics. The same 9 classes are in the game from TF2, although you'll find it a bit different.  Surprisingly there are still active servers and you can always find a game. A must have for those missing 90s based FPS games.\n\nYou can pick this game up for full price. You'll be able to get your money's worth.", "timestamp_created": 1496966393, "timestamp_updated": 1500925348, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.646599888801574707", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47694330": {"recommendationid": "47694330", "author": {"steamid": "76561198192313046", "num_games_owned": 13, "num_reviews": 12, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1546121476}, "language": "english", "review": "A great predecessor of everyone's favorite FPS.", "timestamp_created": 1545444979, "timestamp_updated": 1545444979, "voted_up": true, "votes_up": 11, "votes_funny": 4, "weighted_vote_score": "0.633333325386047363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38013783": {"recommendationid": "38013783", "author": {"steamid": "76561197998855051", "num_games_owned": 681, "num_reviews": 6, "playtime_forever": 37547, "playtime_last_two_weeks": 0, "last_played": 1548042592}, "language": "english", "review": "If you buy this game not knowing anything but TF2 get ready for quite a few differences.  First off this game moves at a very fast pace.  There is no downtime on death.  Second, except a LOT of gernade spam.  If you don't die to a random gernade at least 5 times in a match you got lucky.  This game requires a lot of high level skills that are difficult to master... the people who play this regularly have had these skills for over a decade so don't get discouraged.  Play!  Its fun!", "timestamp_created": 1512245508, "timestamp_updated": 1512245508, "voted_up": true, "votes_up": 11, "votes_funny": 7, "weighted_vote_score": "0.622317612171173096", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32167269": {"recommendationid": "32167269", "author": {"steamid": "76561198169227525", "num_games_owned": 82, "num_reviews": 21, "playtime_forever": 60641, "playtime_last_two_weeks": 0, "last_played": 1550412543}, "language": "english", "review": "hhhhhhhhhhhh good game", "timestamp_created": 1496548593, "timestamp_updated": 1546060955, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.660090744495391846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34661344": {"recommendationid": "34661344", "author": {"steamid": "76561197968297807", "num_games_owned": 123, "num_reviews": 35, "playtime_forever": 355, "playtime_last_two_weeks": 0, "last_played": 1503917974}, "language": "english", "review": "GG", "timestamp_created": 1504276842, "timestamp_updated": 1504276842, "voted_up": true, "votes_up": 17, "votes_funny": 4, "weighted_vote_score": "0.605418562889099121", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "17573427": {"recommendationid": "17573427", "author": {"steamid": "76561198047499744", "num_games_owned": 666, "num_reviews": 3, "playtime_forever": 8893, "playtime_last_two_weeks": 0, "last_played": 1534630824}, "language": "english", "review": "Yes, it may now be swarmed by TF2 kids coming in and not understanding where their hats are and confused by the most basic of gameplay mechanics past pressing their left mouse button.\n\nBut nothing will ever stop this from being the masterpiece game it is.", "timestamp_created": 1439759554, "timestamp_updated": 1463433403, "voted_up": true, "votes_up": 70, "votes_funny": 43, "weighted_vote_score": "0.710258781909942627", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31130028": {"recommendationid": "31130028", "author": {"steamid": "76561197961775669", "num_games_owned": 439, "num_reviews": 13, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "The game that inspired Team Fortress 2 which inspired the mega-popular online shooter Overwatch. I spent countless nights playing this game back in the 90s and absolutely loved it.", "timestamp_created": 1492151506, "timestamp_updated": 1492151506, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.691701948642730713", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36336089": {"recommendationid": "36336089", "author": {"steamid": "76561198119161228", "num_games_owned": 156, "num_reviews": 43, "playtime_forever": 413, "playtime_last_two_weeks": 0, "last_played": 1528166901}, "language": "english", "review": "Oh boy, a good game, but sadly no one to play it with", "timestamp_created": 1510031060, "timestamp_updated": 1510031060, "voted_up": true, "votes_up": 26, "votes_funny": 8, "weighted_vote_score": "0.679241359233856201", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25990944": {"recommendationid": "25990944", "author": {"steamid": "76561198181877921", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 16041, "playtime_last_two_weeks": 0, "last_played": 1519257131}, "language": "english", "review": "Extremely fun, great community, great challange and people that actually respect new player's\n \n                         What more could you ask for?", "timestamp_created": 1476234390, "timestamp_updated": 1476234390, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.642468154430389404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43864056": {"recommendationid": "43864056", "author": {"steamid": "76561198122761963", "num_games_owned": 648, "num_reviews": 48, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1487378319}, "language": "english", "review": "Now this is the REAL Classic!", "timestamp_created": 1533086418, "timestamp_updated": 1533086418, "voted_up": true, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.647749483585357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35293608": {"recommendationid": "35293608", "author": {"steamid": "76561197968373904", "num_games_owned": 1308, "num_reviews": 23, "playtime_forever": 14493, "playtime_last_two_weeks": 0, "last_played": 1527222676}, "language": "english", "review": "This is arguably one of the greatest online multiplayer games ever. For those of us born in the 80s who were there for the advent of FPS games and then also online gameplay, this and the other early Half-Life mods are some of the true cornerstones of some of the most eternally excellent gaming exoerience off all time. I remember playing this around 1999 or 2000, I had traded my friend from Junior High burnt copy of Rainbow Six Rogue Spear for an actual copy of Half Life, and this was before Serial Codes were really enforced as they are now, and this was before Steam too, there was the Sierra online network and WON IDs. Phenomenally grand memories of badass battles and classic funny moments that can take place during a game. This is one for the ages, and I played a ton of Counter-Strike back then too. Along with Action Half-Life (an amazing stylized-action movie style mod) and Firearms (a great approach to early realistic combat, with a vast array of weapons) and then there was The Opera, and Natural Selection. But they all came from the first, which was this, Team Fortress Classic (which yes, is techically a remake from a Quake mod, but IMO better in a handful of notable ways). So that's why I wanted to write a review for this awesomely eternally replayable online multiplayer team-based FPS game. I remember playing in Drippy's 2fort server and ViBig before I'd go to school in the mornings, it was so fun being able to play online through fast cable internet against other people probably doing the same thing. That's why this game is important, it's arguably one of the best multiplayer games of all time. Period.", "timestamp_created": 1506690906, "timestamp_updated": 1506690906, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.65389937162399292", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30459021": {"recommendationid": "30459021", "author": {"steamid": "76561198108227312", "num_games_owned": 37, "num_reviews": 12, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1511494254}, "language": "english", "review": "The granddaddy of the granddaddy of the class based shooter genre. You can really see how it set everything in place for tf2.", "timestamp_created": 1489276993, "timestamp_updated": 1489276993, "voted_up": true, "votes_up": 13, "votes_funny": 3, "weighted_vote_score": "0.622211217880249023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "41596973": {"recommendationid": "41596973", "author": {"steamid": "76561198133307300", "num_games_owned": 275, "num_reviews": 199, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1499903373}, "language": "english", "review": "[h1][u]Team Fortress [i]\"Classic\"[/i][/u][/h1]\n[list][b][i]\"One of the most popular online action games of all time!\"[/i][/b][/list]\n\nExperience [b][i]true combat gameplay[/i][/b] in a massive \npopular online action game. [i]Authentic, diverse,[/i] \nsends you directly to Stalingrad.\nThe single-player campaign has the player take \ncontrol of a multiplayer gamer. During the campaign, \nthe player will face everything from lone wolf \ninfiltration missions to the commanding \nof large scale armored keys on the board! \nThe player will be able to choose different \nobjectives and weaponry \n\n[i](such as Medic to Spy to Demolition Man) [/i]\naccording to their play style.", "timestamp_created": 1524278433, "timestamp_updated": 1524278480, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.594079494476318359", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42073290": {"recommendationid": "42073290", "author": {"steamid": "76561198834510685", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1544102784}, "language": "english", "review": "I'm going to be honest here, I came to this from tf2. I thought this was some dumb original with bad graphics. Well, the graphics aren't the greatest,but the gameplay is so fun and unique I beg any other Tf2 player to give this a try. Totally worth the five bucks, and my favorite class is Medic!", "timestamp_created": 1526510652, "timestamp_updated": 1526510652, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.614935815334320068", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48577596": {"recommendationid": "48577596", "author": {"steamid": "76561198028941980", "num_games_owned": 81, "num_reviews": 6, "playtime_forever": 456, "playtime_last_two_weeks": 67, "last_played": 1550879873}, "language": "english", "review": "This game needs more players. That's the only problem I see with it.", "timestamp_created": 1548549669, "timestamp_updated": 1548549669, "voted_up": true, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.637393295764923096", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35016824": {"recommendationid": "35016824", "author": {"steamid": "76561197999719850", "num_games_owned": 156, "num_reviews": 12, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1505637644}, "language": "english", "review": "Game's dead actualy, you're gonna play most of the time with bots.\nBut there is still some actual people playing the game, which is not bad.\nYou'll always find one or two servers with around 10 players.\nMy personal enjoyment : 7 out of 10.", "timestamp_created": 1505634057, "timestamp_updated": 1505635181, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.603487908840179443", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32118562": {"recommendationid": "32118562", "author": {"steamid": "76561198337247138", "num_games_owned": 40, "num_reviews": 18, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1503585194}, "language": "english", "review": "Team Fortress Classic is a very great game and gave birth to a great franchise. With the fun gameplay, and good graphics, it is one of the best fps for its time.", "timestamp_created": 1496363927, "timestamp_updated": 1496363927, "voted_up": true, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.665364503860473633", "comment_count": 8, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12283167": {"recommendationid": "12283167", "author": {"steamid": "76561198057805830", "num_games_owned": 113, "num_reviews": 61, "playtime_forever": 2208, "playtime_last_two_weeks": 0, "last_played": 1521834168}, "language": "english", "review": "pros.\nthis game is alot faster paced then tf2 and more hardcore.\nthe classes are really fun to use.\nno conga.\n_____________________________\n\ncons. \ntoo many elitists play this game.\nsniper rifle is underpowered.\nits old look might turn off some players.\n_____________________________\n\noverall its a really good game and it holds up in time \n", "timestamp_created": 1411945020, "timestamp_updated": 1411945020, "voted_up": true, "votes_up": 147, "votes_funny": 25, "weighted_vote_score": "0.728429496288299561", "comment_count": 20, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "239478": {"recommendationid": "239478", "author": {"steamid": "76561197966316508", "num_games_owned": 278, "num_reviews": 18, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 86400}, "language": "english", "review": "EXCUSE ME! I'M IN NEED OF MEDICAL ATTENTION!", "timestamp_created": 1322453019, "timestamp_updated": 1322453019, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.664454877376556396", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9131148": {"recommendationid": "9131148", "author": {"steamid": "76561198035568766", "num_games_owned": 332, "num_reviews": 11, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1324540800}, "language": "english", "review": "No hats.", "timestamp_created": 1392514509, "timestamp_updated": 1392514509, "voted_up": true, "votes_up": 661, "votes_funny": 8, "weighted_vote_score": "0.723199307918548584", "comment_count": 24, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20304936": {"recommendationid": "20304936", "author": {"steamid": "76561197960779770", "num_games_owned": 2067, "num_reviews": 3, "playtime_forever": 93521, "playtime_last_two_weeks": 0, "last_played": 1550330511}, "language": "english", "review": "Surprisingly this game still alive, a pretty good game about to die.", "timestamp_created": 1451942692, "timestamp_updated": 1451942692, "voted_up": true, "votes_up": 49, "votes_funny": 22, "weighted_vote_score": "0.692092835903167725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34645497": {"recommendationid": "34645497", "author": {"steamid": "76561198170419091", "num_games_owned": 168, "num_reviews": 12, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1509300179}, "language": "english", "review": "this game is WAY better than i though, if you havnt already, then go get it. An offline bot feature would be good.", "timestamp_created": 1504217784, "timestamp_updated": 1504217784, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.611727774143218994", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11164091": {"recommendationid": "11164091", "author": {"steamid": "76561198034340285", "num_games_owned": 172, "num_reviews": 9, "playtime_forever": 2608, "playtime_last_two_weeks": 0, "last_played": 1545085423}, "language": "english", "review": "[h1]Its a classic. The Team Fortress classic.[/h1]\n\nAs seen in the catchup in Team Fortress 2, it takes place in 1933 in a Black Mesa like environment. If I should have to place it in a timeline, TFC takes place in Black Mesa before the incident happened. \n\n[b]Summary:[/b]\nThere are two teams: RED and BLUE with each team consisting of 9 (sometimes 10) classes:\n[b]Classes[/b]\n[list]\n[*]- Scout\n[*]- Soldier\n[*]- Pyro\n[*]- Demolution Man\n[*]- Heavy Weapons Guy\n[*]- Engineer\n[*]- Combat Medic\n[*]- Sniper\n[*]- Spy\n[*]- Civillian\n[/list]\n\nThere are also plenty of different Gamemodes (based on CTF):\n[b]Gamemodes[/b]\n[list]\n[*] - Capture the Flag\n[*] - Reverse Capture the Flag\n[*] - Attack Defend Capture the Flag\n[*] - Territorial Control Capture the Flag\n[*] - Football Capture the Flag\n[/list]\n\nSadly, not many players are playing TFC at all.. there are just like two servers permanently active.. one server only playing 2Fort, and one with the standerd map rotation.\n\nI really recommend that game. It makes fun and I really enjoy it. Its a bit harder to play than TF2, and without hats, but if you really want to feel the Team Fortress feeling, try this one here out you'll be suprised of how good this game still is these days.\nIts really worth its like 10 bucks here on steam.\n\nIf I should give it a rarting, I would give it a 9/10. Its not perfect, but it still stands out of most of the shooters these days.", "timestamp_created": 1404987175, "timestamp_updated": 1404987201, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.624299705028533936", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25422162": {"recommendationid": "25422162", "author": {"steamid": "76561197968580473", "num_games_owned": 826, "num_reviews": 22, "playtime_forever": 92754, "playtime_last_two_weeks": 0, "last_played": 1547690604}, "language": "english", "review": "It’s a game that is as remarkable today as it was 17 years ago. Net code so sharp you could cut yourself with it. A game engine that positively flies on any hardware from the last 10 years. It’s £4 at full price.\n\nAnd it hasn’t got hats.\n\n[url=http://shemworld.com/team-fortress-classic]Team Fortress Classic @ ShemWorld[/url]", "timestamp_created": 1473405414, "timestamp_updated": 1480285075, "voted_up": true, "votes_up": 12, "votes_funny": 5, "weighted_vote_score": "0.646549463272094727", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15707266": {"recommendationid": "15707266", "author": {"steamid": "76561198040878923", "num_games_owned": 486, "num_reviews": 65, "playtime_forever": 711, "playtime_last_two_weeks": 0, "last_played": 1444893817}, "language": "english", "review": "Grenade detonating sound simulator 2015.", "timestamp_created": 1430877006, "timestamp_updated": 1430877006, "voted_up": true, "votes_up": 29, "votes_funny": 62, "weighted_vote_score": "0.596699833869934082", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27181463": {"recommendationid": "27181463", "author": {"steamid": "76561197961129382", "num_games_owned": 144, "num_reviews": 2, "playtime_forever": 14834, "playtime_last_two_weeks": 0, "last_played": 1498234074}, "language": "english", "review": "Old but gold", "timestamp_created": 1479997375, "timestamp_updated": 1479997375, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.64823615550994873", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28787115": {"recommendationid": "28787115", "author": {"steamid": "76561198023666926", "num_games_owned": 1945, "num_reviews": 1065, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1504393456}, "language": "english", "review": "No one is playing this now but it is nice to see how first Team Fortress looked :)", "timestamp_created": 1483011613, "timestamp_updated": 1483011613, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.640364170074462891", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24259769": {"recommendationid": "24259769", "author": {"steamid": "76561198199478923", "num_games_owned": 116, "num_reviews": 6, "playtime_forever": 3350, "playtime_last_two_weeks": 0, "last_played": 1548424272}, "language": "english", "review": "I definitlely recommend this classic old-school game. This is what I grew up with, and TF2 is another story. So yeah. I'm a big fan of GoldSrc games, and every retro gamer like me should have this. I spent most hours in WON version of this, and now I'm now spending more in Steam version. In conclusion - this is perfect game when it comes to old-school multiplayer.", "timestamp_created": 1468263887, "timestamp_updated": 1468263887, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.616055846214294434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42522294": {"recommendationid": "42522294", "author": {"steamid": "76561198111284198", "num_games_owned": 26, "num_reviews": 3, "playtime_forever": 289, "playtime_last_two_weeks": 0, "last_played": 1526177723}, "language": "english", "review": "Even though I didn’t play this game anymore I still recommend it because it unique styles of gameplay and gold source engine for half life it a really unique game even though I play only a little bit.", "timestamp_created": 1528256466, "timestamp_updated": 1528256466, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.593488752841949463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39484389": {"recommendationid": "39484389", "author": {"steamid": "76561197960373660", "num_games_owned": 2060, "num_reviews": 1364, "playtime_forever": 1047, "playtime_last_two_weeks": 0, "last_played": 1516551129}, "language": "english", "review": "󠀡", "timestamp_created": 1516458238, "timestamp_updated": 1527576333, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.652996838092803955", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45601867": {"recommendationid": "45601867", "author": {"steamid": "76561197966818509", "num_games_owned": 41, "num_reviews": 6, "playtime_forever": 1297, "playtime_last_two_weeks": 22, "last_played": 1551319032}, "language": "english", "review": "Classic fun game", "timestamp_created": 1541251731, "timestamp_updated": 1541251731, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.633507847785949707", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9711964": {"recommendationid": "9711964", "author": {"steamid": "76561198081045195", "num_games_owned": 153, "num_reviews": 21, "playtime_forever": 101, "playtime_last_two_weeks": 0, "last_played": 1412386934}, "language": "english", "review": "Even in 2014 and with TF2 around, I still play this ancient 1997 TFC game just to see how some people played back then. Worth the $5, but stick with TF2.", "timestamp_created": 1396513879, "timestamp_updated": 1396513879, "voted_up": true, "votes_up": 101, "votes_funny": 0, "weighted_vote_score": "0.680092453956604004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38683680": {"recommendationid": "38683680", "author": {"steamid": "76561198146569609", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1541295699}, "language": "english", "review": "The community on Team Fortress Classic is a little better than Team Fortress 2 because: 1: less little kids. 2: The people are less toxic 3: It's Old and I like it", "timestamp_created": 1514263167, "timestamp_updated": 1514263167, "voted_up": true, "votes_up": 20, "votes_funny": 4, "weighted_vote_score": "0.651569962501525879", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 11, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 2165, "total_negative": 404, "total_reviews": 2569}}
