{"reviews": {"42737312": {"recommendationid": "42737312", "author": {"steamid": "76561198067635491", "num_games_owned": 368, "num_reviews": 1, "playtime_forever": 4148, "playtime_last_two_weeks": 0, "last_played": 1528973046}, "language": "english", "review": "Just going to say from the start, that the actual GAME itself isn't that bad, and if you have friends to play with its a good time.  The graphics are old but that doesn't take away from it and gives it uniqueness.  If you play with randoms in PvE you wont have the best time, but PvP and you'll still have enjoyment on your own.  \n\nNow that my opinion on the game itself is here, lets adress why I STRONGLY reccomend you NOT to download this game, or at the very least to NOT support the developers. \n\nA few months ago this game underwent a server migration which you can read more about here ---> https://steamcommunity.com/games/273110/announcements/detail/1655510866879925331\nIn this migration, if you didn't notice the notification for it so you could opt into the migration, everything you had would be 'PERMANENTLY DELETED'.  This meaning, if you spent any money wether it be $0.29 or $100 worth of guns, characters, accessories, etc. would be wiped as well.  Had this company even CARED about their player base, they could at least issue the value of in-game items to what you spent over the years of you playing the game to anyone who sent in a support ticket with proof of how much they had spent in game.  I myself sent in a ticket with this issue and provided the information of how much I had spent along with my steam purchase history to prove that it was to CSNZ, I was greeted with a copy/paste response saying how it was MY fault and that they can't do anything about it.  From the poor decision of this company, MANY players lost hundreds even THOUSANDS of hours worth of grinding for, levels, equipment, guns, and characters.  This decision had absolutely ZERO thought and NO respect for the players, put your time into a game where the developers would at least allow you to keep the things you've accumulated over time.", "timestamp_created": 1529050380, "timestamp_updated": 1529050380, "voted_up": false, "votes_up": 76, "votes_funny": 2, "weighted_vote_score": "0.878164052963256836", "comment_count": 23, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30666973": {"recommendationid": "30666973", "author": {"steamid": "76561198171284053", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 21853, "playtime_last_two_weeks": 0, "last_played": 1499590507}, "language": "english", "review": "I enjoyed this game while I was allowed to play it.\n\nHowever, after spending $90 in the in-game shop, I tried to log in one day, only to find out that I had been permanently banned for 'macro/auto-clicker use'  which is something I have never done.\nI made a ticket with Nexon support, and after 2 days they finally responded to me to tell me:\n \"We have several proof of you using macros / auto-clickers. For this reason your account will remain permanently banned.\"\n\nI'm not sure how they could have one proof, not to mention several proof of me using macros/ auto-clickers, when I have never used them, but now they are refusing to refund all the money I spent in their in-game shop.\n\nSo basically I like playing this game, until they decided to falsely accuse me of breaking their rules, and then decide to steal my money.\n\nI would not recommend this game to anyone", "timestamp_created": 1490182526, "timestamp_updated": 1490182526, "voted_up": false, "votes_up": 384, "votes_funny": 38, "weighted_vote_score": "0.914711117744445801", "comment_count": 19, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18399286": {"recommendationid": "18399286", "author": {"steamid": "76561198156729593", "num_games_owned": 123, "num_reviews": 7, "playtime_forever": 202328, "playtime_last_two_weeks": 0, "last_played": 1447786378}, "language": "english", "review": "*******WARNING*************WARNING***************WARNING*************WARNING *****************\n\n*Updated* (3/23/16)\n--------------------------------------------------------------------------------------------------------------\n[NX]Dualism  [developer] Posted: Mar 23 @ 7:46am\nDear Players,\n\nXIGNCODE3 is an well known anti-cheat tool that is currently being used by more than 2000 games.\nIt is very similar in its functionality to the ones used by Valve (VAC) or Blizzard (Warden) to protect their community from cheaters.\n\nClient-side anti-cheat tools are considered to be much safer than server-side ones and they all have to scan information on your PC to protect the game from cheaters.\nThese programs are hashing scanned strings and comparing them to those of known malicious programs. No actual information about your system is ever sent or saved.\n\nPlease note that anti-cheat tools are a necessity in multiplayer games to protect you, our community, and please be assured that your privacy is important to us too. \n\nRegards,\n[NX]Dualism\n\n- According to this Nexon Developer Dualism, \" No actual information about your system is ever sent or saved.\" So what is the point of having Xigncode3 on our computers that are \" hashing scanned strings and comparing them to those of known malicious programs\"? All information online is being sent, received, saved, and transcribed. If you have the balls to claim that \"No actual information about your system is ever sent or saved\" then you shouldn't be a developer at all because you have ZERO  knowledge of how data works online.   \n\nIf Xigncod3 does not send or store information, how is it that another Nexon Developer is able to tell a user (on the forums) [**it is or will be deleted by Nexon when you read this review**]  that they were visting a malicious website regarding hacks, cheats, etc (I don't know what the user was on). Information was sent somewhere so that the developer could read the log or history and determine the user was on a malicious website. In order to have a log or history... something was saved. Ex. How do we know what happened in the past if it wasn't written down? That was your first contradiction Dualism. \n\nXigncode does not store information about my system huh? How do you explain that the program keeps track of everything on the users computer and what was modify within the last 48 hours? Is it necessary for Nexon or the company that codes Xigncode to know what print driver I have installed or that I created a meme on Microsoft Paint? I mean that meme is a new/edited file. Do you really want to see it that bad before i post it on Imgur or 9gag?  Second contradiction Dualism. \n\nAlso, just because the information being sent by Xigncode may be (BIG MAY BE)  encrypted doesn't mean a hacker  (reverse engineer) can't decode the encryption and possibly steal user connection info such as ip address, internet company they use and possibly more. Big companies like Walmart, JPMorgan Chase and Target got hacked for their customer credit cards. Here is a full list of companies that were hacked in 2014\nhttp://www.heritage.org/research/reports/2014/10/cyber-attacks-on-us-companies-in-2014 \n\nHow is one to trust a gaming company so small that it can compare itself to Valve and Blizzard which have superior net worth and income levels to protect users if their data was ever breached?Thats your third contradiction Dualism. Xigncode may perform similar functions as Valve (Vac) and Blizzard (Warden) but it doesn't guarantee user protection.  Also if Counter-strike Nexon Zombies is on Steampowered which is owned by Valve why not adopt the VAC system? Nexon Zombies is basically a big mod of Counter-Strike 1.6 so shouldn't it adopt the same anti-cheat system?\n\nThe fact that Nexon changes their EULA on the whim without letting their users know is questionable. Blizzard, Valve, Ubisoft all send out notices that EULA has been updated/changed and asks the user to accept it. Most don't read it but we at least know it was updated/changed. \n\nDualism, Do you care to update or change your response? \n\n----------------------------------------------------------------------------------------------------------\n*Updated* (11/18/15) - Nexon is currently using XIGNCODE for their hack sensor. XIGNCODE scans all the files within your computer that was opened in the last 48 hours as well as the websites you've visited within those hours.. This is a huge breach of your rights, and privacy and a potential data .mine for hackers..\n\n\n\nGame use to be good.... Now it just sucks. Most servers are filled with lag and people teleporting thru the map. Every update/patch seems to make the servers worse. Game has been more about money grabbing by Nexon then building a gaming community that appreciates the game thus more likely to actually spend. Majority of the players are EU>SA>NA but SA players are unsupported with a server. They piggyback on NA servers causing all types of lag and server glitches due to their connection. If you're in NA servers expect your ping to bounce from <100 to about 200-300+. Not many hackers which is a +1 but a ton of people abuse bugs and tons who use VPN even tho is banned by Nexon. +1 for staff since they actually read forum posts.", "timestamp_created": 1444414535, "timestamp_updated": 1458781252, "voted_up": false, "votes_up": 773, "votes_funny": 48, "weighted_vote_score": "0.910334110260009766", "comment_count": 55, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Dear Players,\n\nXIGNCODE3 is an well known anti-cheat tool that is currently being used by more than 2000 games.\nIt is very similar in its functionality to the ones used by Valve (VAC) or Blizzard (Warden) to protect their community from cheaters.\n\nClient-side anti-cheat tools are considered to be much safer than server-side ones and they all have to scan information on your PC to protect the game from cheaters.\nThese programs are hashing scanned strings and comparing them to those of known malicious programs. No actual information about your system is ever sent or saved.\n\nPlease note that anti-cheat tools are a necessity in multiplayer games to protect you, our community, and please be assured that your privacy is important to us too. \n\nRegards,\n[NX]Dualism\n"}, "38318172": {"recommendationid": "38318172", "author": {"steamid": "76561198177587685", "num_games_owned": 87, "num_reviews": 4, "playtime_forever": 172380, "playtime_last_two_weeks": 4, "last_played": 1551151822}, "language": "english", "review": "After 2K+ hours in this game..... finally got a conclusion.\n\nFor F2P( Free To Play Users)\nPositive: Deathmatch, Achievements, Original Modes, just require only skills(aim,game sense).\nNegative: Zombie Mode mostly in Human side is P2W( Pay To Win), New,Good,Nice,Amazing,God,Overpowered Weapons = Real Money and many toxic players! \nIf you're here for fun it's ok, because this game is free. If you're here to have the \"best weapons\" NOT RECOMMEND. \n\nFor P2W ( Pay To Win Users)\nPositive: Everything \nNegative: CSNZ is smart every 6 months they add a better weapon = RIP WALLET\n\nSo in my conclusion I would say 5/10 on this game! RIP MY $$\n", "timestamp_created": 1513321142, "timestamp_updated": 1513321142, "voted_up": false, "votes_up": 64, "votes_funny": 18, "weighted_vote_score": "0.821025073528289795", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47234737": {"recommendationid": "47234737", "author": {"steamid": "76561198165623599", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 29481, "playtime_last_two_weeks": 0, "last_played": 1544871859}, "language": "english", "review": "Fuck This game they changed their server from europe to korea and they deleted all of the accounts which isnt transorted to the korea and they are not refunding it fuck this peace of this shit game.  i used to play it a lot and now all of my items are gone ALL my level is gone my ACCOUNT is gone. there is no guarantee that this wont happen again so even if you are going to play this game NO MATTER WHAT DONT BUY ANYTHİNG,DONT SPEND YOU MONEY PLEASE.\n", "timestamp_created": 1543678176, "timestamp_updated": 1543678176, "voted_up": false, "votes_up": 85, "votes_funny": 6, "weighted_vote_score": "0.848626196384429932", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41329378": {"recommendationid": "41329378", "author": {"steamid": "76561198155535517", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 2233, "playtime_last_two_weeks": 0, "last_played": 1462025073}, "language": "english", "review": "It's pay to win", "timestamp_created": 1523061575, "timestamp_updated": 1523061575, "voted_up": false, "votes_up": 93, "votes_funny": 2, "weighted_vote_score": "0.838563501834869385", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25447087": {"recommendationid": "25447087", "author": {"steamid": "76561197986983116", "num_games_owned": 58, "num_reviews": 10, "playtime_forever": 943, "playtime_last_two_weeks": 0, "last_played": 1473529051}, "language": "english", "review": "This game is 'OP', in two ways.\n\nOverpriced - The microtransactions are 'Too Expensive' and they are a 'Rip-Off'.\nOverpowered - The microtransactions makes the game 'Unbalanced' and 'Unfair'.", "timestamp_created": 1473528290, "timestamp_updated": 1473528290, "voted_up": false, "votes_up": 100, "votes_funny": 21, "weighted_vote_score": "0.853838920593261719", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12403415": {"recommendationid": "12403415", "author": {"steamid": "76561198090390466", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 9776, "playtime_last_two_weeks": 0, "last_played": 1465747839}, "language": "english", "review": "Nexon: Hey guys! You like counter-strike right? You liked the Zombie Mod for it, too? Great! We'll just tack on our p2w attitude, a bit of censorship, and terribly translated lines! We'll even stick our name on the title so you know who to ha-- I mean love!\nMe: WTF is this garbage? -420/50\n\n*** EDIT ***\n\nI am well aware I have over 150 hours on record (blame other games being on patch day).\nMy stance on the game has still not changed, but I'm in a much calmer place, at the time being, so I'll try giving it a less... ragey... review.\n\n-MINUSES-\n-The game is still very much p2w, as the best guns in the game are invariably purchasable for real money, or obtainable through the Death Star Torpedo shot that is the Decoder.\n\n-The censorship is still there, and is just as noticable to those that can understand what they're saying, which I will get to later. The chat is annoyingly filled with astrixes, even for stupid phrases that only an over-protective mum or Chinese game would want or need.\n\n-You still can't have a PROPER server, nor go to ANY server that isn't (in the scheme of things) run by Nexon. Seriously, I challenge you to find a PLAYER OR COMMUNITY HOSTED server. This has led to it being as though you were playing with bots, even with a full room.\n\n-You cannot change your name without forking over a few bucks, you know, as if this were some sort of MMO. This also applies to clan tags (or tites, as they've been turned into).\n\n-You will find the same exact 3-5 maps being repeated over, and over, and over.\n\n-There's no way to filter languarges. This is especially problematic if you don't fluently speak Spanish in the American regional servers.\n\n-Different player models have different stats, AGAIN giving an advantage to those wiling to fork money over (or who win the lottery-level luck of the Decoder).\n\n-The twice-afore-mentioned Decoder CONSTANTLY plays the 'so-and-so player you have probobly no damned clue who is has just won <INSERT OVERPOWERED WEAPON / PLAYER MODEL HERE> message, which constantly interrupts the few times when someone manages to /actually/ start up a dialogue.\n\n+PLUSSES+\n\n+It's good to fill in the nostalgia, for a few hours.\n\n+It provides the oppertunity to therapeutically punch zombies.\n\n+It's a good time waster, when everything else you play is patching.\n\n=That... really is all I can think about. Sorry guys. In the end, I wouldn't recommend this game, and I'm sorry about the saltiness in the O.P.", "timestamp_created": 1412711689, "timestamp_updated": 1463493916, "voted_up": false, "votes_up": 1705, "votes_funny": 436, "weighted_vote_score": "0.869745850563049316", "comment_count": 96, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "\"Wait, censorship?\"\n----\nAs this review has gained a lot of attention, we are aware the review touches on other subjects such as P2W. The CSN:Z Team disagrees (obviously), but a player is free to  review CSN:Z as they see fit as long as it complies with Steam's Community Guidelines for Conduct. This function is not intended for pressuring players into changing reviews."}, "43286124": {"recommendationid": "43286124", "author": {"steamid": "76561198217689012", "num_games_owned": 24, "num_reviews": 3, "playtime_forever": 23783, "playtime_last_two_weeks": 0, "last_played": 1538877194}, "language": "english", "review": "    After 400 hours of playing including more hours on another account, I have decided to write a fully detailed review of this game. I will be going over the pros and cons of Counter Strike: Nexon Zombies. This may be a long review so bear with me on this.\nI'm going to start with the pros of this game to keep this review on sort of a positive note.\n\n    Pros: One of the pros of this game is that it is absolutely free. This makes it the only game in the Counter Strike series that is actually free. But while it also being free it is the only counter strike game as far as I know with DLC. Another pro I have for this game as it sort of combines the layouts of multiple CS games prior to this. \n\n     With the core gun look coming from Condition Zero, along with the gun looks. There are a lot more looks that are borrowed from previous installments and added to this game. Adding on to the pros this game has a multitude of modes. This game is absolutely full of modes and things to play as. Which for other cs games having it only pushed to a few modes (If you don't include community maps and modes etc.) This leaves room for a lot of time to be put into this game without the ability of getting bored on paper. While this is a good thing on paper it does have some flaws which I will go over during the cons. \n    Finally the last pro would be that it has more guns than in any other cs game. Nexon went all out on this game when it came to guns. It has almost infinitely more guns and to get them all would take a great amount of time. However this is also a major con, but I will keep things positive here. The guns all have different ideas and looks to them and different purposes of said guns. Even have a lazer shooting pistol apparently made by aliens. This is something you will never find in any other CS game. \n\n     Now with all of these positives you might be thinking, \"Hey this game seems excellent, what can really be that bad about it?\". Sadly there are a lot of cons holding this game back from being amazing. I will go over them now.\n\nCons: So time to start for the first con and this is probably one of the biggest. The first con for this game would be gun balancing. I brought up in the Pros that there were a lot of guns. However there is little balancing to any of the guns. With little spray pattern to any of them. A lot of the guns either being absolutely overpowered to the point of being able to shoot through solid walls with only small damage debuffs. With other guns being to the point of being so bad they are basically unusable. The hit registration on this game is also extremely broken and nasty. Me having an uncountable of times when shots should have registered or should have hit.\n     If Nexon would decide to actually stop making more guns and try to balance all the guns to where they arent absolutely op and terrible. It would definitely improve the experience of this game. Now for the next Con this con would be the absolutely terrible system of doing things. If you are wondering what I'm referring to I'm talking about the kicking, matchmaking, and other basic elements in the game. \n    The kicking system looks like a pretty cut and clean system but what hides underneath of it is a terrible and flawed algorithm. it requires an extensive amount of votes to kick anyone and just like csgo if literally 3 people vote no on a team of around 15 the vote will cancel and the kick will fail. Now there is a matchmaking system to where you can queue for a game. However everytime I try to go in it the time it tremendously long and to be honest would just be better if it were removed and just continued the manual searching. \n    This con was personally devastating to multiple people which was the server migration. The migration in general was just messy, and terribly flawed. If you were inactive in the time of the migration all of your items every single one of them would be gone. Nexon should have allowed support tickets for any loss of items but sadly that was not the case. Another con for the game would be that new players would be forced to play against higher levels. This will often lead to a high lack of fun for newer players having their extremely underpowered base guns going against guns that can literally shoot through walls. \n\n   There are more pros and cons to this game however I will end this review on my ending note. My ending note on this game is that it has the ability to be an excellent game. It probably has the most potential of any cs game to become one of the greats. This game just really needs to be polished and edited to where guns are more balanced and everything is fixed. I am expecting great things for the ranked mode once it comes out I will edit my review once it goes live. \nThank you for reading this review, and I hope you have a good day.", "timestamp_created": 1530674503, "timestamp_updated": 1530674503, "voted_up": false, "votes_up": 104, "votes_funny": 5, "weighted_vote_score": "0.830703914165496826", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34995632": {"recommendationid": "34995632", "author": {"steamid": "76561198259424136", "num_games_owned": 9, "num_reviews": 2, "playtime_forever": 65592, "playtime_last_two_weeks": 0, "last_played": 1546787367}, "language": "english", "review": "pay to win", "timestamp_created": 1505564744, "timestamp_updated": 1505564744, "voted_up": false, "votes_up": 58, "votes_funny": 5, "weighted_vote_score": "0.772794723510742188", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38536880": {"recommendationid": "38536880", "author": {"steamid": "76561197974603542", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 1096, "playtime_last_two_weeks": 0, "last_played": 1546980970}, "language": "english", "review": "too pay2win", "timestamp_created": 1513955851, "timestamp_updated": 1513955851, "voted_up": false, "votes_up": 29, "votes_funny": 3, "weighted_vote_score": "0.729169309139251709", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37960662": {"recommendationid": "37960662", "author": {"steamid": "76561198128671106", "num_games_owned": 148, "num_reviews": 7, "playtime_forever": 633, "playtime_last_two_weeks": 0, "last_played": 1432670318}, "language": "english", "review": "Too. Many. Micro-transactions.\n\nThis game needs to be fixed.\n\nSuch a good idea seems to be wasted, just look at all this stuff that you have to pay for.", "timestamp_created": 1512072257, "timestamp_updated": 1512072257, "voted_up": false, "votes_up": 44, "votes_funny": 0, "weighted_vote_score": "0.761482417583465576", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49157714": {"recommendationid": "49157714", "author": {"steamid": "76561198074898724", "num_games_owned": 46, "num_reviews": 3, "playtime_forever": 708, "playtime_last_two_weeks": 0, "last_played": 1474751282}, "language": "english", "review": "minecraft modpacks can do better than that", "timestamp_created": 1550851410, "timestamp_updated": 1550851410, "voted_up": false, "votes_up": 27, "votes_funny": 12, "weighted_vote_score": "0.738337814807891846", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32242398": {"recommendationid": "32242398", "author": {"steamid": "76561198216687091", "num_games_owned": 6, "num_reviews": 3, "playtime_forever": 1610, "playtime_last_two_weeks": 0, "last_played": 1537373933}, "language": "english", "review": "The best game to learn spanish and turkish for free.", "timestamp_created": 1496854906, "timestamp_updated": 1496932430, "voted_up": true, "votes_up": 113, "votes_funny": 242, "weighted_vote_score": "0.812473058700561523", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35621756": {"recommendationid": "35621756", "author": {"steamid": "76561198154569346", "num_games_owned": 259, "num_reviews": 7, "playtime_forever": 87079, "playtime_last_two_weeks": 0, "last_played": 1507749308}, "language": "english", "review": "Another P2W game.", "timestamp_created": 1507654916, "timestamp_updated": 1507654916, "voted_up": false, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.705255627632141113", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17729648": {"recommendationid": "17729648", "author": {"steamid": "76561198027746348", "num_games_owned": 182, "num_reviews": 18, "playtime_forever": 8857, "playtime_last_two_weeks": 0, "last_played": 1534126060}, "language": "english", "review": "Has a builtin keylogger that if you open the gamer and close it normally. It keeps open a small program that records your keystrokes and so. I'd like you to consult the makers of this game and ask them why do they have this in their game. Becuase i don't want my club penguin account stolen, it has very expensive items on it. Also my Runescape has lots of gear that costs billions of coins, gold coins. You may think im trolling but im not. This is a serious issue, and i don't want to lose my club penguin.", "timestamp_created": 1440623581, "timestamp_updated": 1440623581, "voted_up": false, "votes_up": 187, "votes_funny": 215, "weighted_vote_score": "0.815955221652984619", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12209580": {"recommendationid": "12209580", "author": {"steamid": "76561198035226120", "num_games_owned": 550, "num_reviews": 4, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1411508262}, "language": "english", "review": "i enjoyed this game better when it was downloading", "timestamp_created": 1411508285, "timestamp_updated": 1411508285, "voted_up": false, "votes_up": 1394, "votes_funny": 1282, "weighted_vote_score": "0.831285297870635986", "comment_count": 30, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14776931": {"recommendationid": "14776931", "author": {"steamid": "76561198126926034", "num_games_owned": 202, "num_reviews": 30, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1425825616}, "language": "english", "review": "How to not make a video game:\n\n-Make one team super OP\n-Use a 17 year old game engine\n-Add microtransactions\n-Add crafting (as opposed to actually getting a weapon)\n-Make craftable weapons only last a few days\n-Make everything overpriced\n-Put in tons of camping locations\n-Re-use content from a 10 year old game\n-Your zombie is an octagon (I wish I was joking)\n-Pretend it's a horror game\n-Foggify old maps to pretend they are new\n-Make a crappy sound play every time someone dies\n-Use an over-saturated game idea\n-License a completely unrelated series\n-Put your company name in the title\n-Make it 2GB, because that's the size a game from 17 years ago is supposed to be, right?\n-Make the menus incredibly hard to understand\n-Make it free to play\n\nAnd have fun, your crappy game is complete.", "timestamp_created": 1425741223, "timestamp_updated": 1442968321, "voted_up": false, "votes_up": 1725, "votes_funny": 1371, "weighted_vote_score": "0.834519326686859131", "comment_count": 200, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13927259": {"recommendationid": "13927259", "author": {"steamid": "76561198095645233", "num_games_owned": 130, "num_reviews": 3, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1413560118}, "language": "english", "review": "i think reading the terrible reviews is so much more amusing than the game", "timestamp_created": 1420909523, "timestamp_updated": 1420909523, "voted_up": false, "votes_up": 341, "votes_funny": 385, "weighted_vote_score": "0.815403401851654053", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41265202": {"recommendationid": "41265202", "author": {"steamid": "76561198305040736", "num_games_owned": 50, "num_reviews": 7, "playtime_forever": 11098, "playtime_last_two_weeks": 195, "last_played": 1551813142}, "language": "english", "review": "P2w Af....", "timestamp_created": 1522832766, "timestamp_updated": 1522832766, "voted_up": false, "votes_up": 62, "votes_funny": 3, "weighted_vote_score": "0.73817211389541626", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12447777": {"recommendationid": "12447777", "author": {"steamid": "76561198070755173", "num_games_owned": 34, "num_reviews": 3, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1412969346}, "language": "english", "review": "At least the uninstall button still works", "timestamp_created": 1413029418, "timestamp_updated": 1413029418, "voted_up": false, "votes_up": 1347, "votes_funny": 970, "weighted_vote_score": "0.806405842304229736", "comment_count": 9, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22769903": {"recommendationid": "22769903", "author": {"steamid": "76561198110848514", "num_games_owned": 524, "num_reviews": 11, "playtime_forever": 52279, "playtime_last_two_weeks": 0, "last_played": 1540696286}, "language": "english", "review": "Alright, Its about time i give this game a review in depth. Do know before you begin reading this review that this is a very HONEST review. Even though some aspects of this game aren't the most ideal and great i do still enjoy this game till today. Please feel free to edit me if any way if i misunderstood some aspects of this game, I am always open to new ideas. Sorry for the essay guys xD!\n\nPositive:\n- Large variety of guns to select from.\n- Alot of different modes and maps to choose and play from.\n- Family and groups to hang out with.\n- Old counter strike maps to play on.\n- Have both PvP And PvE.\n- A nice story line.\n- A nice community who are willing to help out.\n- Most of the computers can run this game smoothly.\n- Alot of very active and helpful mods in this game.\n- Constant updates (There is updates every 2 weeks)\n\nNegative:\n- Requires a lot of grinding.\n- Alot of campers in this game.\n- Very loud and unbalanced sound.\n- Very unbalanced weapons.\n- Really bad graphics.\n- Game layout may be difficult for new players to navigate.\n- Many of the weapons and items you get in the game are durable.\n- There isn't alot of english players in this game.\n- Events are quite repetitive in this game\n- There are bugs in some of the maps and modes.\n\nNow lets get to the hot topic of this game.\n\nIs this game a free to play game?\n\nBefore i answer this question i just want you guys to know that this game is heavily based on luck and the following answer is based on players who are just normal players with normal luck going into the game.\n\nThis game is a free to play game if you don't mind having a bunch of durable weapons and items. Being killed by other players with better weapons. Being killed by zombies in the zombie hero mode or zombie scenario. However you can still enjoy the different modes and maps without paying a single penny! This is what you will experience if you are willing to invest in at around 15 hours into this game.\n\nThis however can be changed but it requires a large amount of grinding and a few hundred hours invested into the game. Now lemme explain the systems in this game and how it works.\n\nThis game like i said before offers a lot of durable weapons and items. However if you do want permeant weapons and don't want to pay a single penny it is still very possible. This method will require you to invest at least a few hundred hours if you are a player who has a average luck like i do. Now the ways you can earn permeant weapons are through events (Do know that many events don't offer permeant weapons), crafting, extension coupons, mileage decoders and by bingo boards. Now lemme go through briefly each of these systems.\n\nEvents:\nEvents in this game sometimes offer decoders and supreme decoders (Most are really few to nothing) and gives out weapons at times depending on the month. Some of the weapons given like the christmas weapons have a duration. Other events like the spell the weapon name event gives permeant weapons however doesn't have much of a difference compared to the default weapons (This is changed due to some new updates like the serpeant blade or the fire axe... The weapons depends on the event so if you manage to play on a good event then there are good weapons out there for you to get) Also i just want to add that Nexon is being more and more generous with the events on counter strike nexon zombies. The most recent event lets players get 10 decoders everyday for playing one and a half hour + the 3 you can get everyday and 3 you can get every week. This event will last for more than a month so you can end up with more than 400+ decoders. Nexon has also been giving out free premium decoders to the users lately which is why Nexon's events are getting better and they are being more generous.\n\nThe crafting system:\nThis system is mostly used when you complete daily missions, grind zombie kills and decomposing your weapons (Most popular one) Now to actually have a chance of even getting a permeant weapon you need to sythensize and combine your durables to 72 days - permeant. Do know that this process can fail and result you with nothing left. Now if you were lucky enough to go through that you also have to do the same with the blueprints. After all that is done you still aren't offered a 100% chance at getting a permeant craft you still have the chance to fail. From my hours and i may just have been a really unlucky guy after a few hundred hours into the game i have only crafted one permeant weapon. This is just one way to earn a permeant weapon. However you can also stack up your duration of the weapon so for example if you have dual infinity for 100 days if you open another decoder with dual infinity 100 days it will stack on top of each other untill it becomes permeant which is 999 days.\n\nExtension coupons:\nNow to earn extension coupons you can either get this from decoders or by disasembling weapons. When you disasemble weapons and if you are doing this right with a large amount of weapons you have the chance of earning a few extension coupons. When you open decoders you have the chance to win around 20 extension coupons ++ and the max you can earn i believe is around 500. With that you need to save up to 999 extension coupons with that you can then make one permeant weapon.\n\nMileage decoders:\nMileage decoders are like buying lottery or opening lottery the chances of earning permeant weapons can be scarce at times and won't get you much. If you are lucky you can get some permeant weapon at your first opening. However if you are unlucky you can open a hundred decoders and not get a single permeant weapon.\n\nBingo board:\nIn the bingo board you can pick up some really good permeant weapons. However to be able to use the bingo board you will need to open decoders which will grant you 30 to around 50 mileage points. Now you are only able to earn 3 mileage decoders a day which requires you to play a total of 3 hours. With these mileage points you can choose to reset your board to get good permeant weapons which requires 50 mileage points and changing the grand prize for 350. Now as you advance in the bingo board your opening special numbers will increase and so will opening random numbers making you need to grind and farm more for permeant weapons. In general if you are a free to play player it will require a large amount of game time and investment.\n\nWeapon upgrade event:\nWhen the weapon upgrade event comes around you can upgrade non permeant weapons into permeant weapons but with a even stronger form then its previous. This event usually brings 4 weapons that can be upgraded into the game. All you have to do is just open a few mileage decoders or craft the weapon which is quite easy if you save up alot of mileage decoders or blue prints and is another way to earn powerful and permeant weapons.\n\nIf you can endure everything i have just mentioned above, install and play away it is indeed a free to play game if done right. I just want to say that i do enjoy this game and i really like it and would recommend it to my friend. However i just wanted to do a honest in depth review of the game. I still love this game though! It is still part of my favorites! Anyway thanks for reading! I also just wanted to add that this game is getting much better and Nexon is being way more generous in the events they have recently.", "timestamp_created": 1462232725, "timestamp_updated": 1469896709, "voted_up": true, "votes_up": 71, "votes_funny": 5, "weighted_vote_score": "0.799897074699401855", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43880797": {"recommendationid": "43880797", "author": {"steamid": "76561198163377973", "num_games_owned": 94, "num_reviews": 1, "playtime_forever": 15534, "playtime_last_two_weeks": 0, "last_played": 1546206206}, "language": "english", "review": "I use to enjoy this game but now this game pisses me off so much. i'll never play it again after my account was restarted. I spent some money on the game too. I don't leave reviews for many things or get pissed off easliy but I want to warn people not to spend money on this game, you are better of actually buying counter strike instead of this piece shit game.", "timestamp_created": 1533159912, "timestamp_updated": 1533159912, "voted_up": false, "votes_up": 35, "votes_funny": 5, "weighted_vote_score": "0.720335543155670166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44280285": {"recommendationid": "44280285", "author": {"steamid": "76561198293349346", "num_games_owned": 87, "num_reviews": 15, "playtime_forever": 8842, "playtime_last_two_weeks": 0, "last_played": 1533026552}, "language": "english", "review": ">us,friends\n>played the game a bit\n>made some rly good friends in it\n>got some rly good gun,loot,bought some things,all good\n>we get bored\n>we play something else,friends left,got bored,stoped talking\n\n>1 year later\n>i remember those good times\n>i miss those friends\n>installs the game for some old times sake\n>i press play and nostalgia kicks in\n>i want to message those old friends,i wait a bit tho\n>account got whiped and all my progres and things were lost\n>probably all my friends progress too\n>uninstalls,and does not pm his old friends to not dissapoint them\n>finishes this review\nI may have only 147 hours on this game,but they were some god damn fun ones,to bad it had to come to this.I will move on eventualy but dear nexon,we would like to get a proper heads up before you kill our past.If any of the friends that i used to play this game will see this,i want to say just :See you in another game,not in another life. This is Harley King...logging off.", "timestamp_created": 1534792816, "timestamp_updated": 1534792816, "voted_up": true, "votes_up": 55, "votes_funny": 12, "weighted_vote_score": "0.787783026695251465", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12633797": {"recommendationid": "12633797", "author": {"steamid": "76561198073987650", "num_games_owned": 188, "num_reviews": 12, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1414282923}, "language": "english", "review": "You have to pay to become a woman, too realistic... 1/10", "timestamp_created": 1414283752, "timestamp_updated": 1414284071, "voted_up": false, "votes_up": 1532, "votes_funny": 1864, "weighted_vote_score": "0.812662124633789063", "comment_count": 49, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30098531": {"recommendationid": "30098531", "author": {"steamid": "76561197961154798", "num_games_owned": 257, "num_reviews": 8, "playtime_forever": 150770, "playtime_last_two_weeks": 0, "last_played": 1531336089}, "language": "english", "review": "Thank you for making the exit game button work.", "timestamp_created": 1487767806, "timestamp_updated": 1487767806, "voted_up": true, "votes_up": 80, "votes_funny": 123, "weighted_vote_score": "0.769343316555023193", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "47844793": {"recommendationid": "47844793", "author": {"steamid": "76561198156243840", "num_games_owned": 17, "num_reviews": 3, "playtime_forever": 14853, "playtime_last_two_weeks": 0, "last_played": 1545853859}, "language": "english", "review": "i won't recommand this game to anyone. Because at oneday, the gaming company decide to move their server and they somehow decide to delete their user data if they didn't send the agreement. Imaging that, when you spend hours and hours in game to obtain the games, and one day you got told that your gaming data is reseted because you didn't follow the update. Seriously? This game is trash, and i won't recommand this game to anyone.", "timestamp_created": 1545854392, "timestamp_updated": 1545854392, "voted_up": false, "votes_up": 49, "votes_funny": 12, "weighted_vote_score": "0.772917330265045166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26646286": {"recommendationid": "26646286", "author": {"steamid": "76561198202424725", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 29762, "playtime_last_two_weeks": 0, "last_played": 1527388337}, "language": "english", "review": "After playing the game for 100 hours all i have to say is this.\n\n\n\nPay to Win.", "timestamp_created": 1479400216, "timestamp_updated": 1479400216, "voted_up": false, "votes_up": 137, "votes_funny": 12, "weighted_vote_score": "0.777929246425628662", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25879428": {"recommendationid": "25879428", "author": {"steamid": "76561198151542031", "num_games_owned": 251, "num_reviews": 25, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1500188316}, "language": "english", "review": "This was the most trippy game i've played in a very long time. To sum up things, imagine Counter-Strike 1.6 with a bootleg zombie server, and make that the entire game. But to make matters worse, not only is the entire engine re-used, there's the great addition of microtransactions. If you see it, stay away from it. If you think it looks fun, stay away from it. If you like Counter-Strike, stay the HELL away from it.", "timestamp_created": 1475727250, "timestamp_updated": 1475727250, "voted_up": false, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.683707118034362793", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23466224": {"recommendationid": "23466224", "author": {"steamid": "76561198020258108", "num_games_owned": 48, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1465469899}, "language": "english", "review": "Downloaded the game and ran it. Collected my daily rewards. Tried to start the tutorial, the act of which downloaded a trojan.\n\nNot impressed.\n\nAlso constantly opens Internet Explorer (which isn't my default browser) to ask me to recommend the game to friends.\n\nI think not...", "timestamp_created": 1465469946, "timestamp_updated": 1465469946, "voted_up": false, "votes_up": 83, "votes_funny": 10, "weighted_vote_score": "0.79213482141494751", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39430791": {"recommendationid": "39430791", "author": {"steamid": "76561197960373660", "num_games_owned": 2060, "num_reviews": 1364, "playtime_forever": 60000, "playtime_last_two_weeks": 0, "last_played": 1545556944}, "language": "english", "review": "󠀡", "timestamp_created": 1516260247, "timestamp_updated": 1525236418, "voted_up": true, "votes_up": 13, "votes_funny": 8, "weighted_vote_score": "0.695290923118591309", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12208803": {"recommendationid": "12208803", "author": {"steamid": "76561197967563941", "num_games_owned": 450, "num_reviews": 96, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1411505221}, "language": "english", "review": "Nexon is the best at destroying games.", "timestamp_created": 1411505285, "timestamp_updated": 1411505285, "voted_up": false, "votes_up": 543, "votes_funny": 161, "weighted_vote_score": "0.803202450275421143", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41920334": {"recommendationid": "41920334", "author": {"steamid": "76561198004718849", "num_games_owned": 98, "num_reviews": 2, "playtime_forever": 14652, "playtime_last_two_weeks": 0, "last_played": 1525785728}, "language": "english", "review": "After 244 hours of playing with friends, my account vanished into thin air... Lost everything (skill, weapons...). I've always forgiven Nexon for the terrible mistakes of this games (glitch, crash and bad AI) but I cannot forgive this...", "timestamp_created": 1525786167, "timestamp_updated": 1525786167, "voted_up": false, "votes_up": 30, "votes_funny": 8, "weighted_vote_score": "0.714429020881652832", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39463623": {"recommendationid": "39463623", "author": {"steamid": "76561198276259380", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 146842, "playtime_last_two_weeks": 0, "last_played": 1516383529}, "language": "english", "review": "After 2 and a half years, i decided to stop this game once the new interface has been implemented.The loss of BlindFire can be seen, all of the game's staff sold themselves for the sake of making money. I can't endure this anymore, I deleted all my weapons (just for the sake of it lol) and regret the last 500 hours spent into the game. Good bye Nexon ! Hope you wake up.", "timestamp_created": 1516383860, "timestamp_updated": 1516383860, "voted_up": false, "votes_up": 33, "votes_funny": 6, "weighted_vote_score": "0.735464870929718018", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45437114": {"recommendationid": "45437114", "author": {"steamid": "76561197999043186", "num_games_owned": 950, "num_reviews": 71, "playtime_forever": 1726, "playtime_last_two_weeks": 0, "last_played": 1541149414}, "language": "english", "review": "Nice, I paid some actual money in this game for stuff and they just wipe everything.\nIt's a Nexon thing, apparently.", "timestamp_created": 1540492955, "timestamp_updated": 1540492955, "voted_up": false, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.670535504817962646", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12416194": {"recommendationid": "12416194", "author": {"steamid": "76561197980969215", "num_games_owned": 1109, "num_reviews": 40, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1414044738}, "language": "english", "review": "WOW... I thought this would be a cool version of CS and that Nexon would just throw some cool stuff in like the Zombie mod.. I was confused at first since there is zombie mods you can set on any CS game but figured they implamented some  stuff to make it cooler or did something that would make the game appealing.\n\nThis game blows so much D and Nexon looks like a joke trying to get a free ride off of CS's back!\n\nI actually played Combat Arms and enjoyed that game when it fisrt started which they added to much p2w type content on but this game is terrible to start.\n\nI saw a few cool things that might have enhanced the play but it is so glitchy and seems like a poor knockoff of CS 1.6 so I don't even want to try playing anymore.. I wanted to leave a few seconds in but stayed a complete match after having issues even getting in.\n\nThis is a huge insult to CS games, They should have just revamped Combat Arms and threw zombie mode on it or something. I really don't see how CS even allowed this to happen but I guess it gives people a free option to try out CS.. If CS wanted to get some people into them they should have just made 1.6 free and dropped the price on Source...", "timestamp_created": 1412803891, "timestamp_updated": 1412803891, "voted_up": false, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.682665348052978516", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14685968": {"recommendationid": "14685968", "author": {"steamid": "76561198103228477", "num_games_owned": 146, "num_reviews": 5, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1425098829}, "language": "english", "review": "Thank you for making the exit game button work.", "timestamp_created": 1425098857, "timestamp_updated": 1425098857, "voted_up": true, "votes_up": 1227, "votes_funny": 3377, "weighted_vote_score": "0.76819157600402832", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12215682": {"recommendationid": "12215682", "author": {"steamid": "76561198013985952", "num_games_owned": 806, "num_reviews": 4, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1411546302}, "language": "english", "review": "A bizarre, horrifying nightmare of nostalgia.\n\nThere are so many things wrong with this game that don't make sense, it introduces problems never seen in CS 1.x to give you a demented experience that's a shadow of the game it blatantly rips off.\n\n[list]\n[*] It always needs to run elevated, the first Steam game I've seen to do so, probably because it uses an exotic anti-cheat system that no one's heard of.\n[*] If you choose a name that's taken you'll get a connection terminated error that forces you to quit to the desktop. \n[*] Because of this, I now have \"Steam\" has a nickname, there's no availability check and like other gimmicky F2P titles you need to pay to change your name... probably, I don't really know or care. \"Steam\" is a perfectly okay name with me for a game I'll never play.\n[*] The interface is locked to 1024x768, regardless of your specified in-game resolution. This doesn't sound like a big deal, but it is.\n[*] The console doesn't accept most commonly used GoldSrc commands, and looks like some horrid half-assed bespoke job that was never meant to be used.\n[*] North America and Oceania are considered the same region for the purposes of matchmaking.\n[*] 250ms is considered \"Ideal\" ping.\n[*] I don't know if there are dedicated servers, but the game I just played had it's hoster switch and everyone dropped out. So, yeah, P2P CS.\n[/list]\n\nSome of what I've just mentioned may be inaccurate, but whatever, I'm still giving this review more effort than the people who rolled out this rubbish.", "timestamp_created": 1411547730, "timestamp_updated": 1411547730, "voted_up": false, "votes_up": 668, "votes_funny": 36, "weighted_vote_score": "0.783597409725189209", "comment_count": 9, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23592270": {"recommendationid": "23592270", "author": {"steamid": "76561197960362014", "num_games_owned": 162, "num_reviews": 7, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1474610409}, "language": "english", "review": "[h1] \"Detected by BlackCipher2\"\t[/h1]\n\nI do not know that this \"anticheat\" is detecting, and neither do i care. But upon searching the internet a bit, this \"anticheat\" which is apparently made by a 10 year old because its so shitty and useless, does some pretty shady and maybe not even legal stuff. For example, checking your browser history, checking browser cookies and so on.\n\nThis shitty anticheat will kick your for atleast one of the following:\n- Have a page visited which the devs dont like.\n- Use programs with a \"hooking\" feature. (Dont know what this means though)\n- Have programs like RAPTR or Overwolf installed. (NEITHER of those are cheats)\n\n\n\n\nThis couldy actually be a nice game to spend some time with, but because of that shitty cancer anticheat, which kicks you for almost everything, this can leave my library now.", "timestamp_created": 1466061504, "timestamp_updated": 1466061504, "voted_up": false, "votes_up": 100, "votes_funny": 12, "weighted_vote_score": "0.794654190540313721", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12412168": {"recommendationid": "12412168", "author": {"steamid": "76561198019341161", "num_games_owned": 69, "num_reviews": 1, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1413003259}, "language": "english", "review": "It's CS1.6 with guns from COD, zombies, airstrikes, and voice acting from 15 year olds. I have lost faith in humanity because of this game. gg.", "timestamp_created": 1412782107, "timestamp_updated": 1412782107, "voted_up": false, "votes_up": 405, "votes_funny": 133, "weighted_vote_score": "0.755868256092071533", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14336970": {"recommendationid": "14336970", "author": {"steamid": "76561198043787677", "num_games_owned": 79, "num_reviews": 1, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1423136485}, "language": "english", "review": "Clicked \"Play\" after installing and game told me \"This game requires Steam\"\n\n10/10 Would uninstall again", "timestamp_created": 1423136562, "timestamp_updated": 1423136562, "voted_up": false, "votes_up": 672, "votes_funny": 1275, "weighted_vote_score": "0.7783164381980896", "comment_count": 17, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35173503": {"recommendationid": "35173503", "author": {"steamid": "76561198391223104", "num_games_owned": 3, "num_reviews": 2, "playtime_forever": 12289, "playtime_last_two_weeks": 0, "last_played": 1516799772}, "language": "english", "review": "Well, i give this game a chance and i play it for 2-3 months, and im apsolute gone a fanatic of this game. But i realize how this game works and i lost my hope, that is not that bad how old players say. My reason is why you not gonna play this game is\n\n[list]\n[*] It's unbalanced, when the transdence weapons come to the game (transdence or buff weapons are so op) and everyone have at least one, and it's so unfear to the new players or beginer zombies.\n[*] Bad events. I mean not too bad, but if a new great challange come with the event, a piece of shit challange come with it too. Yeah two or more challenges in one event.\n[*] This game has not a big community but most of them are  9 years old, pervert, dickheads. \n[*] If an update come, a new problem come with it. I mean some players have crashes, higher ping or some forgottable bug come with the update. \n[*] Pay to win system and take a lot of time to upgrade a zombie (but i heard they gonne rework that).\n[*] And it has a lot of issues what i didn't talk about (blocking ext.) but theese are the worst.\n[/list]\n\nAnd some personal, i have 35 ping or 55 but after the update i have 65 minimum, 70 most and 200 max and it's very irritataing, i don't know why it changed. I didn't notice it in other games. \nLuckily i didn't pay much, to that crap. I mean some dudes pay 300$ to this game to buy decoders and they quit the game. What a waste of money. \n\nSo yes don't waste your time with this. But if you really, really, really wan't to play, go ahead but get ready to toxic players, ping or fps drops, magnum dildos and rages. Or the easy way is you get some ca$h and buy some decoders. This is how this game works. But i say, it's just didn't worth it.", "timestamp_created": 1506238314, "timestamp_updated": 1506238314, "voted_up": false, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.617325127124786377", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23251728": {"recommendationid": "23251728", "author": {"steamid": "76561198070545097", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 69129, "playtime_last_two_weeks": 95, "last_played": 1551057758}, "language": "english", "review": "Unless you have previous experience with games such as CSOL, you won't be able to get into this game. This game is, as most F2P game is, pay to win. The transdence decoder costs 5 dollars USD just for a 20% chance for an OP weapon... Really? I feel like this game should reward the player for playing it, not paying it.", "timestamp_created": 1464438630, "timestamp_updated": 1464438630, "voted_up": false, "votes_up": 76, "votes_funny": 11, "weighted_vote_score": "0.73901677131652832", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12208462": {"recommendationid": "12208462", "author": {"steamid": "76561197961241141", "num_games_owned": 140, "num_reviews": 1, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1411503848}, "language": "english", "review": "Horrible, before you install this, uninstall it twice.", "timestamp_created": 1411504168, "timestamp_updated": 1411504168, "voted_up": false, "votes_up": 505, "votes_funny": 539, "weighted_vote_score": "0.774615287780761719", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12409197": {"recommendationid": "12409197", "author": {"steamid": "76561198072306893", "num_games_owned": 591, "num_reviews": 34, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1418396759}, "language": "english", "review": "It is sad that this game can call itself \"Counter-Strike\".\n\nIt wouldn't be a bad game if it wouldn't be a \"Free\" to Play.\n\nAll that dumb stuff with the Crafting and Weapons for a Limited Time and In-Game Purchases with Real Money is just so annoying. It's really sad to see that this Game actually came out like this. I was excited for that Game.\n\nSorry, but no.", "timestamp_created": 1412761118, "timestamp_updated": 1418394928, "voted_up": false, "votes_up": 240, "votes_funny": 0, "weighted_vote_score": "0.746406614780426025", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12223291": {"recommendationid": "12223291", "author": {"steamid": "76561198024944410", "num_games_owned": 175, "num_reviews": 1, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1411585541}, "language": "english", "review": "Free might be too much for this game.", "timestamp_created": 1411585617, "timestamp_updated": 1411585617, "voted_up": false, "votes_up": 709, "votes_funny": 431, "weighted_vote_score": "0.746276915073394775", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33704258": {"recommendationid": "33704258", "author": {"steamid": "76561198085840127", "num_games_owned": 312, "num_reviews": 25, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1501010157}, "language": "english", "review": "Fun to play with friends.", "timestamp_created": 1500666460, "timestamp_updated": 1525727400, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.677419364452362061", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29852157": {"recommendationid": "29852157", "author": {"steamid": "76561198253159191", "num_games_owned": 555, "num_reviews": 8, "playtime_forever": 225251, "playtime_last_two_weeks": 54, "last_played": 1550697694}, "language": "english", "review": "WARNING!\nThis is an extremely P2W game!\nThere is no way for a F2P to get the latest released OverPowered* weapons for free... NO WAY!\n*By OverPowered i mean a few shots kill/win (There is even some weapons only one shot...)\n(╯°□°）╯︵ ┻━┻\nNow let's move to the resume of my long experience of playing this game:\nAfter all this is Nexon we're talking about here, which is well known for beeing very good at destroying players goodwill and faith for a game.\n- This is the most broken and unbalanced game ever, it's totally Pay to Win...\n- This is a 20yo engine right? And yet Decoders are expensive as f#@k, each decoder cost roughly 8$, yeah buddy that's right 8 f#@king Dollars... Everything in this game is overpriced. You have to make microtransactions for almost every stuff you want in the game.\n- You can't change your old shameful nickname that you first chose to register to the game without buying the \"Nickname-change\" from the in-game shop.\n- If you're F2P, it requires a lot of grinding, most of the times up to 6 months/1 year of grinding for a good weapon.\n- They removed so much features that was the only way for FREE TO PLAY users to get free stuff, like Crafting, free decoders per playing for an X amount of time...\n- Every update (which takes at least ~4hrs) is totally broken, and they need to do an Urgent maintenance, or extand it for up to 10hrs...\n- Updates are always bad af, so much worse than CSO.\n- They ruin something which was working just fine, and pretend to fix something that weren't broken in first place...\n- Bugs! Bugs and glitches are everywhere...\n- The user interface is locked to 1024x768, regardless of your specified in-game resolution. \n- They changed the old user interface by a new one that only work in other CSO regions, which they have at least ~5k players peak a day, (I'm talking here about  Matchmaking) compared to CSO, CSN:Z at best get 1500 players peak a day, which make the matchmaking useless (No one is using it anyway), most of players are using  Custom rooms.\n- Game layout is difficult for new players to navigate.\n- They merged the servers (EU, NA, SA, RU and TR) all together, so don't get shocked when you see players with 350+ ping (South Americans) teleporting all around the  map infecting people from ~5m...\n- This is the game with the most broken acheivements in Steam, they ruinned so much achievements or removed them for good, no chance now for Steam acheivements hunters  to get 100%...\n- Let's not talk about how much hard some achievements/medals to get, it's nearly impossible to get...\n- This is a 20yo engine we're talking about here (GoldSrc) and yet most decent PCs now a days can't run CSN:Z smoothly.\n- Very bad and outdated graphics compared to the required resources to play. (Note that the System Requirements shown in Store page are outdated)\n- Too heavy compared to CS 1.6, it takes so much RAM (up to 3Gb), and the CPU is always at 30% minimum, even in lobby.\n- FPS drops, server lags, freezings... You can't play without getting them, you are playing suddenly your fps drops to -15fps and comes back again to normal, or  getting 100+ping because of their sh#tty servers, the constant freez while playing especially in each round start.\n- Lets talk about the community, it's the most cancerous and toxic community in a game ever, no respect, no fairplay... they will insult you for no valid reason,  literally, just because you infect or kill someone, then they start cursing you (the worst is with a broken English) especially the Turks, they are the most Toxic  people on earth... They block you to not escallad ladders to get to a safe place to hide from zombies, just to kill you instantely when you get infected... The  community is getting even worse each day.\n- The censorship is really ridiculous, it can strike even in the middle of a word, Example: \"happened\", it'll be like this: \"hap***ed\", or \"computer\" = \"com****r\"...\n- You will find the same exact maps being played over, and over, and over...\n- Too much female characters compared to male characters (Asian gaming companies in a nutshell) ¯\\_(ツ)_/¯. The worst is you have to pay to play as a Woman, especially that there is only females as BUFF/OP characters... ლ(ಠ益ಠლ)\nI think that is all for now... Oh yeah, i hate when it constantly opens Internet Explorer (which isn't my default browser) to ask me to recommend the game to friends.\nLast but not least, stay the HELL away from this game.\nPay to play as a woman 10/10 ( ͡° ͜ʖ ͡°)", "timestamp_created": 1486832032, "timestamp_updated": 1515624449, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.652254223823547363", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32090668": {"recommendationid": "32090668", "author": {"steamid": "76561198167129851", "num_games_owned": 123, "num_reviews": 8, "playtime_forever": 4441, "playtime_last_two_weeks": 0, "last_played": 1547048996}, "language": "english", "review": "free to play but pay to win", "timestamp_created": 1496252375, "timestamp_updated": 1496252375, "voted_up": false, "votes_up": 62, "votes_funny": 6, "weighted_vote_score": "0.74228435754776001", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41779225": {"recommendationid": "41779225", "author": {"steamid": "76561198259673958", "num_games_owned": 31, "num_reviews": 2, "playtime_forever": 4840, "playtime_last_two_weeks": 0, "last_played": 1525113599}, "language": "english", "review": "this fucking idiots dint warn me that i had a time limit to acept the host migration and now my fucking account got terminated , complete waste of time and money dont play this game if you are afraid of losing evrything just because this stupid idiots dont know how to send an email warning you.", "timestamp_created": 1525113374, "timestamp_updated": 1525113453, "voted_up": false, "votes_up": 45, "votes_funny": 3, "weighted_vote_score": "0.698984861373901367", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18426936": {"recommendationid": "18426936", "author": {"steamid": "76561198003682769", "num_games_owned": 184, "num_reviews": 5, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1444565495}, "language": "english", "review": "I see what kept CS 1.6 alive all these years and that was modding. All the mods that the community worked so hard to make is what players were turning to instead of playing 5v5 dust2 matches all day. \n\nIn this game though (CS:NZ) if you want new content you have to pay. So no, your \" You don't have to buy the DLC/Microtransactions, it's optional\" arguement is not valid. I never paid for any CS 1.6 mod, that's why me and a lot of others got thousands of hours on it.\n\nEdit : Someone told me that I only played 0.2 hours so the review isn't accurate. Well, as soon as I launched the game I was drowned in microtransactions and advertisements. Taking a quick look at what those items do I realized that they aren't only cosmetics so there you go, hope you find this one useful.", "timestamp_created": 1444565453, "timestamp_updated": 1449666446, "voted_up": false, "votes_up": 187, "votes_funny": 23, "weighted_vote_score": "0.776128053665161133", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44205524": {"recommendationid": "44205524", "author": {"steamid": "76561197978516529", "num_games_owned": 242, "num_reviews": 12, "playtime_forever": 13298, "playtime_last_two_weeks": 0, "last_played": 1534502028}, "language": "english", "review": "Never play this game, or even give it a chance.\nI put 200+ hours into the game, only to sign in and see that my account deleted, looking around I found this from the devs.\n\n\"Hello\nI have sad news for you \nThere was a migration of users data from nxeurope to nxkorea. \nAnyone who did not agree to have their game data transfered got their accounts deleted.\nUnfortunately we can't recover your account and you can't get a refund.\"\n\nNo compensation or anything, no remorse. These devs are a steaming pile of shit, this is the sort of stuff I think our laws should protect against. I could care less if these people were thrown in a cell for the rest of their lives, they deserve it, lmao.\n\nOh, and fuck all the mindless fanboys who actually support this shit. I feel like they're actually being held gunpoint because the devs are that desperate for some support, or their just some alt accounts the devs made. Either way is the only logical reason I'll accept.\n\nTL:DR\nDon't waste your time with this. The developers are actually heartless bastards who love dicking people over for almost no reason, and with absolutely no remorse. These are the same kind of people who would go on a mass shooting if it meant they could get a few dollars out of it. ¯\\_(ツ)_/¯", "timestamp_created": 1534503090, "timestamp_updated": 1534503090, "voted_up": false, "votes_up": 29, "votes_funny": 6, "weighted_vote_score": "0.714121818542480469", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35641309": {"recommendationid": "35641309", "author": {"steamid": "76561198157373261", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 80971, "playtime_last_two_weeks": 0, "last_played": 1530246889}, "language": "english", "review": "THis review is for the newest patch which came out today, 10/11/2017. The patch changed it to where you can no longer (at least I have not found a way) go to whichever region you want, either europe, NA or russia for instance, this is an inconvenience to me because when I am available to play NA is dead, so I used to go on the Europe servers. On top of that there is seemingly no games open for zombie hero or anything of the sort (I'm not sure if i'm in a NA lobby or if they are all grouped together), probably because nobody else is happy about this update or it could just be bad timing. The matching system is slow and often can't find a match. The old UI worked just fine we didn't need you guys to go screwing with crap. Also we can no longer make Zombie games (not zombie hero, but zombie) in friendly fire. Also when I started playing again (after about a year break) they had a lot of new guns which interested me, however it was absolutely PAY to play. Used to you had a chance at getting good weapons by using crafting recipes (not sure when they removed that) which was good because it gave the game something more to it, you could try to get blueprints and durables to get good weapons and not have to pay; however, now it is completely pay to play.\n\nIn my opinion CSNZ is tanking (and has been recently), don't spend all your money guys they're just trying to milk this out for as long as possible instead of trying to figure out what the PLAYERS want.\n So until they fix this new piece of crap UI, I'm out. It's a shame too because the Python Desperado looked interesting.\n\nBut wait theres a plus, we can now test out weapons, good job Nexon, you did one thing right.\n\nP.S. Going to be selling my account, message me if interested.", "timestamp_created": 1507737305, "timestamp_updated": 1507737711, "voted_up": false, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.637924373149871826", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42871102": {"recommendationid": "42871102", "author": {"steamid": "76561198157747281", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 97116, "playtime_last_two_weeks": 0, "last_played": 1548377599}, "language": "english", "review": "I wasted over 1000 hours on this game. I simply do not recommend it because my account got deleted while i was away. My level-gone, items, skins (that i bought). So after that i wasted my time contacting custommer support and guess what they told me. They couldnt do anything. :) if you ever play this do it for the funs only dont waste time and dedication to their everyday quests. (OH AND ITS A PAY TO WIN BY THE WAY)", "timestamp_created": 1529487109, "timestamp_updated": 1529487109, "voted_up": false, "votes_up": 31, "votes_funny": 4, "weighted_vote_score": "0.737275898456573486", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48835805": {"recommendationid": "48835805", "author": {"steamid": "76561198356152908", "num_games_owned": 25, "num_reviews": 3, "playtime_forever": 17919, "playtime_last_two_weeks": 0, "last_played": 1549586721}, "language": "english", "review": "Im glad i didn't spend a penny on this horrible game.\nHad a lvl 64 account, with a free given AK Paladin, all gone. Not even a fookin mail was sent. \nScam developers, Scam game, Scam community. \nGo buy CS1.6 is million ways better than this piece of shit.", "timestamp_created": 1549589790, "timestamp_updated": 1549589790, "voted_up": false, "votes_up": 31, "votes_funny": 8, "weighted_vote_score": "0.690737903118133545", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12208044": {"recommendationid": "12208044", "author": {"steamid": "76561198085995057", "num_games_owned": 25, "num_reviews": 3, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1411502107}, "language": "english", "review": "> Got into the game.\n> Played the game.\n> Uninstalled.\n\n[spoiler]Seriously Nexon, what the balls is this?[/spoiler]", "timestamp_created": 1411502757, "timestamp_updated": 1411502780, "voted_up": false, "votes_up": 218, "votes_funny": 184, "weighted_vote_score": "0.716238498687744141", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35805159": {"recommendationid": "35805159", "author": {"steamid": "76561198039059732", "num_games_owned": 92, "num_reviews": 7, "playtime_forever": 10435, "playtime_last_two_weeks": 0, "last_played": 1535911495}, "language": "english", "review": "WHY DID YOU ADD MATCHMAKING? They had a insta-join lobby system based on regions and they replaced it WITH MATCHMAKING? Now you can't hop in and out of games, can't select your region and have to wait cancer que times. First TF2 now this, screw post-Overwatchism", "timestamp_created": 1508276129, "timestamp_updated": 1508276129, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.6017037034034729", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15819902": {"recommendationid": "15819902", "author": {"steamid": "76561198096899674", "num_games_owned": 8, "num_reviews": 3, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1434750441}, "language": "english", "review": "Play it not for the zombies, but because you can play oldschool CS 1.6 for free.", "timestamp_created": 1431573190, "timestamp_updated": 1431573190, "voted_up": true, "votes_up": 385, "votes_funny": 117, "weighted_vote_score": "0.775051593780517578", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36354732": {"recommendationid": "36354732", "author": {"steamid": "76561198138917780", "num_games_owned": 133, "num_reviews": 34, "playtime_forever": 327785, "playtime_last_two_weeks": 0, "last_played": 1547998317}, "language": "english", "review": "It's like a CS 1.6 modded with tons and tons of mods.\nYou can play TDM etc tho so its kinda like a free 1.6 with lots of mods.", "timestamp_created": 1510099522, "timestamp_updated": 1510099522, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.60208815336227417", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12412882": {"recommendationid": "12412882", "author": {"steamid": "76561198027065805", "num_games_owned": 187, "num_reviews": 4, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1412785304}, "language": "english", "review": "Disclaimer: COUNTER-STRIKE NEXON: ZOMBIES USES THE DATA PACKAGE FROM CONDITION ZERO, NOT COUNTER-STRIKE 1.6. THOUGH ITS THE SAME ENGINE, ITS A DIFFERENT PACKAGE. ALSO ATTEMPTING TO BRING A PRIMARILY EASTERN GAME TO A WESTERN PLATFORM WITH OUTDATED GRAPHICS IS A DEATH SENTENCE. USE YOUR HEADS BEFORE COMMENTING. \n\n\nNexon has once again taken the foundation of an old and no-longer played game and slapped their name on it with another \"catchy\" title <See Counter-Strike: Online>.\n\nThis game is absolute garbage. I've basically lost the ability to hear anything due to the level of sound that everything gives off.\nThe guns.\nThe Ladders.\nThe Zombies.\nThe \"Ambient Sound\".\nEVERYTHING. IS. LOUD.\n\nPlus, the zombies can one-hit you, the detection is terrible and the graphics (FOR A GAME RELEASED IN 2014 USING A PRE-EXISTING ENGINE) are next to god-awful.\n\n\n \n\n\"Like AVA with zombies.\" - IGN\n\nSeriously, if you are like me and don't have enough money to buy AAA games, or perhaps you're running an awful system and just want simple games to play, please, PLEASE do not bring yourself down to this level. Play Warframe. Play TF2. Don't play Counter-Strike Nexon: Zombies.", "timestamp_created": 1412785497, "timestamp_updated": 1412957413, "voted_up": false, "votes_up": 298, "votes_funny": 29, "weighted_vote_score": "0.760300040245056152", "comment_count": 19, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23858980": {"recommendationid": "23858980", "author": {"steamid": "76561198037920209", "num_games_owned": 763, "num_reviews": 564, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1467027445}, "language": "english", "review": "This was recommended to me and now I have trust issues.", "timestamp_created": 1467027832, "timestamp_updated": 1467027832, "voted_up": false, "votes_up": 68, "votes_funny": 114, "weighted_vote_score": "0.707518577575683594", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29371722": {"recommendationid": "29371722", "author": {"steamid": "76561198159234654", "num_games_owned": 1165, "num_reviews": 16, "playtime_forever": 36273, "playtime_last_two_weeks": 0, "last_played": 1542972118}, "language": "english", "review": "Counter-Strike Nexon: Zombies is a great game. I have played Counter Strike Online Taiwan for 9 years and when I moved to NA server a month ago I felt the transition was perfectly fine. The community in Counter-Strike Nexon: Zombies is great. A lot better than Counter Strike Online Taiwan. Players are nice to each other. This game was basically my childhood. Now let's get into the details of the game.\n\n[h1]Pros[/h1]\nThe game is like a game within a game. There are lots of lot modes you can play. Zombie, Zombie Scenario, Human Scenario, Classic, and much more.\nGood Community.\nThey bring CS 1.6 back to life with different modes while still having the original available to CSN:Z players.\nThey come with updates weekly which keeps the game fun and  alive.\n\n[h1]Cons[/h1]\nPeople with money have an advantage over players who don't spend money.\nI have heard that people have been banned for no legit reason without proof that they cheat.\nThe game only have a family list but there is no friends list\nCounter Strike Nexon: Zombies is slower when it comes to keeping up with new updates. It takes from 6 months to a year to be updated with Korea's and Taiwan's current CSO updates.\nZombie Hero is basically a Pay to WIn game. Whoever has the top guns in Zombie Hero (Magnum Drill, Warhammer, Dark Knight) usually gets the most kills and the highest score. (just look at my profile:P)\n\nOverall this game is fun. It was part of my childhood. It has different modes and it brings CS1.6 to life. I would recommend this game to people who love Counter Strike 1.6 but want to explore with other modes or to people who love killing zombies in general.\n\n[u]Consider Joining the Family WounDead on CSN:Z[/u]\n[u]WounDead is currently recruiting CSN:Z pros:)[/u]", "timestamp_created": 1484902568, "timestamp_updated": 1484902691, "voted_up": true, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.710775017738342285", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12451892": {"recommendationid": "12451892", "author": {"steamid": "76561198069942701", "num_games_owned": 159, "num_reviews": 8, "playtime_forever": 910, "playtime_last_two_weeks": 0, "last_played": 1414845571}, "language": "english", "review": "This game is sadly very disappointing I really tried to love this but I couldn't\n-menus are hard to navigate\n-lot's of connection errors (apparently being fixed)\n-P2W bull**** (atleast from my understanding of things)\n-in-game shop (that's a very bad sign especially in a game like C.S 1.6)\nas I said it's disappointing I really wanted this to be good but I guess we can't have nice things for free.\n", "timestamp_created": 1413048969, "timestamp_updated": 1413048969, "voted_up": false, "votes_up": 202, "votes_funny": 9, "weighted_vote_score": "0.761875748634338379", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28393168": {"recommendationid": "28393168", "author": {"steamid": "76561198266876851", "num_games_owned": 85, "num_reviews": 4, "playtime_forever": 298, "playtime_last_two_weeks": 0, "last_played": 1487680985}, "language": "english", "review": "You can skip all this zombie mumbo-jumbo and play clasicc gamemodes (death match arms race etc) (1.6 era graphics) \n(zombie mode dont suck but its not my thing)", "timestamp_created": 1481832255, "timestamp_updated": 1484042968, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.692736506462097168", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34695881": {"recommendationid": "34695881", "author": {"steamid": "76561198128201434", "num_games_owned": 4, "num_reviews": 5, "playtime_forever": 18739, "playtime_last_two_weeks": 0, "last_played": 1513890085}, "language": "english", "review": "This game used to be good until yall fucking removed the weapon crafting and synthesis system, now i have no new weapons to craft and my other weapons are about to run out of date. thanks nexon. Plus This game just turned into minecraft. uninstalled", "timestamp_created": 1504387902, "timestamp_updated": 1520189756, "voted_up": false, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.628609538078308105", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31397473": {"recommendationid": "31397473", "author": {"steamid": "76561198064270537", "num_games_owned": 70, "num_reviews": 16, "playtime_forever": 3981, "playtime_last_two_weeks": 0, "last_played": 1440107865}, "language": "english", "review": "Pay2Win.", "timestamp_created": 1493312536, "timestamp_updated": 1493312536, "voted_up": false, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.644626855850219727", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30630765": {"recommendationid": "30630765", "author": {"steamid": "76561198169227525", "num_games_owned": 82, "num_reviews": 21, "playtime_forever": 11584, "playtime_last_two_weeks": 0, "last_played": 1550380903}, "language": "english", "review": "Ahh...CZ:NZ,one of the first games i played in steam,cant describe the feeling to come back to this game after a year or two\n.", "timestamp_created": 1489992967, "timestamp_updated": 1489992967, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.60888063907623291", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19352912": {"recommendationid": "19352912", "author": {"steamid": "76561198097283458", "num_games_owned": 138, "num_reviews": 10, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1413143376}, "language": "english", "review": "Why would you play this? Imagine pouring drain cleaner into a cup of bleach and then chugging it while playing THE SECOND MOST GOD AWFUL GAME I'VE ENCOUNTERED IN SOME TIME.   \n\nThe Graphics are shit (but that's expected it is based on the older game) The sounds are LAUGHABLY BAD. The \"community\" is barely anything more than five year olds who stole their parents credit card. And the company doesn't give a rats ass about the game. THERE IS NO REDEEMING VALUE IN THIS GAME, Actually wait yes there is. If you HATE yourself and you're emo, Play this game. It'll give you another reason to uncork that bottle of bleach and chug it. Just for the LOVE OF GABEN DO NOT DOWNLOAD THIS GAME. OH DID I MENTION THAT THERE'S ALSO SPYWARE BUILT INTO THE INSTALLER? GOTTA LOVE THAT\n\nThank you for reading this, Feel free to Upvote/Downvote this review as you see fit,", "timestamp_created": 1448768001, "timestamp_updated": 1448768001, "voted_up": false, "votes_up": 1101, "votes_funny": 619, "weighted_vote_score": "0.726521670818328857", "comment_count": 73, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40751668": {"recommendationid": "40751668", "author": {"steamid": "76561198118148097", "num_games_owned": 57, "num_reviews": 14, "playtime_forever": 1606, "playtime_last_two_weeks": 0, "last_played": 1521020934}, "language": "english", "review": "This game is basically a downgraded version of Condition Zero. It uses the same models for player characters, some weapons (Scout, Krieg, AK and others), with some having improved textures, as well as the intelligent Hostage AI from CZ, with the facial animations included. However, the Hostages themselves have been dumbed down, as they never attempt to escape on their own as they did in CZ. Instead, they just stay in place (like 1.6) and move around like CZ when following a CT. They don't return to their spawnpoint either when threatened by a T.\n\nIn terms of weaponry the game doesn't have the Tactical Shield, which is known to be in both CZ and 1.6, probably removed so they can sell it or something. The weapon favourites from CSS make an appearance in CSNZ as well, except they're 5 shared for both teams, rather than 4 for each team (which totalled in 8). The buy menu Packages from are completely absent. There are new weapons added such as different melee weapons and pistols, but these were NOT balanced correctly.\n\nThe AK-12, for instance, is literally an AK-47 with a huge magazine and the same recoil pattern, except 3 times smaller. And the price in the buy menu? Stays the same. It also felt like the damage output was greater, but I can't confirm that. Other weapons, such as the Hammer, are outright useless. Shooting the P90 in CSNZ feels like shooting a bloody pea shooter. It's weak, inaccurate, and the most expensive SMG.\n\nThen comes in the character models. The females are always 10 times more expensive than males, and it makes sense why that is the case. Not only are the hitboxes smaller, but the skins all look the same in-game, so you can't confirm what is an enemy and what is a friendly unless you look at the radar, which takes much more time than just looking and shooting. This makes the game impossible to play.\n\nBot matches are included, and while you can play on them, the bots are braindead and easy to kill in droves. Not only that but the friendlies NEVER SHUT UP. It's the most annoying thing ever. Oh and the game allows people to keep spamming you invitations to their server rooms which is just annoying as all hell.\n\nThe tutorials don't teach you nearly enough for you to be able to play the game. It's just movement and basic stuff, no practice other than the Bot matches you can do outside of the tutorial.\n\nZombie mode is the worst part of the game. Don't even bother.\n\nSo why do I recommend this game, even after defecating on it thoroughly? Because, overall, as a free alternative to proper Counter-Strike games, it serves it's purpose. If you have CS:CZ, it's a downgrade. If you have CS 1.6, you're not missing out on much. Just stick to the main series games and forget this game even exists.\n\nEDIT: The game maxes out your mouse sensitivity whenever you open it, and doesn't revert it back to where it was. It also crashes from time to time. In my 3.7 hours, it crashed 5 times.", "timestamp_created": 1520801979, "timestamp_updated": 1520805159, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.612291812896728516", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38357668": {"recommendationid": "38357668", "author": {"steamid": "76561198137877583", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 1143, "playtime_last_two_weeks": 0, "last_played": 1437700945}, "language": "english", "review": "This game is a massive micro-transaction with a large amount of players who play to win. Making it virtually unplayable for anyone who doesn't want to pay out money to have fun on a free game. The worst part is - is that it has so much potential, but falls apart on the internal workings.", "timestamp_created": 1513450796, "timestamp_updated": 1513450796, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.631926536560058594", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12486540": {"recommendationid": "12486540", "author": {"steamid": "76561197984829934", "num_games_owned": 264, "num_reviews": 7, "playtime_forever": 22475, "playtime_last_two_weeks": 0, "last_played": 1547125911}, "language": "english", "review": "It's basically CS Online re-marketed to the Western audiences. If you've played it, gameplays remain the same except for some GUI tweaks and minor changes. \n\nNexon constantly listens to players suggestions on the forums which helps them to improve the game over time.\n\nAnd remember to disable any unnecessary programs before running CSN:Z; you don't want HShield come biting you in the bum.", "timestamp_created": 1413281245, "timestamp_updated": 1413281245, "voted_up": true, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.618450820446014404", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43890995": {"recommendationid": "43890995", "author": {"steamid": "76561198067640883", "num_games_owned": 152, "num_reviews": 9, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1533213461}, "language": "english", "review": "Don't waste your time like I did mines\n\npros:\n>Weird looking guns and cool animations on the weird looking guns\n>cs:s feel to it\n\nCONS:\n>constantly spawns zombies running toward you\n>bosses have unblockable/undodgeable attacks\n>pay to win\n>guns have an EXPIRATION DATE. Just like real life\n>ai has john wick aim\n>spongy af enemies unless you PAY WITH REAL CASH for a better weapon\n\nJust don't install it. It may be free but time isn't", "timestamp_created": 1533213739, "timestamp_updated": 1533213739, "voted_up": false, "votes_up": 27, "votes_funny": 12, "weighted_vote_score": "0.69413989782333374", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12220387": {"recommendationid": "12220387", "author": {"steamid": "76561198056983075", "num_games_owned": 361, "num_reviews": 344, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1411573824}, "language": "english", "review": "One sh*tty game.", "timestamp_created": 1411573839, "timestamp_updated": 1470047352, "voted_up": false, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.533716142177581787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37957609": {"recommendationid": "37957609", "author": {"steamid": "76561198204695347", "num_games_owned": 32, "num_reviews": 7, "playtime_forever": 1423, "playtime_last_two_weeks": 0, "last_played": 1495373750}, "language": "english", "review": "minecraft 2.0 looks nice, oh wait...", "timestamp_created": 1512063118, "timestamp_updated": 1512063138, "voted_up": true, "votes_up": 24, "votes_funny": 68, "weighted_vote_score": "0.676149547100067139", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17238836": {"recommendationid": "17238836", "author": {"steamid": "76561198137983877", "num_games_owned": 1967, "num_reviews": 37, "playtime_forever": 6738, "playtime_last_two_weeks": 0, "last_played": 1465316953}, "language": "english", "review": "ahmm, i was so afraid to try this game when i saw all those negative reviews O.o\nbut, i'm glad i did .. as a counter-strike 1.6 player i like this game so much\nit's not pay 2 win, you just need to have some skills, there is a lot of new & cool weapons (tbh there is many crappy guns too :p) & a lot of fun mods, there is Families and Clans (but sadly i can't find any \"english speaking\" one on EU servers).\ni like the missions idea but it's still needs a lot of work, i found some bugs but it's not a big deal, i have good ping most of the time (80~60), no lag & i still can play the original 1.6 mod here & ofc it's free :D\nwhat i hate about this game ? the main menu is stuck in a 4:3 resolution (this is really sucks) & it's banned on some countries, some mods are boring/buggy (like when you play soccer sometimes the ball stuck & you can't do anything \"you can't win or lose, just leave the room\") the guns are for limited time, you have 0.001 (not really but i feel it like that) chance to get a permanent one (this sucks too), & the vote kick was removed so ...\ni won't speak about graphics bcs i'm a cs 1.6 player ! it's not bad for me, i like it !\nanyways, i recommend this game only to players like me, it's a really nice game\nand remember : don't judge it regarding to the bad or good reviews, you need to try it by yourself first\nPs: i know many will thumb-down this review :/ pls don't ..", "timestamp_created": 1437933430, "timestamp_updated": 1440361530, "voted_up": true, "votes_up": 756, "votes_funny": 84, "weighted_vote_score": "0.750419318675994873", "comment_count": 22, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12210139": {"recommendationid": "12210139", "author": {"steamid": "76561198027889280", "num_games_owned": 260, "num_reviews": 35, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1411510673}, "language": "english", "review": "It's like Counter Strike but with everything you don't want to see in a CS game.", "timestamp_created": 1411510733, "timestamp_updated": 1411510733, "voted_up": false, "votes_up": 84, "votes_funny": 21, "weighted_vote_score": "0.676807820796966553", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12682076": {"recommendationid": "12682076", "author": {"steamid": "76561198042348746", "num_games_owned": 82, "num_reviews": 6, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1414540424}, "language": "english", "review": "it un-installs really fast! give it a go!", "timestamp_created": 1414592285, "timestamp_updated": 1414592285, "voted_up": false, "votes_up": 614, "votes_funny": 653, "weighted_vote_score": "0.747617065906524658", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43652253": {"recommendationid": "43652253", "author": {"steamid": "76561198123542069", "num_games_owned": 26, "num_reviews": 4, "playtime_forever": 35, "playtime_last_two_weeks": 0, "last_played": 1532102790}, "language": "english", "review": "Im gay", "timestamp_created": 1532132243, "timestamp_updated": 1532132243, "voted_up": true, "votes_up": 423, "votes_funny": 228, "weighted_vote_score": "0.713162004947662354", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12219321": {"recommendationid": "12219321", "author": {"steamid": "76561198043782587", "num_games_owned": 1615, "num_reviews": 500, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1411568421}, "language": "english", "review": "Do you remember zombie mods that popular games with multiplayer were getting?\nYou know, the ones where win tactic for humans is to camp in one single spot, shooting out the only way to get here, while winning tactic for zombies is just to tank it up with no skills requierements.\nWhere neither of those tactics are particulary fun.\nWhere you have usual camping and escape (camping with running) maps.\nWhere zombie teams almost always win.\n\nNow comes to your Steam with some shop and missions fancyness.\n(It also gives me Zombie Horde deja vu)", "timestamp_created": 1411569427, "timestamp_updated": 1411569427, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.544749081134796143", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17063596": {"recommendationid": "17063596", "author": {"steamid": "76561198153224891", "num_games_owned": 1686, "num_reviews": 113, "playtime_forever": 3174, "playtime_last_two_weeks": 4, "last_played": 1551804257}, "language": "english", "review": "[h1]Advantages[/h1]\n✔ Has alot of weapons to choose from - some has abilities on it\n✔ Alot of game-modes to play\n✔ Daily rewards -  lots of ways to get decoders\n✔ Clan(Family) You can clan war vs other clans\n\n[h1]Disadvantages[/h1]\n✖ Game has alot of lags/ping and it is unplayable...\n✖ Recoil is garbage - Even if you are trying to 1tap someone in the head it just misses the head\n✖ Hitbox is garbage either\n✖ Can't choose region - ping is garbage - unplayable *Also as i have seen - it is not only me*\nProbably thier servers are stored in africa so everyone has tons of ping\n✖ There are p2w weapons like Cyclone that if you get hit by it you just freeze and can't move", "timestamp_created": 1436982867, "timestamp_updated": 1527513434, "voted_up": false, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.643265962600708008", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44105556": {"recommendationid": "44105556", "author": {"steamid": "76561198116674232", "num_games_owned": 95, "num_reviews": 4, "playtime_forever": 12661, "playtime_last_two_weeks": 0, "last_played": 1543292786}, "language": "english", "review": "Shitty game deleted my former account that many of the powerful weapons in the game, also the ping now is ridiculous.", "timestamp_created": 1534110601, "timestamp_updated": 1534110601, "voted_up": false, "votes_up": 13, "votes_funny": 4, "weighted_vote_score": "0.624908149242401123", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29024056": {"recommendationid": "29024056", "author": {"steamid": "76561198189788545", "num_games_owned": 17, "num_reviews": 7, "playtime_forever": 45399, "playtime_last_two_weeks": 0, "last_played": 1545709008}, "language": "english", "review": "Okay let me get this clear why you should download this game and their difference to CS 1.6....\n-Counter-Strike Nexon: Zombies is just a Steam port of Counter-Strike Online. Basically, a Westernized version of CSO. \n-Both run on GoldSrc but the latter is updated over time with new game modes, maps, characters, weapons and skins.\n-Yes, it's localized in several languages including Turk, Russian, Spanish, etc.\n\nNow to answer OP's question. * If you were to take a look at the reviews first, you'll see the amount of hate posted by people. The main keyword behind this is \"Nexon\" which has gained notoriety for cramming P2W elements in their games. However! I advise you not to simply judge it just by the pictures and the reviews (obviously). Now off to the differences:\n\n[h1] [b] CS1.6\t[/b] \n-Valve\n-Play with community-made contents (skins, maps)\n-Your custom skins don't work on sv_pure 1 servers\n-Still lots of people playing it over CSN:Z\n-Valve Anti Cheat (system ban)\nUnless you play on custom servers, you just stick with the default no-nonsense weaponry and characters\n\n[b] CSN:Z\t[/b]\n-Nexon SARL (permission from Valve)\n-Play with Nexon-made contents (occassionally player-made)\n-Your purchased/ crafted items work on servers as long as you don't get banned\n-Lesser player count than CS1.6 but it's because of it not receiving good response thanks to its name\n-Nexon HackShield + Game Security (no system bans, but Nexon bans based on community-submitted reports)\n-Although room hosts can opt for CS1.6 contents, gameplays mostly revolved around custom weapons, skins and maps\n\t[/h1]\n\nNow both are double-edge swords. While people still love the originality of CS1.6, CSNZ provides a different style of gameplay in addition to CS1.6 contents. It offers new maps, gameplay, skins and weapons that players could explore and enjoy.\nCSN:Z no doubt has its own cash shop that allows players to make (optional) purchases but Nexon has altered the formula to be more generous for Western players. For instance, giving players 10 free decoders (think of CSGO's weapon cases + keys) daily for more than a month. In total, you have over 300 of them without the need to fork out a cent.\n", "timestamp_created": 1483585053, "timestamp_updated": 1483585053, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.704863369464874268", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16538888": {"recommendationid": "16538888", "author": {"steamid": "76561197970890310", "num_games_owned": 82, "num_reviews": 1, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1411571594}, "language": "english", "review": "the name Counter-Strike is misleading because this game has nothing to do with Counter Strike. Gig Shit!", "timestamp_created": 1434759333, "timestamp_updated": 1434759333, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.605663418769836426", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39752219": {"recommendationid": "39752219", "author": {"steamid": "76561198173087786", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 1720, "playtime_last_two_weeks": 0, "last_played": 1468161754}, "language": "english", "review": "Man this game was fun ages ago when I didn't have csgo but lmao wtf happened to this", "timestamp_created": 1517421472, "timestamp_updated": 1517421472, "voted_up": false, "votes_up": 20, "votes_funny": 6, "weighted_vote_score": "0.65066230297088623", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23046508": {"recommendationid": "23046508", "author": {"steamid": "76561198058725264", "num_games_owned": 53, "num_reviews": 5, "playtime_forever": 9677, "playtime_last_two_weeks": 0, "last_played": 1465824463}, "language": "english", "review": "This is an abomination. Terrible game with trash community and you will barely find someone who speaks English but when you do he's going to curse at you. If you want to get the good weapons you'll have to spread your wallet wider than a woman spreading her legs when she's giving birth. Terrible pay to win game.\nIf you want to craft a permanent weapon...GOOD LUCK.\n\n-It used to have missions that rewarded you with decoders and you had a fair chance at winning a permanent weapon but they removed them because apparently there were people who abused it. So instead of actually fixing the problem they just showed us how not to deal with it and removed them from the mission rewards. Now you will have to waste 3 hours of your precious time in this terrible excuse of a game so you can get 3 decoders.\n\n- you can play bingo for nice rewards. But now that you can barely get any points from the decoders it'll take you months to actually get something. Did they really think this through? I don't think so...or maybe they just didn't care.\n\n-Some skins are terrible. They blend in with some walls and you can barely see them from a far. Add a little bit of lag and you have it.\n\n-Who in their right mind wakes up and says \"I'll make an invisible zombie that is able to jump high\"? Fire that guy.\n\nBut we know that the reason is most likely so people would buy the decoders from the store. If they really valued their players they would do that but what do you expect from a game made to grab cash.\n\nI regret every second I spent on this and I am here to help you guys so you won't do the same mistake. Do you see the amount of hours I spent on the game? This is the amount of times I had to get exorcism so I could get this abomination out of my system.", "timestamp_created": 1463528994, "timestamp_updated": 1463572723, "voted_up": false, "votes_up": 35, "votes_funny": 13, "weighted_vote_score": "0.691111445426940918", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35729801": {"recommendationid": "35729801", "author": {"steamid": "76561198257104060", "num_games_owned": 130, "num_reviews": 8, "playtime_forever": 4943, "playtime_last_two_weeks": 0, "last_played": 1542495769}, "language": "english", "review": "It´s fun to play but it´s pay to win and unfair.", "timestamp_created": 1508016186, "timestamp_updated": 1508016186, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.593474268913269043", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23379854": {"recommendationid": "23379854", "author": {"steamid": "76561198059162315", "num_games_owned": 557, "num_reviews": 89, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1420723326}, "language": "english", "review": "Nexon.\nAll you need to know.\nIf you look up \"Pay 2 Win\" in the dictionary, you'll see their logo.", "timestamp_created": 1465046329, "timestamp_updated": 1465046342, "voted_up": false, "votes_up": 152, "votes_funny": 111, "weighted_vote_score": "0.700277149677276611", "comment_count": 31, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33428641": {"recommendationid": "33428641", "author": {"steamid": "76561198200743694", "num_games_owned": 61, "num_reviews": 6, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1436881091}, "language": "english", "review": "free football game\n\n\n 10/10 would play again", "timestamp_created": 1499686595, "timestamp_updated": 1499686595, "voted_up": true, "votes_up": 47, "votes_funny": 23, "weighted_vote_score": "0.669993042945861816", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12206465": {"recommendationid": "12206465", "author": {"steamid": "76561198043050565", "num_games_owned": 215, "num_reviews": 4, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1419649213}, "language": "english", "review": "This game gave me ebola.", "timestamp_created": 1411497695, "timestamp_updated": 1413782853, "voted_up": false, "votes_up": 49, "votes_funny": 59, "weighted_vote_score": "0.612379848957061768", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12403426": {"recommendationid": "12403426", "author": {"steamid": "76561198020275445", "num_games_owned": 2579, "num_reviews": 53, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1412711434}, "language": "english", "review": "I haven't laughed about how a game can be so bad for a long time.", "timestamp_created": 1412711757, "timestamp_updated": 1412711757, "voted_up": false, "votes_up": 693, "votes_funny": 129, "weighted_vote_score": "0.693395614624023438", "comment_count": 22, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12732779": {"recommendationid": "12732779", "author": {"steamid": "76561198001365388", "num_games_owned": 103, "num_reviews": 11, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1414880086}, "language": "english", "review": "The zombies will be back but I won't.", "timestamp_created": 1414880323, "timestamp_updated": 1414880323, "voted_up": false, "votes_up": 553, "votes_funny": 567, "weighted_vote_score": "0.712153077125549316", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12583057": {"recommendationid": "12583057", "author": {"steamid": "76561198035451882", "num_games_owned": 352, "num_reviews": 22, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1413754792}, "language": "english", "review": "Counter-Strike Nexon: Zombies is dissapointing.\n\nPROS:\n - Updated Graphics\n - More guns\n - Survival Mode\n\nCONS:\n - Unbalanced Zombie mode\n - Pay 2 win\n - Time consuming\n\nOVERVIEW:\n     CSN: Zombies just doesn't live up. I can't tell if this game is trying to be a Call of Duty rip-off or not. Dead serious. In CSNZ, you can partake in multiple gamemodes that you feel you want to play. There's Original, which is basic CS 1.6. There's different kinds of Zombie modes, but I only played one. I had a huge problem with this Zombie mode. It is WAY too unbalanced. A CT has 100 HP, and can be turned into a Zombie in 1 hit. A Zombie has 2000 HP (with the exception of the 7000 HP host zombie) and can take a LONG time to kill. This game is a grindfest. I only won 2 rounds as Humans due to hiding. The last mode I want to talk about is Survival. This game should have never been called Zombies. It should've been about this Survival mode, because it is the best thing in this game and the only reason i'd go back to play (besides playing with new guns in Original mode). In Survival mode, it's purely you and your teammates and whatever cash you can scavenge. Waves of different kinds of HUMAN enemies will try to kill you. Regular gunmen, big ass armored soldiers with miniguns, Survival has it all, including a Boss battle at the end of each one. As you kill more and more soldiers you can buy bigger and better guns and equipment. Survival missions technically have a story line, but you will be more inveloped in the gameplay than someone who only gives lines during the middles of waves. It can become really chaotic and what balances this factor out is a super quick regeneration system. It's just like CoD. Hide back and wait, but it only takes a couple of seconds. Normally, this kind of thing doesn't go good in my book. I've always thought regenerating health as a character was kind of a cheat. The way I prefer it is how it works as a pickup in Quake. But it works with Survival mode. It fits right in and makes the mode so much more fun.\n\nNow that i'm done with the gamemodes. Let's move on to the rest of the game. There is a shop to buy things with your points you've collceted for either playing for an extended amount of time or for completing a mission or match. Now this isn't a problem. You may want to buy new guns with these points. Oh wait. YOU CAN't. THERE ARE NO SINGLE GUNS LISTED IN THE SHOP. ONLY THING AVAILABLE IS WEAPON PACKAGES THAT COST REAL USD. I can't overexagerate how stupid companies are when they place a pay 2 win system in their games. And these guns can be seriously overpowered in some matches. It really shows that games like these don't care about your experience, but your money.\n\nLet me explain my overall gameplay feeling. I can't enjoy Zombie mode, so i'm gonna skip that. Original mode is actually not all that bad. At first I was confused, but it was a quick adjustment. I think Original mode allows for players to pick up new guns they bought and try to test them against other players, to see if it was really worth the purchase. You can play on all the old CS 1.6 maps, including dust2 and italy, And with the game's updated player graphics, it actually feels really nice. Survival mode is amazingly fun and the only reason you should actually sit down and play this game.\n\nI don't recommend this game. Only because of it's poor Zombies mode, which is how the game was advertised, and because of the Pay2Win system. If this game got rid of some things, it'd be a fun addition to the CS series, but I can't find all my fun in it. Yes, Survival is great and all, but that doesn't mean i'm gonna sit there 24/7 gunning down massive waves of enemies. Counter-Strike Nexon: Zombies tries it's best to fit in with the rest of the franchise, but some factors just kick it to the curb.\n\n*UPDATE* (As of 10/26/14)\nI've read peoples messages, comments, etc. And all I keep finding is the complaint of needing to play for more than an hour before writing a review. First off, I played a good 50 minutes. Sorry if I was 10 away from the 1 hour mark. Second, I don't remember the point where playtime resulted in a fun game. If there are so many reviews on this game, with low playtime, wouldn't that hint you that it wasn't an overall enjoyable experience, causing us to put down the game?\n\nI'm still sticking with all my points. I really don't see any reason to change what I feel about them. The game dissapointed me, so I only sat through 50 minutes of it. I have more fun playing L4D2 than this.", "timestamp_created": 1413814547, "timestamp_updated": 1414356542, "voted_up": false, "votes_up": 219, "votes_funny": 14, "weighted_vote_score": "0.773306667804718018", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12716252": {"recommendationid": "12716252", "author": {"steamid": "76561198061510350", "num_games_owned": 247, "num_reviews": 93, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1413265262}, "language": "english", "review": "You shoot boxes for ten minutes so you can advance to the next pile of boxes to shoot for ten minutes", "timestamp_created": 1414798905, "timestamp_updated": 1414798905, "voted_up": false, "votes_up": 300, "votes_funny": 199, "weighted_vote_score": "0.714492559432983398", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12225057": {"recommendationid": "12225057", "author": {"steamid": "76561198054745951", "num_games_owned": 300, "num_reviews": 7, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1411596147}, "language": "english", "review": "Tragic and tired, Counter-Strike Nexon: Zombies looks like it was launched 2 generations to late.  Overall game design is poor & amature with little to no polish.  Not worth to even try.", "timestamp_created": 1411594733, "timestamp_updated": 1411594733, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.614035129547119141", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35518084": {"recommendationid": "35518084", "author": {"steamid": "76561198409516734", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 16379, "playtime_last_two_weeks": 0, "last_played": 1518597938}, "language": "english", "review": "A lot of P2W aspects unless you stick with Original/Basic mode. NA server is barely ever populated, and when it is most people have 100-400 ping. Euro server is almost always populated, you have better chance of getting a game with everyone at a decent ping.\n\nGame is going to be dead soon, regularly peaks at around 2k while 1.6 peaks at 15k+. Play the real thing for the full, unregulated CS experience. This game is just a money sink for Nexon.\n\nWith that said, it can still be a decent CS experience if you can look past the many flaws it has.\n\nEdit: They changed the servers and added one universal channel. You can use a matchmaing feature, but most people use the custom games tab for the old room list. I'm not sure if it's still connecting to Nexon servers or P2P.\n\nEdit 2: The new matchmaking still uses Nexon servers, but uses the host's closest Nexon server.", "timestamp_created": 1507295845, "timestamp_updated": 1512423261, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.60000002384185791", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12220391": {"recommendationid": "12220391", "author": {"steamid": "76561198057988894", "num_games_owned": 142, "num_reviews": 42, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1422598010}, "language": "english", "review": "No...", "timestamp_created": 1411573866, "timestamp_updated": 1411573866, "voted_up": false, "votes_up": 19, "votes_funny": 3, "weighted_vote_score": "0.588867723941802979", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13511480": {"recommendationid": "13511480", "author": {"steamid": "76561198088066392", "num_games_owned": 219, "num_reviews": 6, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1415202905}, "language": "english", "review": "Pretty good game if you want to kill yourself", "timestamp_created": 1419207547, "timestamp_updated": 1512170781, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.624332129955291748", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34270087": {"recommendationid": "34270087", "author": {"steamid": "76561198204023548", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 47338, "playtime_last_two_weeks": 0, "last_played": 1505157936}, "language": "english", "review": "its aight", "timestamp_created": 1502862493, "timestamp_updated": 1502862493, "voted_up": true, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.596224427223205566", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12858357": {"recommendationid": "12858357", "author": {"steamid": "76561198102063164", "num_games_owned": 297, "num_reviews": 14, "playtime_forever": 3052, "playtime_last_two_weeks": 0, "last_played": 1537781382}, "language": "english", "review": "I haven't launched this game in a while and after noticing that my friend's account has been wiped after being inactive for a bit, I went to check if my account is still there too.\n\nAs it turns out - my account has also been completely wiped from the game's system. If that's how you treat returning players just because they haven't played your game in a year or two, then honest to god - 𝐟𝐮𝐜𝐤 𝐲𝐨𝐮 𝐍𝐞𝐱𝐨𝐧. That's one way to drive away players from ever playing your game again.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=1521617129", "timestamp_created": 1415526310, "timestamp_updated": 1537781529, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.611940324306488037", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22041045": {"recommendationid": "22041045", "author": {"steamid": "76561198145239905", "num_games_owned": 612, "num_reviews": 184, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1458908518}, "language": "english", "review": "Thank you for making the exit game button work.", "timestamp_created": 1458908525, "timestamp_updated": 1458908525, "voted_up": true, "votes_up": 14, "votes_funny": 18, "weighted_vote_score": "0.614473819732666016", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 6370, "total_negative": 5175, "total_reviews": 11545}}
