{"reviews": {"49028936": {"recommendationid": "49028936", "author": {"steamid": "76561198064067008", "num_games_owned": 37, "num_reviews": 6, "playtime_forever": 4447, "playtime_last_two_weeks": 0, "last_played": 1545286662}, "language": "english", "review": "Fallout 4 improves significantly over its predecessors in terms of gunplay. Movement and gun usage feel organic and satisfying, closer to what one would expect in a FPS game. The crafting mechanic is also greatly expanded compared to previous games, with the ability to craft modifications for weapons and armour, adding to the immersion of the game. Crating also plays an important role in the new settlement mechanic, where furniture, farms, walls and defences can be built around certain areas. This is a welcome and interesting step that adds variety to the game. \n\nWhile it is more satisfying to use guns in Fallout 4, gameplay is significantly hampered by how cluttered environments can seem. The fact that everything, from screwdrivers to coffee cups, can be potentially needed in crafting encourages a hoarder-like gameplay where every single container is checked. This significantly slows down the pace of gameplay and interrupts the process of being able to appreciate the environment. Complicating this is the prevalence of special loot,  which are often hidden in unassuming places. They often offer permanent character upgrades, making it unpalatable to miss them, yet the cluttered areas in Fallout 4 make it a nightmare to comb for them. \n\nCompared to previous games, the lighting and general environment of Fallout 4 are a lot brighter, making the world a lot more appealing to play in. However, exploration quickly becomes tiring when one realises that settlements are extremely rare, with new areas usually resulting in more enemies to fight, rather than new characters to meet. Even then, the amount of interactions offered with settlers is very limited and disappointing.\n\nDialogue in Fallout 4 is bad. Options are summarised and presented in a wheel, and can often be misleading in terms of what the character actually says. The choices themselves tend to be fairly limited, as are the opportunities to meaningfully define the identity of the character through what they say. A lack of meaningful dialogue is also seen in the poor development of NPCs in Fallout 4, as there is usually little opportunity to discuss their background or ideas.\n\nWhile there is an attempt by Bethesda to create morally 'grey' choices in the game, with all factions having some form of negative, this does not succeed in creating meaningful narrative choices because the factions (and the ideas they represent) are poorly created. Often it seems that the 'negatives of a faction are shoehorned in just for the sake of having moral 'greyness'. This is most evident for the Institute, which just seems to be a trope of 'science gone wrong without limits'. If there were more opportunities to talk with NPCs, and perhaps understand how the ideology of a faction might be flawed, the themes and choices in Fallout 4 would seem a lot more meaningful as they would be more well developed.\n\nQuests in Fallout 4 have an even more overbearing feel of 'fetch quests' where something is reached or retrieved at a location after killing the enemies in the way. While it is true that most quests in RPG games, when boiled down, are fetch quests, this is usually hidden by adding multiple stages to the quest, as well as layers of interesting scenarios, environments and characters. The fact that quests in this game seem so much like fetch quests is testament to how poorly the previously mentioned factors are done. \n\nOverall, many of the core elements of Fallout franchise (dialogue, choices, themes) are poorly done in Fallout 4.\n\n\n\n", "timestamp_created": 1550320297, "timestamp_updated": 1550320297, "voted_up": false, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.580836832523345947", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49194358": {"recommendationid": "49194358", "author": {"steamid": "76561198060527161", "num_games_owned": 364, "num_reviews": 31, "playtime_forever": 2270, "playtime_last_two_weeks": 117, "last_played": 1550880524}, "language": "english", "review": "Fallout 4 should be a fine game, yet I'm probably 1/10th the way through the story and 1/3 the way through the game's content and I can't bring myself to keep playing.\n\nAs a shooter, it's fine. There's nothing necessarily wrong with it, but it's not fantastic. Enemies are more interesting than in previous games, since they have better AI and unique abilities. The first time I saw mole-rats jump out of the ground was fantastic.\n\nThe settlement builder is fine. Buildings, resources and the systems at work make sense. You can ignore settlement raids if you don't want to deal with them. And building a base from which you can do all your crafting and is reasonably well-defended doesn't take much time, effort or thought. \n\nIt does neither of these well, though. There's nothing compelling about either the shooting or the settlement building.\n\nAs far as story goes, it's been okay so far. Nothing we haven't heard before, but better than an excuse plot. The companions are a total upgrade from previous Bethesda companions, having better personalities and more interesting and unique things to say at unique locations. It makes them more interesting to travel with, and it's the first time I actually cared to have companions with me in a Bethesda game, so I gotta give them props for that.\n\nUnfortunately, this game suffers from what I'd call Unfocused Mechanic Syndrome. It wants to be open-world, an FPS, an RPG, and tell a specific story. Unfortunately, I think they ran into limitations on what they could realistically put into the game, and ended up gutting some of the RPG elements so they could include things they thought would be cool. \nLike the weapon mod system. Great idea on paper to be able to take your weapons and mod them yourself so you can play the game the way you want - have an excess of 10mm ammo? Make your stealthed pistol into an uzi with a drum mag! \nUnfortunately, it ends up making all weapons feel the same with about 5 variations depending on your goal - short-range DPS (usually a shotgun or machine gun), long-range DPS (a rifle), short-range silenced, long-ranged silenced, or missiles. \nYep.\nThere's no more unique weapons or weapons with interesting effects because you've basically been given a few guns with sliders on them and told to make them the way you like them. Some of them are straight-up more powerful than the others, but if you want to use your plasma sniper rifle as a machine gun, you can. Sounds great on paper. Makes finding new weapons feel as boring as pumping a 'strength' stat.\nIn short, they traded unique weapons for player customizibility.\n\nCharacter leveling, too. They locked a bunch of mechanics behind the 'perks' you need when you level up, and made many of the others straight boosts to a certain kind of weapon damage. Sounds fine on paper. But with no changes in game mechanics to alter how you play the game, just the damage you do or if you can pick that lock, it makes the game feel the same whether you're level 7 or level 70.\nIn short, they traded an interesting perk system for a simplified one that extended playtime through unlocking content that shouldn't have been locked to begin with.\n\nThe quests. ...No, the world. New Vegas had several towns where people lived, and then the wilds. The wilds were home to wanderers like yourself, adventurers who plundered the treasures of the wasteland and would continue to do so until they died or the wilds were tamed. In this game, the towns and wilds are mushed together and consequently muddled. \nYou don't really have towns except for what you build yourself and get generic six-line \"Settler\" NPCs to inhabit, so there's fewer interesting NPCs and the towns feel bland. They're built out of locations in the wilds, which means you'll usually find yourself walking through a poorly-constructed prefab base from which you're supposed to create your own, and everything you can collect in the world is now fodder to build that base into a town. You're no longer wandering on your own, you're carrying the bland and disinteresting towns with you as you constantly scavenge more resources and clear more similar-looking settlement locations. \nIn short, they traded the unique locations for the ability to build towns full of generic buildings and NPCs.\n\nNote what's happening here: all of the uniqueness is gone. Unique weapons, perks, NPCs, player characters, locations, towns, and quests - and this happened because they were trying to add new systems that didn't gel with the old ones. They saw the systems clashing, they knew something had to be cut - and they decided to try to get a little of everything, rather than maintaining focus.  \nThat doesn't work. Fallout should have been an RPG, not sim-city. Find one thing that you can do, and do it well - not a bunch of things that only work halfway. \n\nFallout 4 isn't a bad game, but it isn't good. It had enormous potential, but too many conflicting systems and hardcoded rules gutted most of it.", "timestamp_created": 1550948506, "timestamp_updated": 1551221808, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.657186448574066162", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48995384": {"recommendationid": "48995384", "author": {"steamid": "76561197970383187", "num_games_owned": 193, "num_reviews": 14, "playtime_forever": 49632, "playtime_last_two_weeks": 0, "last_played": 1550140599}, "language": "english", "review": "10/10 Because it's better than Fallout 76.", "timestamp_created": 1550182518, "timestamp_updated": 1550182518, "voted_up": true, "votes_up": 79, "votes_funny": 50, "weighted_vote_score": "0.719436764717102051", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "48803082": {"recommendationid": "48803082", "author": {"steamid": "76561198336326911", "num_games_owned": 24, "num_reviews": 8, "playtime_forever": 12396, "playtime_last_two_weeks": 2004, "last_played": 1551852963}, "language": "english", "review": "This was the first Fallout game I played, and I can now confidently say that, after having played the other ones (the one I've played the least is actually New Vegas, what do you know.), this hardly even counts. It's such a radically different experience that I feel a lot of sympathy for people who felt cheated. I went through something very similar myself with my favorite game franchise. And the sad part is that, much like people have pointed out, the game itself would be much better if it didn't have the name attached to it.\n\nI love the companions, I love that Codsworth can say my very common name, I love the gunplay, I love the general art style and the detail of the world, I love some locations in the map, certain quests, the crafting and settlement system, I love that you get certain comments depending on what you do, and I love this game to pieces, but the thing is, almost none of these reasons are very much like Fallout, and if you can manage to get past that initial shock and distaste, you might find there's quite a lot to like. Maybe, I'm not your mother. Maybe it would have been better if you had played it before every other Fallout game to just appreciate it for what it is, which is not a compliment, due to its other glaring issues (the perk system, dialogue, lack of focus in role-playing, etcetera). But nobody can stop me from enjoying this game. So fight me. \n\nAlso, Nick Valentine. That's a plus. He's every lady who played this game's universal crush. Oh, and the silver shroud quest. Minus points for Shaun, however. I won't defend that, especially because the blend of linear and interactive story wound up terribly near the end. It's like people just forgot Shaun existed.", "timestamp_created": 1549471206, "timestamp_updated": 1549471206, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.638192117214202881", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48859622": {"recommendationid": "48859622", "author": {"steamid": "76561198018971291", "num_games_owned": 141, "num_reviews": 9, "playtime_forever": 11151, "playtime_last_two_weeks": 0, "last_played": 1545094501}, "language": "english", "review": "lemme preface with the tired phrase \"as wide as an ocean, as deep as a puddle\", but in all seriousness, that phrase quite accurately describes this game. Bethesda and Todd Howard's way of making games dooms them to this fate. Were it not for the few talented writers struggling to put in an interesting story that sadly still fails due to the broken method of story implementation, this game would scarcely have much to hold your attention. I suggest watching the NoClip documentary to see for yourself how this game was made and then watching HBomb's \"Why Fallout 3 is Garbage\" and \"how to save the video games industry\" as well as a myriad of other educational videos to see just why this game is the way it is, which is garbage.\nMaybe pick it up on sale after the Fallout 4:New Vegas mod is released.", "timestamp_created": 1549675899, "timestamp_updated": 1549675899, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.51891636848449707", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49291673": {"recommendationid": "49291673", "author": {"steamid": "76561198040828934", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 203935, "playtime_last_two_weeks": 0, "last_played": 1545195431}, "language": "english", "review": "Not the best of the Fallout series but none the less a fun game to enjoy.", "timestamp_created": 1551430269, "timestamp_updated": 1551430269, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.631879866123199463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49055501": {"recommendationid": "49055501", "author": {"steamid": "76561198354010690", "num_games_owned": 42, "num_reviews": 4, "playtime_forever": 41304, "playtime_last_two_weeks": 2347, "last_played": 1551820910}, "language": "english", "review": "I recommend this game. But the thing is i was used to the music on the other games play pop-up and now i feel like it takes the scene out from it i recommend the fallout 3 music for the play pop-up. Sincerly. karma akabane.", "timestamp_created": 1550418346, "timestamp_updated": 1550418346, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516058027744293213", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49274479": {"recommendationid": "49274479", "author": {"steamid": "76561197969860017", "num_games_owned": 288, "num_reviews": 4, "playtime_forever": 21755, "playtime_last_two_weeks": 29, "last_played": 1551341234}, "language": "english", "review": "I like this game. You get to shoot robots.", "timestamp_created": 1551339895, "timestamp_updated": 1551339895, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521824419498443604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49067449": {"recommendationid": "49067449", "author": {"steamid": "76561198053065280", "num_games_owned": 199, "num_reviews": 58, "playtime_forever": 5954, "playtime_last_two_weeks": 0, "last_played": 1550259506}, "language": "english", "review": "The first time I played this game I LOVED IT. Something about it was just fantastic and had me playing non-stop. Here I am now trying to replicate that same feeling I had on my first playthrough but I just can't. After your first playthrough everything becomes boring (mostly the main story) and it makes it hard to get through the first few hours. That coupled with the fact that this games modding community is nowhere near as big as say New Vegas' is makes it really hard to enjoy this game a second time. Maybe not worth buying at full price just due to only have a base 60 or so hours of content compared to New Vegas' limitless hour possibility.", "timestamp_created": 1550471495, "timestamp_updated": 1550471495, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.602650344371795654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48807460": {"recommendationid": "48807460", "author": {"steamid": "76561198096865490", "num_games_owned": 174, "num_reviews": 5, "playtime_forever": 3043, "playtime_last_two_weeks": 0, "last_played": 1549811561}, "language": "english", "review": "Although this game is enjoyable (with mods). It has a crappy story, ok combat, scum of a company and cant even work with my 21 9 monitor. It crashes EVERY SINGLE TIME after I got it. Fallout NV can do it on the same engine that they have been using for 20 damn years. Why can't they fix this????", "timestamp_created": 1549484161, "timestamp_updated": 1549484161, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.518607258796691895", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49193142": {"recommendationid": "49193142", "author": {"steamid": "76561198327699432", "num_games_owned": 97, "num_reviews": 4, "playtime_forever": 2234, "playtime_last_two_weeks": 1223, "last_played": 1551685142}, "language": "english", "review": "As a New Vegas fanboy(as indicated by my profile picture), this game is difficult to review. On the one hand, the dialog system, quest variety, moral dilemmas and perk/skill system are SEVERELY dumbed down. On the OTHER hand, holy crap is this game fun! Weapon customization, power armor, shooting things and EXPLOSIONS!!! The combat is INSANE!!! And if you're the creative type, you'll probably enjoy crafting and settlement building.\nIn short, fans of the original Fallout games may be somewhat disappointed, but if, say, you're a Borderlands fan, or heck, even a Minecraft fan, you will love this.", "timestamp_created": 1550944660, "timestamp_updated": 1550944660, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.536445498466491699", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48979735": {"recommendationid": "48979735", "author": {"steamid": "76561198128969063", "num_games_owned": 49, "num_reviews": 11, "playtime_forever": 11709, "playtime_last_two_weeks": 0, "last_played": 1546921730}, "language": "english", "review": "Better than 76", "timestamp_created": 1550112638, "timestamp_updated": 1550112638, "voted_up": true, "votes_up": 8, "votes_funny": 8, "weighted_vote_score": "0.530775308609008789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48797607": {"recommendationid": "48797607", "author": {"steamid": "76561198309125609", "num_games_owned": 46, "num_reviews": 3, "playtime_forever": 7840, "playtime_last_two_weeks": 17, "last_played": 1550803704}, "language": "english", "review": "Good game 10/10", "timestamp_created": 1549455723, "timestamp_updated": 1549455723, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.518358290195465088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48796310": {"recommendationid": "48796310", "author": {"steamid": "76561198121926313", "num_games_owned": 42, "num_reviews": 20, "playtime_forever": 12501, "playtime_last_two_weeks": 0, "last_played": 1462555562}, "language": "english", "review": "200+ hours of agony. 199 were spent saving useless settlers.", "timestamp_created": 1549451182, "timestamp_updated": 1549451182, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.497262179851531982", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49344363": {"recommendationid": "49344363", "author": {"steamid": "76561198126063045", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 925, "playtime_last_two_weeks": 0, "last_played": 1531079477}, "language": "english", "review": "I love the nude mods.", "timestamp_created": 1551648862, "timestamp_updated": 1551648862, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.555231392383575439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48917246": {"recommendationid": "48917246", "author": {"steamid": "76561198120737188", "num_games_owned": 134, "num_reviews": 25, "playtime_forever": 3779, "playtime_last_two_weeks": 0, "last_played": 1548875235}, "language": "english", "review": "I really liked it, the post nuclear war environment was very familiar having played a couple of the earlier games in the series. The main story was captivating and kept me interested (Not wanting to focus on side quests like in Skyrim, they were better in my opinion excluding DLC). Speaking of which, the DLC for Fallout 4 is awesome, I got so much more than what I thought I was paying for, I purposely hid sneak peaks and summaries so I could come into it with a fresh mind. I especially liked Far Harbor in particular which may have gotten a little deeper than I would have originally liked but it quickly grew on me. As for the main game I really enjoyed the factions you got to choose from and all the different endings that you got out of them. I especially liked the Brotherhood of Steel ending which I felt was a justified ending and got really emotional. As for my complaints I guess the color scheme was really bland but fitting, easily fixed with some lighting and texture patch mods. Sometimes the dialog felt like I wasn't getting a lot of choices and the game crashed a lot! I was genuinely frustrated to the point where I just wanted to give up but like many of the other games in Fallout and Elder Scrolls, mods, and mod managers combined with removing autosave functions helped significantly. If you are going to use mods I suggest downloading Nexus Mod Manager or the new one by the same people; Vortex. Base game without mods is alright, I can enjoy it and the story is nice, but there are several issues that mods fix including what I said earlier. Textures, terrain details, color and lighting enhancements, better character customization not saying the base game character customization is terrible just that it can be better. Better water textures, seasons, and one of my personal favorites, realistic dialog. In conclusion, it's a good game, but if you are going to get it, get some DLC, you don't need all of it unless you want it, and definitely use mods if you want a really good experience.", "timestamp_created": 1549856902, "timestamp_updated": 1549856902, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507575750350952148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48892150": {"recommendationid": "48892150", "author": {"steamid": "76561198017787606", "num_games_owned": 64, "num_reviews": 1, "playtime_forever": 22206, "playtime_last_two_weeks": 1115, "last_played": 1551842305}, "language": "english", "review": "Still better than Fallout 76.", "timestamp_created": 1549778803, "timestamp_updated": 1549778803, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48806374": {"recommendationid": "48806374", "author": {"steamid": "76561198153867425", "num_games_owned": 43, "num_reviews": 4, "playtime_forever": 5568, "playtime_last_two_weeks": 0, "last_played": 1550252865}, "language": "english", "review": "I absolutely love this game. I don't even know what to say except that you should definitely get this game. 10/10 would review again.", "timestamp_created": 1549480750, "timestamp_updated": 1549480750, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48887834": {"recommendationid": "48887834", "author": {"steamid": "76561198291193502", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 28667, "playtime_last_two_weeks": 1518, "last_played": 1551873325}, "language": "english", "review": "450 hrs on this game... 300hrs spent on the main quest, 50hrs on building settlements, 25hrs on fooling around and 75hrs on \"ANOTHER SETTLEMENT NEEDS OUR HELP\" overall pretty good game.", "timestamp_created": 1549761465, "timestamp_updated": 1549761465, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48876698": {"recommendationid": "48876698", "author": {"steamid": "76561198054123593", "num_games_owned": 73, "num_reviews": 7, "playtime_forever": 19326, "playtime_last_two_weeks": 0, "last_played": 1545515846}, "language": "english", "review": "Amazing game! One of my top 5 games ever. Worth every penny!!!", "timestamp_created": 1549728825, "timestamp_updated": 1549728825, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48799621": {"recommendationid": "48799621", "author": {"steamid": "76561198203290618", "num_games_owned": 30, "num_reviews": 10, "playtime_forever": 1424, "playtime_last_two_weeks": 0, "last_played": 1550341727}, "language": "english", "review": "this game is great", "timestamp_created": 1549462101, "timestamp_updated": 1549462101, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.506269633769989014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48806636": {"recommendationid": "48806636", "author": {"steamid": "76561198229515240", "num_games_owned": 135, "num_reviews": 4, "playtime_forever": 10691, "playtime_last_two_weeks": 0, "last_played": 1507716823}, "language": "english", "review": "If you’re a fan of fallout then this might be a soft pass for you. If you can get past the lore inconsistencies and lack of real impactful choice then this will be a real treat of a game. Where New Vegas went FO4 surely went the wrong direction. There is no real choice that impacts the world as a whole. Every outcome is real actively the same. Gunplay on the other hand is vastly improved from previous titles. Overall I love this game and would recommend it to anyone looking for a good survival shooter with a splash of RPG and world building.", "timestamp_created": 1549481674, "timestamp_updated": 1549481674, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48958598": {"recommendationid": "48958598", "author": {"steamid": "76561198414364254", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 15388, "playtime_last_two_weeks": 680, "last_played": 1551479367}, "language": "english", "review": "Despite all the game breaking bugs and glitches (that you can fix with commands) Great game.", "timestamp_created": 1550015048, "timestamp_updated": 1550015048, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48951267": {"recommendationid": "48951267", "author": {"steamid": "76561198130591234", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 29417, "playtime_last_two_weeks": 4662, "last_played": 1551857557}, "language": "english", "review": "Would entirely recommend if you love open-world RPGs.  I love just exploring; I have over 300 hours in the game and I'm still finding things I haven't found before.", "timestamp_created": 1549987604, "timestamp_updated": 1549987604, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48901713": {"recommendationid": "48901713", "author": {"steamid": "76561198243870442", "num_games_owned": 198, "num_reviews": 54, "playtime_forever": 28757, "playtime_last_two_weeks": 229, "last_played": 1551018555}, "language": "english", "review": "Fallout 4 is a downgrade in terms of story. However, the art design is the most immersive in all fallout games. Everything's visually convincing, you will really believe the environment belongs to the fallout universe. About the gameplay, combat has never been so smooth and enjoyable in the series. The settlement mode really makes me fall in love with collecting junks. Mods are plenty and they really enhanced the game. This is the game for new players to learn about the fallout experience. Let's be honest, every game series have to evolve to be alive after decades.", "timestamp_created": 1549806746, "timestamp_updated": 1549806746, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48973178": {"recommendationid": "48973178", "author": {"steamid": "76561198325040497", "num_games_owned": 41, "num_reviews": 5, "playtime_forever": 2230, "playtime_last_two_weeks": 0, "last_played": 1529765397}, "language": "english", "review": "Better than Fallout 76", "timestamp_created": 1550080595, "timestamp_updated": 1550080595, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507014811038970947", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48973476": {"recommendationid": "48973476", "author": {"steamid": "76561198145838652", "num_games_owned": 56, "num_reviews": 6, "playtime_forever": 65619, "playtime_last_two_weeks": 3, "last_played": 1551487722}, "language": "english", "review": "Not quite Skyrim, but close enough 8/10 - Love radiation", "timestamp_created": 1550081659, "timestamp_updated": 1550081659, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507014811038970947", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48973541": {"recommendationid": "48973541", "author": {"steamid": "76561198318402976", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 12607, "playtime_last_two_weeks": 27, "last_played": 1550772840}, "language": "english", "review": "great game even better with mods", "timestamp_created": 1550081859, "timestamp_updated": 1550081859, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507014811038970947", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48923728": {"recommendationid": "48923728", "author": {"steamid": "76561198156368212", "num_games_owned": 55, "num_reviews": 19, "playtime_forever": 1980, "playtime_last_two_weeks": 898, "last_played": 1551546524}, "language": "english", "review": "Sims with guns", "timestamp_created": 1549884422, "timestamp_updated": 1549884422, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48836741": {"recommendationid": "48836741", "author": {"steamid": "76561198081562474", "num_games_owned": 82, "num_reviews": 5, "playtime_forever": 6905, "playtime_last_two_weeks": 0, "last_played": 1550039243}, "language": "english", "review": "Alright. Here goes. Yes this review is late, but hear me out. \n\nI played New Vegas, and I understand all of the reviews that this game is nothing like New Vegas. This is accurate. If you're a die-hard NV fan, and are expecting a game similar to that, I have some bad news for you. However, let's be real, New Vegas was one of those games that is just so incredible, not much can live up to it. Not to excuse Fallout 4's shortcomings in comparison, but it is a very hard standard to beat.\n\nThis being said, I like this game. I like it not as a Fallout game, but as it's own entity, which I think is essential in giving a review for this game. Taken on it's own, I think this game is great, and I've enjoyed the almost 100 hours I've spent in it. On another note, this game is GORGEOUS. I love the aesthetics, and the game immerses you in a beautiful world with plenty to do. All in all, this game, while it doesn't follow the same formula as its predecessors, I think it's a fun game in its own way.", "timestamp_created": 1549594280, "timestamp_updated": 1549594280, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49001514": {"recommendationid": "49001514", "author": {"steamid": "76561198119598853", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 9423, "playtime_last_two_weeks": 0, "last_played": 1550295338}, "language": "english", "review": "Is good", "timestamp_created": 1550213743, "timestamp_updated": 1550213743, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49015344": {"recommendationid": "49015344", "author": {"steamid": "76561198880161010", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 486, "playtime_last_two_weeks": 0, "last_played": 1550267324}, "language": "english", "review": "its fun", "timestamp_created": 1550262616, "timestamp_updated": 1550262616, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49115547": {"recommendationid": "49115547", "author": {"steamid": "76561198075996372", "num_games_owned": 43, "num_reviews": 15, "playtime_forever": 59464, "playtime_last_two_weeks": 0, "last_played": 1550652098}, "language": "english", "review": "best game ever love the frist person and thrid person view its great love the mods i always play this game never get tird of it", "timestamp_created": 1550650546, "timestamp_updated": 1550650546, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49063871": {"recommendationid": "49063871", "author": {"steamid": "76561198053620474", "num_games_owned": 86, "num_reviews": 4, "playtime_forever": 2400, "playtime_last_two_weeks": 0, "last_played": 1538106880}, "language": "english", "review": "Im always a slut for a good fallout game. Fallout 3 will always be my main but 4 comes in close second. I miss karma and I feel like your choices doesnt matter your a hero no matter what it seems. No matter I played the hell of this game on the xbox one and then later on the pc. I feel like there a bit to many repetitive quest but there are just enough unique ones and I do love the companions and the people in the towns.", "timestamp_created": 1550451206, "timestamp_updated": 1550451206, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49147111": {"recommendationid": "49147111", "author": {"steamid": "76561197970950854", "num_games_owned": 357, "num_reviews": 27, "playtime_forever": 26735, "playtime_last_two_weeks": 8090, "last_played": 1551876238}, "language": "english", "review": "The game is enjoyable and fun. Just stay away from the survival mode..its buggy as shit and console commands are disabled so you can end up with permanent blue paint in your inventory weighing you down, or stuck on the map and the only option is to die and restart at your last bed.", "timestamp_created": 1550797832, "timestamp_updated": 1550797832, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49166642": {"recommendationid": "49166642", "author": {"steamid": "76561198436680668", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 1614, "playtime_last_two_weeks": 0, "last_played": 1516563199}, "language": "english", "review": "good", "timestamp_created": 1550892691, "timestamp_updated": 1550892691, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49149374": {"recommendationid": "49149374", "author": {"steamid": "76561198061581924", "num_games_owned": 103, "num_reviews": 11, "playtime_forever": 12544, "playtime_last_two_weeks": 0, "last_played": 1527608164}, "language": "english", "review": "Better than Fallout 76", "timestamp_created": 1550811265, "timestamp_updated": 1550811265, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49125522": {"recommendationid": "49125522", "author": {"steamid": "76561198348688022", "num_games_owned": 178, "num_reviews": 30, "playtime_forever": 12601, "playtime_last_two_weeks": 7788, "last_played": 1551552115}, "language": "english", "review": "It may be boring when you first play it, but please stick to it and you will find the fun of this game. This is a rare super work, believe me, you will fall in love with it.\n\nAnd, if you are a player who only likes Online, turn left to Fallout 76, good luck.", "timestamp_created": 1550689184, "timestamp_updated": 1550689184, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "49129840": {"recommendationid": "49129840", "author": {"steamid": "76561198352851003", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1546390014}, "language": "english", "review": "I downloaded it and it doesn't work. It just shows a black screen then crashes. I even reinstalled it, but nothing helps. I still recommend it because I watched other people play it and it is a good game.", "timestamp_created": 1550712510, "timestamp_updated": 1550712510, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49253206": {"recommendationid": "49253206", "author": {"steamid": "76561198117325926", "num_games_owned": 275, "num_reviews": 1, "playtime_forever": 77177, "playtime_last_two_weeks": 0, "last_played": 1549726314}, "language": "english", "review": "It's Ok", "timestamp_created": 1551219412, "timestamp_updated": 1551219412, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.508196711540222168", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49236384": {"recommendationid": "49236384", "author": {"steamid": "76561198135596039", "num_games_owned": 49, "num_reviews": 10, "playtime_forever": 4123, "playtime_last_two_weeks": 38, "last_played": 1551109511}, "language": "english", "review": "SPOILER FREE REVIEW:\nfallout 4 is an overall fun game i can defintly see what people are talking about when they say that it is less RPG than other fallout games and i agree but i personally don't think that makes it a worse i recently went back to play fallout NV and even tho i had more fun with the stats and talking to people it was anoyying aiming at somebody's head and not hitting because of an accuracy stat not being able to run or aim properly fallout 4 how ever is the opisite it still has good stories but it decided to sacrifice Few amazing stories for more good ones and a proper shooter system that is up to today's standards\ni feel like its a worthy sacrifice and now they have the shooting system in their engine i have high hopes for fallout 5!", "timestamp_created": 1551129942, "timestamp_updated": 1551129942, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48893979": {"recommendationid": "48893979", "author": {"steamid": "76561197981318281", "num_games_owned": 316, "num_reviews": 66, "playtime_forever": 3721, "playtime_last_two_weeks": 0, "last_played": 1463703525}, "language": "english", "review": "It's just okay. No real choices like the old games. Story's kinda meh, regardless of everything, the worst part of this game is that your son grows up to be a nerd.", "timestamp_created": 1549785474, "timestamp_updated": 1549785474, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49148030": {"recommendationid": "49148030", "author": {"steamid": "76561198064147687", "num_games_owned": 109, "num_reviews": 20, "playtime_forever": 5082, "playtime_last_two_weeks": 0, "last_played": 1547065544}, "language": "english", "review": "Yes, people bitch, yeah it ain't New Vegas, but it's a decent game on it's own with mods.", "timestamp_created": 1550803222, "timestamp_updated": 1550803222, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49215198": {"recommendationid": "49215198", "author": {"steamid": "76561198353794340", "num_games_owned": 53, "num_reviews": 4, "playtime_forever": 25145, "playtime_last_two_weeks": 3705, "last_played": 1551832001}, "language": "english", "review": "Lots of great content, satisfying combat and a pretty good twist, mods make it even better", "timestamp_created": 1551028137, "timestamp_updated": 1551028137, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49237143": {"recommendationid": "49237143", "author": {"steamid": "76561198070917337", "num_games_owned": 120, "num_reviews": 13, "playtime_forever": 31495, "playtime_last_two_weeks": 0, "last_played": 1543994248}, "language": "english", "review": "after 500 + hours, i thought it was alright but not to the bar that I set it at~ the build mode was fun but other than that I just overall prefer new vegas to this one.", "timestamp_created": 1551134454, "timestamp_updated": 1551134454, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.501342535018920898", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49254315": {"recommendationid": "49254315", "author": {"steamid": "76561198074628979", "num_games_owned": 89, "num_reviews": 1, "playtime_forever": 85, "playtime_last_two_weeks": 25, "last_played": 1550708628}, "language": "english", "review": "The ability to replay this game so many times and not get bored makes the game a recommendation for all. The developers did a great job as far as creating an open world game that doesn't feel so lonesome like many others. However, Fallout 76 was a disappointment in my opinion.", "timestamp_created": 1551226718, "timestamp_updated": 1551226718, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49220091": {"recommendationid": "49220091", "author": {"steamid": "76561198133328842", "num_games_owned": 30, "num_reviews": 13, "playtime_forever": 3089, "playtime_last_two_weeks": 0, "last_played": 1540231046}, "language": "english", "review": "Like skyrim but with guns. Very funny but gets boring after a while", "timestamp_created": 1551046561, "timestamp_updated": 1551046561, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49033067": {"recommendationid": "49033067", "author": {"steamid": "76561197972821531", "num_games_owned": 358, "num_reviews": 59, "playtime_forever": 7197, "playtime_last_two_weeks": 3193, "last_played": 1551565512}, "language": "english", "review": "Enjoying a VATS-only character and having fun, great game.", "timestamp_created": 1550332996, "timestamp_updated": 1550332996, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49309784": {"recommendationid": "49309784", "author": {"steamid": "76561198347761730", "num_games_owned": 126, "num_reviews": 4, "playtime_forever": 5699, "playtime_last_two_weeks": 1194, "last_played": 1551616998}, "language": "english", "review": "This is my favourite game when it cames out and I wanted it since then. Recently I bought a new computer and this was the first game I bought. And I am not regretting it. I have all the DLC's and spend a lot of time in it. The main quest have I completed and I am now busy with all other quests. I do love this game and I really recommend it to all people out there.", "timestamp_created": 1551512550, "timestamp_updated": 1551512550, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49337816": {"recommendationid": "49337816", "author": {"steamid": "76561198082485831", "num_games_owned": 254, "num_reviews": 33, "playtime_forever": 7962, "playtime_last_two_weeks": 0, "last_played": 1550309800}, "language": "english", "review": "MAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAYYYYYYYYYYYYYYBEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE, YOOOOOOOOOOOUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU'LLLLLLLLLLLLLLLLLLLLLLLLLLL THHHHHHHHHHHIIIIIIIIIIIIINKKKKKKKKKK OFFFFFF MEEEEEEEEEEEEEEE", "timestamp_created": 1551625661, "timestamp_updated": 1551625661, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49328620": {"recommendationid": "49328620", "author": {"steamid": "76561198134366981", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 8968, "playtime_last_two_weeks": 1320, "last_played": 1551846562}, "language": "english", "review": "Fallout 4 is the best role playing game I've played since Skyrim. The aesthetic and game play are exceptional and the story is well developed. Nothing comes close.", "timestamp_created": 1551587756, "timestamp_updated": 1551587756, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49322336": {"recommendationid": "49322336", "author": {"steamid": "76561198302291309", "num_games_owned": 47, "num_reviews": 5, "playtime_forever": 5348, "playtime_last_two_weeks": 845, "last_played": 1551003684}, "language": "english", "review": "I accidentally deleted my save file.\nFun game, just dont delte your save after 86 hours....", "timestamp_created": 1551558191, "timestamp_updated": 1551558191, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49017093": {"recommendationid": "49017093", "author": {"steamid": "76561198114550592", "num_games_owned": 156, "num_reviews": 15, "playtime_forever": 9749, "playtime_last_two_weeks": 0, "last_played": 1536195190}, "language": "english", "review": "Fallout 4, a test game that face mass scrutiny, its what it is, a fallout game, you have continuity issues, plot holes, frustrating mechanics, but it is somehow still a game you can get lost in, I like it. I’d recommend it because even with its issues, you can mod away the problems.", "timestamp_created": 1550269208, "timestamp_updated": 1550269208, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.511428594589233398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49272537": {"recommendationid": "49272537", "author": {"steamid": "76561198044540939", "num_games_owned": 734, "num_reviews": 26, "playtime_forever": 21630, "playtime_last_two_weeks": 0, "last_played": 1511658323}, "language": "english", "review": "The graphics are mediocre by modern standards, optimization is terrible, the engine is too old, characters look like creepy marionettes, dialogue choices are essentially meaningless, RPG elements are closer to Call of Duty than Fallout, and the end of the game will probably leave you with a sort of hollow feeling, never quite feeling like you've \"beaten\" the game, just kind of petered out the story and seen most of the things. That being said, it's not terrible. I'd buy it for like, $20 or $30 if you've never played it before.", "timestamp_created": 1551327525, "timestamp_updated": 1551327525, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.511428594589233398", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49272561": {"recommendationid": "49272561", "author": {"steamid": "76561198101606936", "num_games_owned": 186, "num_reviews": 4, "playtime_forever": 13294, "playtime_last_two_weeks": 0, "last_played": 1548278571}, "language": "english", "review": "Great game (not as good as Fallout: New Vegas)\n\nMods readily available to fix common issues that the devs can't. Many of them are great fun and add alot of new content. Story is ok... 222hrs and i still havnt beaten the main quest. I'm just not compelled by it. BUT i have like 20 different characters with different mods and playstyles. \n\nPick it up on sale, i did. \n\n-orange", "timestamp_created": 1551327629, "timestamp_updated": 1551327629, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.511428594589233398", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48948279": {"recommendationid": "48948279", "author": {"steamid": "76561198155994580", "num_games_owned": 98, "num_reviews": 8, "playtime_forever": 5558, "playtime_last_two_weeks": 449, "last_played": 1551712387}, "language": "english", "review": "Good game. I love the seizure the game has if you have too many saves or alt tab too much.", "timestamp_created": 1549978246, "timestamp_updated": 1549978246, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49364738": {"recommendationid": "49364738", "author": {"steamid": "76561198357964316", "num_games_owned": 35, "num_reviews": 10, "playtime_forever": 34323, "playtime_last_two_weeks": 0, "last_played": 1548986222}, "language": "english", "review": "I guess it's good for the first couple of game plays, but gets really dull after a while. It's a Bethesda game what do you expect?", "timestamp_created": 1551753177, "timestamp_updated": 1551753177, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514705896377563477", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49342745": {"recommendationid": "49342745", "author": {"steamid": "76561198076732329", "num_games_owned": 121, "num_reviews": 2, "playtime_forever": 1896, "playtime_last_two_weeks": 1024, "last_played": 1551641855}, "language": "english", "review": "I am a fan of fallout and bethesda in general. I got this game the day it came out and it was all over the place for me. I have gone back to fallout 3, new vegas and skyrim many times since then but have never picked this up or finished it. \nI have the base game, no dlc. \nThe frame rates drop from 60 to 28 in most areas and it sometimes just crashes for no reason. The animation are wonky to a point where enemies will phase right through you and where they will phase through objects.  \nThe bullets don't hit their mark for you whilst the enemy can hit you from behind walls and you can be dead in a few shots which makes this issue gamebreaking. \nThe rpg features and choices are limited, choices go the same way and their is no progression or sense of completion for you as a roleplayer.  I had quests just randomly glitch out on me and characters seemingly just stop working. The one character cooke just appeared naked in the quest I was doing for him without explanation. \nThe settlement building is just mismashed together and doesn't do much for you as a character unless you decide to take a  few perks which then mean you waste levels and time achieving that rather than exploring.  Building a roof or walls does not protect you from the weather either. \nIf the unofficial patch is recommended it requires all the dlc so if your like me with the base game then don't worry your out of luck. \nI thought the game would've been patched and working but its not.", "timestamp_created": 1551642526, "timestamp_updated": 1551642526, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501295328140258789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49380783": {"recommendationid": "49380783", "author": {"steamid": "76561198131348219", "num_games_owned": 48, "num_reviews": 3, "playtime_forever": 11789, "playtime_last_two_weeks": 3270, "last_played": 1551876792}, "language": "english", "review": "\"It's a good game, but a bad Fallout.\"\nThe game itself is full of content with Bethesda creating another life-like world for you to immerse yourself within. The downside however is the lack of 'RPG' which not only defines a Fallout title, but also any game produced by Bethesda Game Studios. I believe this is because of the move towards a more mainstream audience thus 'dumbing' down the game in order for it to appeal to a wider range of consumers. There are plenty of choices to be made when playing the game, however most of them have little to no impact and sometimes 2 different choices will often end up having the same result. Unlike it's predecessors, Fallout 4 has no karma system and almost forces the player into being the good guy which is a very restrictive move by the developers for a game that's supposed to be an RPG. Apart from this, the quests, gun-play, characters, voice acting, exploration and world building are all solid with the settlement builder being one of my favourite features (especially with mods). On the subject of mods. I currently play with over 160 installed, all of which improve and expand upon the game in one way or another, and add features which should have been in the game to begin with. Unfortunately, the story is more of the same but Bethesda manages to keep it interesting especially with a few different plot twists down the line.\nOverall, It's an enjoyable game to play and has plenty of content especially with the GOTY edition which comes with 6 DLC packs, 2 of which expand greatly upon the game with new land to explore. A large majority of mods will also require some if not all of the DLC so bear that in mind.", "timestamp_created": 1551807916, "timestamp_updated": 1551807916, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501295328140258789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49290134": {"recommendationid": "49290134", "author": {"steamid": "76561198006755015", "num_games_owned": 391, "num_reviews": 9, "playtime_forever": 3515, "playtime_last_two_weeks": 0, "last_played": 1489973878}, "language": "english", "review": "I really wanted to like this game. I even made the age old sin of pre purchasing it.\nThe gameplay is way too easy.  You get the power armour straight away which you can basically wear the entire game because powering it is incredibly easy The game play is O.K. Like Fallout 3 and New Vegas in which the gameplay was also just O.K. Where the other Fallout games stood out to me was the characters, stories and the real feeling of being put into a living breathing world.\nThe story and characters in Fallout 4? Hot garbage. Why did they think giving the main character a voice was a good idea? Why are dialogue options restricted to a simplified dumbed mass effect wheel? Why did you add outposts? Why do we get the power armor straight away? The hardest creature in the game (Deathclaw) is rekt by us after getting power armor in the first 15 minutes of the game???? HELLO BETHESDA? DESIGN CHOICES?? It feels like its trying soooo hard to create \"Fallout moments\" just like how all modern Battlefield games try to create \"Battlefield moments\". \nThe game literally starts out with \"This is your son, this is your wife, you love them! Oh no, now your wife is dead and your son is taken, you are angry! Go and get em!\". Its uninspiring  and they didn't even develop the wife/son thing so frankly I literally didn't care about any of the characters (and that didn't change throughout the game either). \n\nFuck off Bethesda, this is their most \"triple A feeling\" game they have ever made. There is no soul in Fallout 4. It is lacking in love and care from the developers, simply made to tick off a checklist to put out a medicore game to make profits and please shareholders.", "timestamp_created": 1551420352, "timestamp_updated": 1551420827, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48838016": {"recommendationid": "48838016", "author": {"steamid": "76561198343084253", "num_games_owned": 146, "num_reviews": 10, "playtime_forever": 7383, "playtime_last_two_weeks": 0, "last_played": 1550013597}, "language": "english", "review": "'𝙎𝙤𝙡𝙚: 𝙄 𝙨𝙚𝙚 𝙩𝙝𝙚 𝙜𝙡𝙖𝙨𝙨 𝙖𝙨 𝙝𝙖𝙡𝙛 𝙚𝙢𝙥𝙩𝙮, 𝙋𝙧𝙚𝙨𝙩𝙤𝙣 𝙨𝙚𝙚𝙨 𝙞𝙩 𝙖𝙨 𝙝𝙖𝙡𝙛 𝙛𝙪𝙡𝙡; 𝙩𝙝𝙖𝙩’𝙨 𝙬𝙝𝙮 𝙬𝙚 𝙢𝙖𝙠𝙚 𝙖 𝙜𝙤𝙤𝙙 𝙩𝙚𝙖𝙢. 𝘾𝙖𝙞𝙩, 𝙤𝙣 𝙩𝙝𝙚 𝙤𝙩𝙝𝙚𝙧 𝙝𝙖𝙣𝙙, 𝙟𝙪𝙨𝙩 𝙙𝙧𝙞𝙣𝙠𝙨 𝙧𝙞𝙜𝙝𝙩 𝙤𝙪𝙩 𝙤𝙛 𝙩𝙝𝙚 𝙗𝙤𝙩𝙩𝙡𝙚. 𝙋𝙞𝙥𝙚𝙧 𝙬𝙤𝙣𝙙𝙚𝙧𝙨 𝙬𝙝𝙮 𝙞𝙩 𝙝𝙖𝙨 𝙩𝙤 𝙗𝙚 𝙜𝙡𝙖𝙨𝙨, 𝙖𝙣𝙙 𝙃𝙖𝙣𝙘𝙤𝙘𝙠 𝙪𝙨𝙪𝙖𝙡𝙡𝙮 𝙗𝙧𝙚𝙖𝙠𝙨 𝙩𝙝𝙚 𝙜𝙡𝙖𝙨𝙨 𝙗𝙮 𝙥𝙪𝙩𝙩𝙞𝙣𝙜 𝙝𝙞𝙨 𝙛𝙚𝙚𝙩 𝙪𝙥 𝙤𝙣 𝙩𝙝𝙚 𝙩𝙖𝙗𝙡𝙚.' = 『4』/『5』", "timestamp_created": 1549600536, "timestamp_updated": 1549600536, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.499168425798416138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48908038": {"recommendationid": "48908038", "author": {"steamid": "76561198259202138", "num_games_owned": 39, "num_reviews": 6, "playtime_forever": 8555, "playtime_last_two_weeks": 0, "last_played": 1549195441}, "language": "english", "review": "Honestly the worst of all of the fallout games. By far. 3/10", "timestamp_created": 1549822351, "timestamp_updated": 1549822351, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48881521": {"recommendationid": "48881521", "author": {"steamid": "76561198041889733", "num_games_owned": 449, "num_reviews": 31, "playtime_forever": 2754, "playtime_last_two_weeks": 0, "last_played": 1521831562}, "language": "english", "review": "If Bethesda stopped pretending they make RPGames and admitted they do Wide Open Sandboxes, Rockstar Games would finally have some competition.\n\nBuild Your Settlement would made more sense if the game was an PREQUEL. (it works)\nYou can't join the evil faction, you can't even BE evil - just an a**hole.\nWhere are my skills? Why the factions are bland? WHERE ARE THE DIALOGUE OPTIONS? WHERE IS A GOOD STORY?!\n\nWhen Skyrim is a better RPG than Fallout 4, you know Bethesda f***ed up.\n(Good thing I bought the GOTY version for about 5 EUR. Had i paid 10 EUR, i'd felt being robbed.)", "timestamp_created": 1549740919, "timestamp_updated": 1549740919, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48818211": {"recommendationid": "48818211", "author": {"steamid": "76561198262968027", "num_games_owned": 37, "num_reviews": 2, "playtime_forever": 20290, "playtime_last_two_weeks": 0, "last_played": 1544612399}, "language": "english", "review": "Both this game 3 years ago, recently both all DLC and honestly still playing this. The game has its up and downs but people can't deny that this game is one of the best.", "timestamp_created": 1549530326, "timestamp_updated": 1549530326, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521708309650421143", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49046845": {"recommendationid": "49046845", "author": {"steamid": "76561197990656154", "num_games_owned": 370, "num_reviews": 88, "playtime_forever": 2932, "playtime_last_two_weeks": 0, "last_played": 1550479426}, "language": "english", "review": "good", "timestamp_created": 1550388478, "timestamp_updated": 1550388478, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.397849440574645996", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49182010": {"recommendationid": "49182010", "author": {"steamid": "76561198211450820", "num_games_owned": 201, "num_reviews": 7, "playtime_forever": 5017, "playtime_last_two_weeks": 0, "last_played": 1533649069}, "language": "english", "review": "Sam, my sh1t stinks", "timestamp_created": 1550916862, "timestamp_updated": 1550916862, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49251739": {"recommendationid": "49251739", "author": {"steamid": "76561198159171935", "num_games_owned": 183, "num_reviews": 19, "playtime_forever": 8685, "playtime_last_two_weeks": 4766, "last_played": 1551876921}, "language": "english", "review": "I'm a fan.", "timestamp_created": 1551212186, "timestamp_updated": 1551212186, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.53076481819152832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48962421": {"recommendationid": "48962421", "author": {"steamid": "76561198206595407", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 4621, "playtime_last_two_weeks": 432, "last_played": 1551085708}, "language": "english", "review": "BUG, BUG never changes...", "timestamp_created": 1550035774, "timestamp_updated": 1550035774, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502822577953338623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48914562": {"recommendationid": "48914562", "author": {"steamid": "76561198863056967", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 8900, "playtime_last_two_weeks": 1234, "last_played": 1551841518}, "language": "english", "review": "Hella gucci", "timestamp_created": 1549843534, "timestamp_updated": 1549843534, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503333926200866699", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48888049": {"recommendationid": "48888049", "author": {"steamid": "76561198411586632", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 21150, "playtime_last_two_weeks": 0, "last_played": 1549761881}, "language": "english", "review": "Despite it saying I played around 350+ hours of this game, half of that time I left my computer and passed out or did some others things while leaving the game running because Fallout 4 was so boring for me. They pretty much took out most of the RPG elements in this and made it more into First Person Shooter rather then a traditional \"Fallout\" game like Fallout 3 for example. Want to be a pacifist in this game? Not gonna happen cause almost all the quests always requires you use to violence. Fallout 4 is basically a shitty Bioware.\n\nSo tl;dr, would not recommend playing Fallout 4 if its your first time getting into the Fallout franchise.", "timestamp_created": 1549762399, "timestamp_updated": 1549762399, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.511312186717987061", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49320549": {"recommendationid": "49320549", "author": {"steamid": "76561197966289441", "num_games_owned": 115, "num_reviews": 2, "playtime_forever": 217, "playtime_last_two_weeks": 205, "last_played": 1551563911}, "language": "english", "review": "If you have anything but a 16x9 or 16x10 screen don't bother trying, it's not supported.", "timestamp_created": 1551551697, "timestamp_updated": 1551551697, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.506172835826873779", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49368763": {"recommendationid": "49368763", "author": {"steamid": "76561198715788334", "num_games_owned": 13, "num_reviews": 14, "playtime_forever": 2155, "playtime_last_two_weeks": 2051, "last_played": 1551858338}, "language": "english", "review": "*insert better then fallout 76 here*\n\nBut seriously, i love this game so much, <3", "timestamp_created": 1551777672, "timestamp_updated": 1551777672, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.522123873233795166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48814164": {"recommendationid": "48814164", "author": {"steamid": "76561198098450612", "num_games_owned": 165, "num_reviews": 18, "playtime_forever": 5926, "playtime_last_two_weeks": 0, "last_played": 1549840649}, "language": "english", "review": "Fallout 4 is a overhyped mess of a game, sure it has its moments, but then again if you went to a restaurant, spent $50 (Price in New Zealand Dollars) and said that the food \"Had its moments\", would you truly say its an enjoyable experience?\n\nFallout 4 is a horrible rpg, the game forces you into a very specific character, sure you can decide to be an evil prick who kills anyone you decide deserves it, but in the end does your character truly get to embody your fantasy? no!\n\nThe game constantly forces you to be a concerned parent searching for their son and avenging their deceased spouse. That's it.\n\nThe factions are all one specific archetype, extremely forced and with no degree of nuance, like in New Vegas.\n\nYes, I love New Vegas and its factions with depth and actual impact of player decisions. Fallout 4 is a decent game but a shoddy RPG and even a shoddy fallout game that had so much it could be, yet fell flat when it actually had to do something.\n\nFallout 4 is a watered down shadow of New Vegas, New Vegas had plenty of player choice and intelligence that 4 lacks. Fallout New Vegas really made the player feel they were a part of something, that they were really developing a group to help save or enslave the apocalyptic american landscape. \n\nIf you're looking for an amazing RPG with depth and an amazing story that uses player choices, go pick up New Vegas\n\nIf you want a decent game with a tacky and weak story with next to no intellectual input at all, I geuss give this a go\n\nMods really do make this game somewhat enjoyable, but that through Bethesda. Net, a gateway that blocks some mods that you need to use the Nexus Mod manager to get running\n\noverall I'll say Fallout 4 is a mediocre game that has a few interesting ideas, outnumbered by many poor choices on Bethesdas part.", "timestamp_created": 1549513352, "timestamp_updated": 1549513352, "voted_up": false, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.506311416625976563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48991859": {"recommendationid": "48991859", "author": {"steamid": "76561198001033377", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 3734, "playtime_last_two_weeks": 7, "last_played": 1550957783}, "language": "english", "review": "NEGATIVE, because of tons of bugs and Bethesda's bad working attitude.", "timestamp_created": 1550168593, "timestamp_updated": 1550168593, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.487485647201538086", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48910511": {"recommendationid": "48910511", "author": {"steamid": "76561198046007072", "num_games_owned": 495, "num_reviews": 4, "playtime_forever": 1717, "playtime_last_two_weeks": 192, "last_played": 1550942524}, "language": "english", "review": "There are several other comments criticizing the game. Despite that, I decided to buy it anyways when it was 50% off. And yes, it's as buggy and bland as they say, if not worse.\n\n- The game takes AGES to load, even on a NVME SSD, as somehow the load times are affected by the FPS and whether you have vsync enabled or not.\n- QUALITY Bethesda programming makes you get stuck in corners, have terrible FPS when looking at certain things for some reason, and not load face textures (causes entire towns to wear blackface, which is hilarious, at least until the game crashes).\n- Fanfic-tier writing, and stereotypical characters everywhere. This is aside of the \"strong independent woman\"/\"asshole man\" pairings that you find time-after-time in the game. Finally, due to a naive understanding of morality as GOOD or BAD by the writers, don't expect any enthralling story (main or side quest).\n- Dumbed-down dialogue choices which can be summarized as: \"Yes\", \"No\", \"Give more details\", \"*OW THE EDGE!*\".\n\n... And there are many other things, but honestly they've already been covered in the other reviews. This is just to confirm they're 100% true.", "timestamp_created": 1549829031, "timestamp_updated": 1549829031, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49173846": {"recommendationid": "49173846", "author": {"steamid": "76561197998630534", "num_games_owned": 47, "num_reviews": 4, "playtime_forever": 14841, "playtime_last_two_weeks": 0, "last_played": 1490494622}, "language": "english", "review": "This is not a great Fallout game. I loved Fallout 3 and New Vegas, but this Fallout kinda bored me. I played over 200 hours hoping, wanting, to like this game, but the story, the gameplay, it just doesn't have that Fallout charm I was hoping for. Also interiors in this game are really not engaging, like they make me fall asleep.", "timestamp_created": 1550902301, "timestamp_updated": 1550902301, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.467784613370895386", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49054803": {"recommendationid": "49054803", "author": {"steamid": "76561198135951175", "num_games_owned": 74, "num_reviews": 20, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1549568361}, "language": "english", "review": "Fallout 4 is a fps with some RPG elements not a actual RPG, quests are repetitive (kill this and that than come back for reward), story is boring and doesnt give you as much freedom as in old fallout games. It feels like no choise you take matter, also dialogues that are core element of an RPG are limited to just: YES; NO; SARCASTIC (yes); question (yes). Bethesda should learn from Obsidian how to develop an actual fallout game.\n\nWith Fallout 76 Bethesda shown its true nature, they are greedy, they just dont care of making a good game, they just want to make as much money as possible, selling unfinished crappy games to r3tarded kids with rich parents.", "timestamp_created": 1550416503, "timestamp_updated": 1550417034, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.484957367181777954", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48854269": {"recommendationid": "48854269", "author": {"steamid": "76561198845807318", "num_games_owned": 9, "num_reviews": 5, "playtime_forever": 2830, "playtime_last_two_weeks": 0, "last_played": 1538939999}, "language": "english", "review": "A let down compared to every other fallout game. So boring. Poor story.", "timestamp_created": 1549654898, "timestamp_updated": 1549654898, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.469001203775405884", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48789113": {"recommendationid": "48789113", "author": {"steamid": "76561198384776476", "num_games_owned": 132, "num_reviews": 1, "playtime_forever": 4888, "playtime_last_two_weeks": 0, "last_played": 1549835450}, "language": "english", "review": "Saw a lady say \"Its been so long since I've had clean fingernails\" 8/10", "timestamp_created": 1549421308, "timestamp_updated": 1549421308, "voted_up": true, "votes_up": 8, "votes_funny": 16, "weighted_vote_score": "0.542691171169281006", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48833897": {"recommendationid": "48833897", "author": {"steamid": "76561198195439593", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 3557, "playtime_last_two_weeks": 0, "last_played": 1544890474}, "language": "english", "review": "Played the game i was very disappointed \n\n-> full of fetch quests \n-> no interesting Quests - Fallout 3  had some interesting side quests , e.g. take this guys gun without alerting him (sneaky) , rig the election etc , \n-> The world is too happy go lucky with no sense of dread or danger \n-> can't attack NPCs\n-> very long load times \n-> boring boring boring \n\nI played this for a while then Decided to buy and play fallout 2 instead, 2 has an immersive engaging  story \nWow a $2 -3 dollar game from the 90s was so much better than a $70 game  \n \n\n\n\n", "timestamp_created": 1549580218, "timestamp_updated": 1549580218, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.48505893349647522", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48844506": {"recommendationid": "48844506", "author": {"steamid": "76561198135212361", "num_games_owned": 50, "num_reviews": 6, "playtime_forever": 5729, "playtime_last_two_weeks": 3136, "last_played": 1551813642}, "language": "english", "review": "This is my review after finishing the game twice on PS4 and now playing on PC.\n\n+ A huge stunning map with so many little details that make you dive deeper and deeper into the Commonwealth\n+ Very interesting story\n+ SO MUCH YOU CAN DO!\n+ COUNTLESS MISSIONS!\n+ AMAZING gameplay\n+ LOTS of customizations\n+ Beautiful graphics\n+ A huge mod community (even though I like playing the vanilla game)\n- The lack of RPG elements we had in previous Fallout games\n- Voiced main character (which does not bother me that much)\n- Many glitches\n- The choices you make do not have as much of an impact on the story as they did in the previous games (especially when comparing to New Vegas)\n- Combat could definitely benefit from some improvements (which you could of course fix with mods)\n\nOverall, Fallout 4 is a great game to play. You can replay it again and again and each time it will feel like a whole new game because of its RPG elements. It definitely met my expectations after I bought it once again. The variety of content and things you can do in the game are very enjoyable and never-ending. Therefore, the game never actually finishes as you never run out of things to do. I recommend Fallout 4 to anyone who is looking for an RPG game to invest many hours into.", "timestamp_created": 1549626438, "timestamp_updated": 1549626637, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48854271": {"recommendationid": "48854271", "author": {"steamid": "76561198297305463", "num_games_owned": 64, "num_reviews": 44, "playtime_forever": 4084, "playtime_last_two_weeks": 0, "last_played": 1550595345}, "language": "english", "review": "Ok Im going to be honest here Its ....\nAwesome from What I have played So far\nIts just great So meny things to do And funny ragdolls,fights", "timestamp_created": 1549654900, "timestamp_updated": 1549654900, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.504476964473724365", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48821421": {"recommendationid": "48821421", "author": {"steamid": "76561198895823955", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 30, "playtime_last_two_weeks": 1, "last_played": 1551846143}, "language": "english", "review": "it won't let me play on windows 10. when i press play the screen goes black and crashes.", "timestamp_created": 1549541988, "timestamp_updated": 1549541988, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48964254": {"recommendationid": "48964254", "author": {"steamid": "76561198132599934", "num_games_owned": 142, "num_reviews": 8, "playtime_forever": 20629, "playtime_last_two_weeks": 3881, "last_played": 1551863182}, "language": "english", "review": "HAVE YOU SEEN MY SON?!", "timestamp_created": 1550045217, "timestamp_updated": 1550045217, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.503267943859100342", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48917148": {"recommendationid": "48917148", "author": {"steamid": "76561198084313658", "num_games_owned": 95, "num_reviews": 5, "playtime_forever": 101, "playtime_last_two_weeks": 16, "last_played": 1551397152}, "language": "english", "review": "Story sucks.\nOnly purchased this game instead of cracking because I love them steam bandwith high download speeds.\nThanks Valve.", "timestamp_created": 1549856452, "timestamp_updated": 1549856452, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.492424249649047852", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48975974": {"recommendationid": "48975974", "author": {"steamid": "76561198004595161", "num_games_owned": 258, "num_reviews": 5, "playtime_forever": 5857, "playtime_last_two_weeks": 3333, "last_played": 1551815042}, "language": "english", "review": "Played for a few hours. Looks great, decent mechanics, lots to do. Crash to desktop at the same point over and over again. Can't get past it. It's broken and therefore NOT recommended by me. What a waste of money. Steer clear. This is the ONLY PC game in my whole collection that crashes, so it's not my hardware. POS!", "timestamp_created": 1550091414, "timestamp_updated": 1550091414, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49010120": {"recommendationid": "49010120", "author": {"steamid": "76561198238992570", "num_games_owned": 72, "num_reviews": 4, "playtime_forever": 1873, "playtime_last_two_weeks": 0, "last_played": 1550543386}, "language": "english", "review": "this games shit", "timestamp_created": 1550245942, "timestamp_updated": 1550245942, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48995628": {"recommendationid": "48995628", "author": {"steamid": "76561198187635427", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 11019, "playtime_last_two_weeks": 0, "last_played": 1550126764}, "language": "english", "review": "Add enough mods and it looks great. Add too many and it runs poorly", "timestamp_created": 1550183750, "timestamp_updated": 1550183750, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48989434": {"recommendationid": "48989434", "author": {"steamid": "76561198258872161", "num_games_owned": 57, "num_reviews": 6, "playtime_forever": 112, "playtime_last_two_weeks": 0, "last_played": 1550159295}, "language": "english", "review": "overhyped...", "timestamp_created": 1550159414, "timestamp_updated": 1550159414, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.495293617248535156", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49046566": {"recommendationid": "49046566", "author": {"steamid": "76561198079959428", "num_games_owned": 166, "num_reviews": 9, "playtime_forever": 10766, "playtime_last_two_weeks": 0, "last_played": 1550623527}, "language": "english", "review": "Good game. Bad Fallout.\n\n[b]8.5 / 10", "timestamp_created": 1550386976, "timestamp_updated": 1550387058, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519111692905426025", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49094264": {"recommendationid": "49094264", "author": {"steamid": "76561198201119099", "num_games_owned": 166, "num_reviews": 15, "playtime_forever": 1027, "playtime_last_two_weeks": 0, "last_played": 1517438266}, "language": "english", "review": "This is Bethesda's best game I personally think they have released. I understand at the time of writing this that Fallout 76 was a big bust but this Fallout game is the best out of the Quintuple, I promise!", "timestamp_created": 1550549611, "timestamp_updated": 1550549611, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49071130": {"recommendationid": "49071130", "author": {"steamid": "76561198050274714", "num_games_owned": 57, "num_reviews": 3, "playtime_forever": 2233, "playtime_last_two_weeks": 0, "last_played": 1492777582}, "language": "english", "review": "boring AF. just play Fallout 3 :/", "timestamp_created": 1550490243, "timestamp_updated": 1550490243, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49024826": {"recommendationid": "49024826", "author": {"steamid": "76561198075695601", "num_games_owned": 74, "num_reviews": 10, "playtime_forever": 2398, "playtime_last_two_weeks": 609, "last_played": 1551776212}, "language": "english", "review": "I have about 200 hours outside of steam.\n\nIf you like Fallout 1/2/NV, then this game will be bad.\nIf you like Fallout 3, then this game will be okay.\nIf you haven't played a Fallout game before, this game might be good.\n\nI don't like this game.", "timestamp_created": 1550305601, "timestamp_updated": 1550305601, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48806071": {"recommendationid": "48806071", "author": {"steamid": "76561198193693397", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1549549689}, "language": "english", "review": "cant save cant load!!", "timestamp_created": 1549479866, "timestamp_updated": 1549479866, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49130604": {"recommendationid": "49130604", "author": {"steamid": "76561198172740525", "num_games_owned": 77, "num_reviews": 14, "playtime_forever": 3495, "playtime_last_two_weeks": 560, "last_played": 1551645811}, "language": "english", "review": "plays ok, looks bad, runs horrible", "timestamp_created": 1550717467, "timestamp_updated": 1550717467, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48975272": {"recommendationid": "48975272", "author": {"steamid": "76561198201707274", "num_games_owned": 40, "num_reviews": 5, "playtime_forever": 678, "playtime_last_two_weeks": 0, "last_played": 1548051165}, "language": "english", "review": "Here's the problem with Fallout 4: \n-Bad Dialogue System\n-Dumbed Down RPG Mechanics\n-Game that is being patched and fixed by modders\n-Not enough Immersive and Fun Content\n-Crappy Recycled Story from Fallout 3\n-Scummy Overpriced Microtransactions (Creation Club)\n-Recycled DLC Plots (From Fallout 3)\n-Buggy Gameplay\n-Story with Bad Writing and not Enough Options \n-Based on the East Coast (Not really an issue but feels stereotypical that Bethesda bases every Fallout game on the east coast)\n-Blind Gullible Fans that don't Realize they Could have gotten better and should have\n-Uses a Crappy Engine that could of been upgraded\n-Todd Howards Lies\n\nBonus (Fallout 76)\n-Scummy $200 Pre-order Cash Grab (And other things like the $80 Nuka Dark Rum) \n-Blind and Naive Consumers \n-Very Buggy Gameplay and Unstable Sever\n-Recycled Content from Fallout 4\n-No NPCs\n-Unfinished Game that Could of had more content (And at least a better story)\n-Crappy PVP System and Wanted System\n-Scummy Micro-transaction Shop (Atomic Shop)\n-Bad Banning System \n-Overpriced Game with Little or not Enough Content\n-Dumb Down RPG System and Mechanics Again\n-ALL ONLINE AND NO SINGLEPLAYER OPTION\n\n\n", "timestamp_created": 1550088446, "timestamp_updated": 1550088446, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48982425": {"recommendationid": "48982425", "author": {"steamid": "76561198079591697", "num_games_owned": 95, "num_reviews": 25, "playtime_forever": 4824, "playtime_last_two_weeks": 30, "last_played": 1551376639}, "language": "english", "review": "If you buy it on a sale, its okay with mods.", "timestamp_created": 1550129060, "timestamp_updated": 1550129060, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519230782985687256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48863532": {"recommendationid": "48863532", "author": {"steamid": "76561198068806290", "num_games_owned": 125, "num_reviews": 13, "playtime_forever": 2596, "playtime_last_two_weeks": 0, "last_played": 1487389154}, "language": "english", "review": "Pros: \n-Easy for game journalists\nCons:\n-Boring story, literally a fallout 3 clone and the endgame is nonexistent (unless you shell out a ton of money for lackluster DLC)\n-Skills and VATS are completely dumbed down and has less personalization\n-Genuinely not fun to play due to bethesda's failure to patch bugs that existed in previous games", "timestamp_created": 1549692915, "timestamp_updated": 1549692915, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.456891119480133057", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49107050": {"recommendationid": "49107050", "author": {"steamid": "76561198228411472", "num_games_owned": 34, "num_reviews": 23, "playtime_forever": 1697, "playtime_last_two_weeks": 6, "last_played": 1550674651}, "language": "english", "review": "(Originally by Mister Wise Guy)  I mostly played this game on the Xbox One. But decided to switch to the P.C. This game is good. Just good, \"but why is it thumbed down?\" I hear you saying, it's because it's not a good Fallout game, I know I know, I hate what I'm saying as well but hear me out. Fallout 3 for me was the peak of Fallout, I know some say it's New Vegas but to them I say, Exploration. anyway, the previous games had a sense of choice, you could say certain things depending on your Character traits, let's say you were really smart, a prompt would show up when you spoke to an NPC, this NPC was threatening you, you could defuse the situation using  your intelligence. same with perception, in one scenario a Raider could come to you and if you had a high enough perception you could notice that the gun is unloaded or broken and He'll back off. but there is a distinct lack of that in fallout 4, all the player dialogue is just variations of yes, no, mean, happy. with a slight sarcastic tone. Also in the previous games you could change the tide of the game with one decision. Want to save the wasteland by bringing fresh water? NO. KILL THEM ALL! bam no more quests for that part. You want to blow up the first city? you can! but think it's not really important? well just know, when you blow it up you kill off everyone (except one who turns into a ghoul) you blow up. Multiple quest givers, a player house, a follower and the only person able to jump start the main quest. now you have no quest marker telling you where to go. but at least you have 500 caps and a nice hotel room. but fallout 4...what can you do? you do mildly mean things but that's about it. your on a straight path. very linear. also the fact that the main character speaks (the person you play as) takes away what role playing elements it had left. it blocks you from creating a personality. if elder scrolls or fallout 3/ New Vegas did that I wouldn't have been able to create Vognar the Red or Victor Redmond. who became unique people. It's a Good game, it's just a bad Fallout game. TL:DR not as good as the other games in bethesda's armory.", "timestamp_created": 1550604316, "timestamp_updated": 1550604316, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48898274": {"recommendationid": "48898274", "author": {"steamid": "76561198067298352", "num_games_owned": 107, "num_reviews": 2, "playtime_forever": 48229, "playtime_last_two_weeks": 21, "last_played": 1551465557}, "language": "english", "review": "Its an okay game made much better if you mod the hell out it (like me). I only have so many hours due to the 133 mods I have installed that improve the gameplay and other things. In its vanilla form, I don't think I'd have played it nearly as much...in fact I remember starting to get bored within the first few hours at release.\n\nFrom an un-modded perspective, you'll like it if you enjoy shooter games with little RPG elements, or if you are new to the Fallout franchise. But because I love the Fallout series mainly for its RPG elements (which Fallout 4 lacks), I'm not going to recommend this game.", "timestamp_created": 1549798337, "timestamp_updated": 1549798337, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49291787": {"recommendationid": "49291787", "author": {"steamid": "76561198825400425", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 4475, "playtime_last_two_weeks": 13, "last_played": 1551349838}, "language": "english", "review": "better than 76", "timestamp_created": 1551430907, "timestamp_updated": 1551430907, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.510007977485656738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49324799": {"recommendationid": "49324799", "author": {"steamid": "76561198016661147", "num_games_owned": 1072, "num_reviews": 136, "playtime_forever": 3695, "playtime_last_two_weeks": 3695, "last_played": 1551876296}, "language": "english", "review": "A Masterpiece, loved everything about this game, it is definitely a must play and for me best in  the series.", "timestamp_created": 1551568298, "timestamp_updated": 1551568298, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.517910003662109375", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49320218": {"recommendationid": "49320218", "author": {"steamid": "76561198093578537", "num_games_owned": 237, "num_reviews": 9, "playtime_forever": 12179, "playtime_last_two_weeks": 0, "last_played": 1550437059}, "language": "english", "review": "just go and buy new vegas or fallout 3 and mod those, don't spend money on this sad excuse of an fallout game after fallout 76.....also don't use money on bethesda's creation club bullshit or buy the dlc's for this game.....\n\n", "timestamp_created": 1551550579, "timestamp_updated": 1551550579, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490039855241775513", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49018126": {"recommendationid": "49018126", "author": {"steamid": "76561198342110084", "num_games_owned": 68, "num_reviews": 4, "playtime_forever": 9176, "playtime_last_two_weeks": 1209, "last_played": 1551863065}, "language": "english", "review": "Its not a good fallout game on its own but i have about 60+ mods and it makes the game actually fun\n\nalso the main quest is dum af so just skip it", "timestamp_created": 1550273646, "timestamp_updated": 1550273646, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.511428594589233398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49018878": {"recommendationid": "49018878", "author": {"steamid": "76561198193129722", "num_games_owned": 92, "num_reviews": 13, "playtime_forever": 1052, "playtime_last_two_weeks": 0, "last_played": 1550275962}, "language": "english", "review": "ok so... this review is super biased because of the recent issues ive had, in retrospect i should probaly just stop here...nah\n\ngameplay: combat is a bit bland and slow but it works fine, exploring is cool, the story is nice and the modding portion is amazing, followers are a bit dumb and useless, legendary weapons and bosses are super cookie cuter and boring so it feels kinda dumb searching for equipment, \n\nglitches: IM GONNA WRITE THIS IN CAPS SO YOU KNOW HOW ANGRY I AM, IMMERSION IS NON-EXISTANT BECAUSE EVERY TIME YOU TALK TO SOMEONE THERES A 1 IN 3 CHANCE THE CAMRA WILL GO INTO THEIR FACE AND LOOK HORRIFYING, THINGS FALL THROUGH THE FLOOR, THINGS FREEZE UP, ENEMIES DONT TAKE DAMAGE, CRASHES HAPPEN ALL THE TIME, EVEN ON LOWEST POSSIBLE SETTINGS, AND NOW I CANT EVEN BOOT UP THE GAME, IT JUST CRASHES AT THE MENU, THE VANILLA GAME IS HELL\n\nok maybe not that bad but you get the point, \n\ncommunity: the modding community is great and the modding portion is well worth 30 bucks (PROBALY CAUSE THERES SO MUCH THAT NEEDS FIXING), but really, a well modded playthrough is some of the most fun ive had with single player games ever, but as ive said before it just stopped working and its been too long to request a refund so im sadly deleting it from my pc forever, which is kinda sad even despite all my troubles because the xbox just dosnt have the modding capacity like EMBs \n\nconclusion: really, just buy fallout new vegas, its much better and has the NCR, which is always a good thing.", "timestamp_created": 1550277122, "timestamp_updated": 1550277122, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.45825466513633728", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49269747": {"recommendationid": "49269747", "author": {"steamid": "76561198089687837", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 10443, "playtime_last_two_weeks": 383, "last_played": 1551714832}, "language": "english", "review": "Good game and a good story absolutely loved playing through this", "timestamp_created": 1551308503, "timestamp_updated": 1551308503, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.516652464866638184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49128041": {"recommendationid": "49128041", "author": {"steamid": "76561198028625862", "num_games_owned": 168, "num_reviews": 28, "playtime_forever": 839, "playtime_last_two_weeks": 839, "last_played": 1550861831}, "language": "english", "review": "When I bought the game, I assumed the negative reviews were all about the Creation Club fiasco, and since I didn't intend to play with many mods, I decided to get the game.\n\nI spent two hours trying to get the game to work in my computer's resolution because the game, by default, only supports FOUR resolutions. I had to search the internet, go into files, change values and restart my computer twice because the game would freeze, refuse to close and make me unable to tab away or use the task manager whenever I restarted with different resolution settings.\n\nAs of writing this review, I haven't even gotten past the main menu, but that's not the point. The quality of the game doesn't matter when it takes me two hours and two PC crashes just to get the right resolution. This game has been out for four years. This is pathetic.\n\nAs an added note, I've gotten the game to run in my resolution, but now I can never Alt+Tab out. To use any window other than this game, I have to close the entire game, so it essentially takes away all other functions of my computer while I play it.\n\nThe only reason I haven't refunded this was because I got it as a steam key, and not from the store.", "timestamp_created": 1550701357, "timestamp_updated": 1550701706, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49173572": {"recommendationid": "49173572", "author": {"steamid": "76561198326259988", "num_games_owned": 99, "num_reviews": 12, "playtime_forever": 488, "playtime_last_two_weeks": 0, "last_played": 1541606349}, "language": "english", "review": "Oof. Worst in the series. Just play New Vegas.", "timestamp_created": 1550902052, "timestamp_updated": 1550902052, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.50548243522644043", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49250109": {"recommendationid": "49250109", "author": {"steamid": "76561198064956670", "num_games_owned": 408, "num_reviews": 9, "playtime_forever": 706, "playtime_last_two_weeks": 6, "last_played": 1551204687}, "language": "english", "review": "Unplayable with all the mouse smoothing, forced V-Sync, ridiculous input lag in-game and on menus, and just all round a poorly optimized game. If you don't mind any of that then I'd recommend the game.", "timestamp_created": 1551204953, "timestamp_updated": 1551204953, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49240983": {"recommendationid": "49240983", "author": {"steamid": "76561198243909242", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 5459, "playtime_last_two_weeks": 7, "last_played": 1550745591}, "language": "english", "review": "fun game but doesn't support 21:9 aspect ratio", "timestamp_created": 1551159069, "timestamp_updated": 1551159069, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49320901": {"recommendationid": "49320901", "author": {"steamid": "76561198136248655", "num_games_owned": 41, "num_reviews": 6, "playtime_forever": 281, "playtime_last_two_weeks": 183, "last_played": 1551035606}, "language": "english", "review": "Honestly, I was expecting more.\n\nI just felt all around underwhelmed and bored for 95% of the time while I was playing it. The UI is annoying and rather inconvenient as well. I mean sure, the graphics are good, the story is fine, but I felt that the game play was just not fun. If you really want this game, buy it while it is on sale, in my opinion, it is not worth 29.99.", "timestamp_created": 1551552976, "timestamp_updated": 1551552976, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.482352942228317261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49224391": {"recommendationid": "49224391", "author": {"steamid": "76561197972446888", "num_games_owned": 260, "num_reviews": 15, "playtime_forever": 3241, "playtime_last_two_weeks": 2047, "last_played": 1551847342}, "language": "english", "review": "Just not good enough for what I expect out of a Fallout game. Play New Vegas, it's better.", "timestamp_created": 1551072267, "timestamp_updated": 1551072267, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492642343044281006", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49238107": {"recommendationid": "49238107", "author": {"steamid": "76561198067285245", "num_games_owned": 503, "num_reviews": 10, "playtime_forever": 15498, "playtime_last_two_weeks": 3386, "last_played": 1551116906}, "language": "english", "review": "I've learned with this game that addictive and time consuming doesn't equal good or even worthwhile, especially if it constantly leaves lingering bad taste by frustration.\n\nNothing matters in this game. Nothing. \n\nWant to get those and those perks? You don't really need any perks at all. \nWant to plan and build awesome bases? You can't because you'll hit the build limit. \nWant to build flawless defenses? Enemies will spawn in middle of your settlement.\nWant to gear up your settlers for autonomy? They are useless defending themselves.\nWant to modify your weapons and armor? Modifications are dirt cheap at stores.\nWant to hunt legendary loot? Enemies are already weak, so loot is unneccessary.\nWant to hack computers, pick locks? Useless minigames to waste time.\nWant to search everywhere just in case? It's not worth it, it's all same mediocrity.\nWant to enjoy some quests? Dialogue is inane and quests redundant.\nWant to think it gets better, finally something behind next corner? It never does, there never is. \n\nI want to enjoy the world, characters, exploration, quests, but I can't. There is nothing to explore since every location is same as another. From what I've gathered enemies and containers are just lootboxes that scale to your level and have couple of value differences that alter its contents slightly. You can spend huge amount of points to picking locks, hacking and scrounging which basically gains you slightly more of these lootboxes that are already overbearing.\n\nIf I mod the game, delete all the annoying characters that keep repeating the same lines and hammering the walls, forget the quests, build my base without limits, spawn hordes of enemies outside of settlement borders and watch them try my defenses, I might enjoy the game a little. But where exactly is the real Fallout game in all of this? I didn't buy this to play some mediocre base builder that I first have to fix.\n\nI think if hell exists, people there are forced to play this game 24/7 until they lose their sanity.\n\n0/5", "timestamp_created": 1551140056, "timestamp_updated": 1551140056, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.471132993698120117", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48999633": {"recommendationid": "48999633", "author": {"steamid": "76561198882382503", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 5886, "playtime_last_two_weeks": 3123, "last_played": 1551798927}, "language": "english", "review": "This game sucks because it keeps closing when I load a new game please help me if you know how to fix", "timestamp_created": 1550204446, "timestamp_updated": 1550204446, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.454545468091964722", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48799168": {"recommendationid": "48799168", "author": {"steamid": "76561198138572465", "num_games_owned": 65, "num_reviews": 10, "playtime_forever": 7963, "playtime_last_two_weeks": 0, "last_played": 1536924261}, "language": "english", "review": "shïtty game", "timestamp_created": 1549460732, "timestamp_updated": 1549460732, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.458715975284576416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48886774": {"recommendationid": "48886774", "author": {"steamid": "76561198050554712", "num_games_owned": 266, "num_reviews": 8, "playtime_forever": 1380, "playtime_last_two_weeks": 0, "last_played": 1481259644}, "language": "english", "review": "whipe my azz with this game.", "timestamp_created": 1549757324, "timestamp_updated": 1549757324, "voted_up": false, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49143513": {"recommendationid": "49143513", "author": {"steamid": "76561198141480214", "num_games_owned": 140, "num_reviews": 53, "playtime_forever": 3296, "playtime_last_two_weeks": 0, "last_played": 1536942768}, "language": "english", "review": "I regret buying this game...", "timestamp_created": 1550778244, "timestamp_updated": 1550778244, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48848802": {"recommendationid": "48848802", "author": {"steamid": "76561198051063989", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 8648, "playtime_last_two_weeks": 0, "last_played": 1507946858}, "language": "english", "review": "One of the best games of all time", "timestamp_created": 1549639013, "timestamp_updated": 1549639013, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.51731264591217041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49075933": {"recommendationid": "49075933", "author": {"steamid": "76561198035857545", "num_games_owned": 90, "num_reviews": 5, "playtime_forever": 33911, "playtime_last_two_weeks": 0, "last_played": 1540736839}, "language": "english", "review": "I really think bethesda needs to sit down and do work on their game engine before they make any new games(this is even more so now that FO76 is out and it has bugs from Morrowind showing up in it).  With all DLC and no mods i cant complete the Automatron DLC without using console commands due to a CTD on entering the final area, thats just the worst bug ive encountered. Some of the bugs this game has are from previous Bethesda games.\n\nThe voiced PC removes the vast amount of dialogue options weve had in past games, all options are pretty much Yes, yes(Sarcasting) yes(mean), no(yes). Theres no real indications of player \"Special\" stats effecting the play through at all like in past games with the low intelligence runs you could do.\n\nThe game looks amazing but it loses points with me due to the texture pop ins on Ultra high settings, The game is also very dully coloured, everything is pretty much grey and brown, its been 200+ years since the bombs fell, not everything should be completely *BORING*.\n\nThe weapon and armor options are awesome, but theres a lack of unique looking unique weapons and even then unique rewards you can get arent that impressive as you can find weapons with better legendary upgrades than the uniques.\n\nThe companions are awesome, each one has a story and perk and they like and dislike things the player does and says, so a huge plus, i just have to ask why they cut the ability to have dogmeat /and/ a human companion, thankfully its easily fixed with mods.\n\nThe story overall is okay, but the endings are terrible, what happened to being able to force different factions to work together? What happened to finding out to all the other factions in the game? it loses points for me for that.\n\nSo, while ive had a ton of fun with this game, it really does make me question Bethesdas future and my future with their games. The lack of care for fixing bugs, the lack of meaningful choices, the reduced RP capability due to a voiced PC, gets a  not recommended from me *DESPITE* how much time ive put into this game as after playing for 20 Hours i went out and downloaded nearly 50 mods to fix and add things to the game that Bethesda seems incapable of fixing, or things they cut for some reason.\n\n\n\n\n", "timestamp_created": 1550508384, "timestamp_updated": 1550508384, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.454545468091964722", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49033701": {"recommendationid": "49033701", "author": {"steamid": "76561198391873454", "num_games_owned": 78, "num_reviews": 37, "playtime_forever": 2384, "playtime_last_two_weeks": 0, "last_played": 1544501476}, "language": "english", "review": "good", "timestamp_created": 1550334947, "timestamp_updated": 1550334947, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.46826624870300293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48880449": {"recommendationid": "48880449", "author": {"steamid": "76561198139889668", "num_games_owned": 21, "num_reviews": 7, "playtime_forever": 290, "playtime_last_two_weeks": 0, "last_played": 1548620413}, "language": "english", "review": "My computer can't run the game very well, but its okay if you like shooters, or lens flare the story is bland and basically boil's down to \"Can you tell me where my son is.\" From what I have played its not worth the money, which is probably the reason behind it selling for so little now. \n\nShort Answer, don't buy this game it will most likely leave you disappointed.", "timestamp_created": 1549738118, "timestamp_updated": 1549738198, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.458015263080596924", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49161457": {"recommendationid": "49161457", "author": {"steamid": "76561198214839100", "num_games_owned": 9, "num_reviews": 2, "playtime_forever": 78391, "playtime_last_two_weeks": 2188, "last_played": 1551850027}, "language": "english", "review": "Been Playing FO4 for the last couple of years via PC.   Overall, great game, concepts / story lines are great, tech tree is cool, battle is fun and challenging.  So why am I giving it a thumbs down?  Graphics, or to be more specific, the issues of frame stuttering/freeze ups once you get into the inner cities, Far Harbor areas.  I have a pretty hefty system (i7 5th gen, 32G ram, 250ssd, Gefore 750ti w 4GB.)  Based off all the spec sites, this is easily within recommended requirements, yet, this game cannot run without the aforementioned issues(feel free to check these out on a google search).  I have put in countless hours on setups/configurations and to date, have yet to find a proper solution.  Until these issues are fixed (don't hold your breath, Bethesda is offering nothing), I can't recommend this game.", "timestamp_created": 1550865818, "timestamp_updated": 1550865818, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.47826087474822998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49233345": {"recommendationid": "49233345", "author": {"steamid": "76561197994992427", "num_games_owned": 357, "num_reviews": 21, "playtime_forever": 2025, "playtime_last_two_weeks": 0, "last_played": 1449539657}, "language": "english", "review": "Bethesda has dropped the ball. The storytelling in this game is lackluster compared to New Vegas, where in Vegas you had meaningful skill rolls in many different situations, impactful choices, and an ability to interact from a diverse story. This game's storytelling is just absurd - you get one of the strongest piece of equipment, the power armor in the first twenty minutes of the game. You are from a \"SET\" character story and arc.  It seems AAA game devolopment studios have increasingly been spoonfeeding almost everything now.", "timestamp_created": 1551115493, "timestamp_updated": 1551115493, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.479601055383682251", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49321504": {"recommendationid": "49321504", "author": {"steamid": "76561198137758123", "num_games_owned": 26, "num_reviews": 5, "playtime_forever": 460, "playtime_last_two_weeks": 15, "last_played": 1551555088}, "language": "english", "review": "This game is alright, but I dont recommend it. Get Skyrim instead. This game is essentially Skyrim but worse.", "timestamp_created": 1551555158, "timestamp_updated": 1551555158, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.482352942228317261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49303118": {"recommendationid": "49303118", "author": {"steamid": "76561198866191866", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 818, "playtime_last_two_weeks": 818, "last_played": 1551833482}, "language": "english", "review": "Having played this game on PS4 for many hours it’s easy to notice how smooth this game looks on pc. Years after the release it’s still a great game. One of my favorite rpg’s ever.", "timestamp_created": 1551477843, "timestamp_updated": 1551477843, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.480582505464553833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49290470": {"recommendationid": "49290470", "author": {"steamid": "76561198873285631", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 3412, "playtime_last_two_weeks": 172, "last_played": 1551778896}, "language": "english", "review": "thank you bethesda, very cool :)", "timestamp_created": 1551422712, "timestamp_updated": 1551422712, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.489726036787033081", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48817002": {"recommendationid": "48817002", "author": {"steamid": "76561198158297779", "num_games_owned": 83, "num_reviews": 47, "playtime_forever": 725, "playtime_last_two_weeks": 0, "last_played": 1549229169}, "language": "english", "review": "A lot of storage put into nothing but pixelated textures :/", "timestamp_created": 1549525918, "timestamp_updated": 1549525918, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49291597": {"recommendationid": "49291597", "author": {"steamid": "76561198209434063", "num_games_owned": 20, "num_reviews": 4, "playtime_forever": 2777, "playtime_last_two_weeks": 722, "last_played": 1551429517}, "language": "english", "review": "last good bethesda game was fallout new vegas", "timestamp_created": 1551429826, "timestamp_updated": 1551429826, "voted_up": false, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.444008141756057739", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48980815": {"recommendationid": "48980815", "author": {"steamid": "76561198396891171", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1550304934}, "language": "english", "review": "i pay for playing the game，no for the crashes，cant even have 10 minutes walk in this crap", "timestamp_created": 1550119572, "timestamp_updated": 1550119572, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.483356863260269165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49033523": {"recommendationid": "49033523", "author": {"steamid": "76561198848515115", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 2443, "playtime_last_two_weeks": 0, "last_played": 1550332178}, "language": "english", "review": "The game is ruined by an unfixable bug that causes the game to not start up. Waste of money and time.", "timestamp_created": 1550334427, "timestamp_updated": 1550334427, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.439264982938766479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49270030": {"recommendationid": "49270030", "author": {"steamid": "76561198312781423", "num_games_owned": 15, "num_reviews": 8, "playtime_forever": 874, "playtime_last_two_weeks": 874, "last_played": 1551747849}, "language": "english", "review": "Not fallout 76 but... can i still play County ROADS.. TAKE ME HOME", "timestamp_created": 1551310569, "timestamp_updated": 1551310569, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.45726892352104187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48917710": {"recommendationid": "48917710", "author": {"steamid": "76561198318864193", "num_games_owned": 62, "num_reviews": 28, "playtime_forever": 775, "playtime_last_two_weeks": 0, "last_played": 1543176430}, "language": "english", "review": "it is boring", "timestamp_created": 1549859009, "timestamp_updated": 1549859009, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514172673225402832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49112970": {"recommendationid": "49112970", "author": {"steamid": "76561198068965046", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1550634775}, "language": "english", "review": "Will not work on my PC after the update then the support team tries telling me that it is my graphics card.", "timestamp_created": 1550636932, "timestamp_updated": 1550636932, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520395874977111816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49270475": {"recommendationid": "49270475", "author": {"steamid": "76561198044474801", "num_games_owned": 224, "num_reviews": 9, "playtime_forever": 14271, "playtime_last_two_weeks": 0, "last_played": 1527486405}, "language": "english", "review": "My best friend got matched with a girl on Tinder who was a also a gamer. They hit it off well to then get them to talk about games, her favorite game was Fallout 4. His response was that his favorite Fallout is New Vegas. immediately got fucked with the \"We can still be friends though\" line. The next day he checked his snap to see she has completely blocked him. Clearly this game is a sign from the devil. A mediocre experience with the S.P.E.C.I.A.L's being more like C.U.C.K's", "timestamp_created": 1551313692, "timestamp_updated": 1551313692, "voted_up": false, "votes_up": 4, "votes_funny": 6, "weighted_vote_score": "0.4667796790599823", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48963424": {"recommendationid": "48963424", "author": {"steamid": "76561198218134795", "num_games_owned": 111, "num_reviews": 39, "playtime_forever": 373, "playtime_last_two_weeks": 0, "last_played": 1545357469}, "language": "english", "review": "Boring shit", "timestamp_created": 1550041225, "timestamp_updated": 1550041225, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.451306432485580444", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49208589": {"recommendationid": "49208589", "author": {"steamid": "76561198071888825", "num_games_owned": 171, "num_reviews": 42, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1539446590}, "language": "english", "review": "boring, glitchy and ugly\nthe game crashes when i press any key to start, only when i turn off wifi can i play this mediocre, forgettable and disappointing piece of crap\na waste of money and a lazy sequel to a respectable game like fallout las vegas\ndont bother, dont buy", "timestamp_created": 1551007793, "timestamp_updated": 1551007793, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.427819997072219849", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49269241": {"recommendationid": "49269241", "author": {"steamid": "76561198107166028", "num_games_owned": 326, "num_reviews": 15, "playtime_forever": 480, "playtime_last_two_weeks": 19, "last_played": 1551305032}, "language": "english", "review": "Released in 2015 but apparently Bethesda is still living in the 1990's, can't even run the damn game at 144hz game speeds up like ms dos games, I can't believe we still have to deal with stupid stuff like this, and I, as well as many other, are waaaaaaay too used to 144hz since you know its been around for several years and I am not going to play a 60 hour game at 60fps sooooo I guess don't get this game if you have a rig from this century.", "timestamp_created": 1551304792, "timestamp_updated": 1551304792, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.424995392560958862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49245656": {"recommendationid": "49245656", "author": {"steamid": "76561198216973601", "num_games_owned": 95, "num_reviews": 42, "playtime_forever": 4837, "playtime_last_two_weeks": 127, "last_played": 1551612839}, "language": "english", "review": "Sure fallout 4 is a good game, but is it a good fallout game? I would say no. It doesn't hold a nuka-candle to fallout 3/new vegas. I know many people enjoy this game but those same people pre-ordered 76.\nYou ruined my game bethesda.\nand that i cannot forgive.\n\nAlso Dog Meat should be able to die.\nDogs die you non-offending wimps.", "timestamp_created": 1551187286, "timestamp_updated": 1551187286, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.447863519191741943", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49035122": {"recommendationid": "49035122", "author": {"steamid": "76561198021344240", "num_games_owned": 550, "num_reviews": 9, "playtime_forever": 17296, "playtime_last_two_weeks": 0, "last_played": 1550286379}, "language": "english", "review": "Its bad, folks.", "timestamp_created": 1550338762, "timestamp_updated": 1550338762, "voted_up": false, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.38045966625213623", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49156471": {"recommendationid": "49156471", "author": {"steamid": "76561198454078176", "num_games_owned": 80, "num_reviews": 28, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1545918695}, "language": "english", "review": "Worst 20 bucks I ever spent", "timestamp_created": 1550847072, "timestamp_updated": 1550847072, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.369127511978149414", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19241195": {"recommendationid": "19241195", "author": {"steamid": "76561198257905891", "num_games_owned": 190, "num_reviews": 33, "playtime_forever": 32028, "playtime_last_two_weeks": 0, "last_played": 1504400919}, "language": "english", "review": "[h1]Fallout 4.[/h1]\n[i]Heartaches by the number.[/i]\n\nFallout 4 is a title that, in relation to the previous games, took one great step forward technically and mechanically - but twenty enormous leaps backwards in terms of roleplaying, writing, dialogue, and quests. Fo4 effectually forgets everything that fans of the series loved in the originals, New Vegas, and even Bethesda's own Fallout 3; trading that out for an experience more akin to Borderlands than any other mainline Fallout release. I'm not outright saying that Fallout 4 is a terrible game, it's far from it, but it's simply not the game Fallout and RPG fans rightly expected.\n\nFallout 4 starts with an excellently produced opening cinematic explaining the state of the world in the year 2077, and then you are quickly transitioned to a married couple living in Boston, Massachusetts. From here you choose either the husband or the wife to play as, and then customize the look of your character to your liking. After a bit more exposition, you find yourself running with your spouse (your infant in their arms), to a vault as sirens blare that the nuclear apocalypse has finally come. Due to events unspoiled in this review, you emerge 210 years later - the sole survivor of Vault 111 - on a mission to reconnect with your missing child, who is no longer in the vault when you emerge.\n\nAs exciting as that opening-plot summary may have sounded, any veteran of the Fallout series would be able to quickly identify countless problems with it. Fallout has always been a franchise about creating your own character who finds their own motivations in a devastated world, with seemingly innumerable options. None of that is true in Fallout 4 however, because the character you play as will always be from before the apocalypse, have had a spouse at some point, have a child, be either a military vet (the husband) or a lawyer (the wife), and will swear an oath at the onset of the game to find their child, which should make all other content meaningless until you have. This kills one of the most iconic aspects of the Fallout series; player [i]narrative[/i] freedom. It's the basis for why I've not recommended this game, as it's the first domino to fall that proves Fo4 is not a [i]Fallout[/i] RPG, which will be explained further.\n\nSwitching to something more positive; I think Fallout 4 looks superb. The textures and faces are just passable, but the lighting(+godrays), modeling, animation, and artistic design of the Boston ruins are all visually stunning. The game even performs markedly well for a Bethesda title, apart from some FPS drops in the downtown areas. There were several bugs on release, but most of those issues are fixed now. For once, I have no major complaints about the performance of a Fallout game.\n\nAnother favorable aspect of Fo4, would be the irrefutably improved combat when compared to prior entries in the series. The shooting is now both precise and reactive, and the AI is clever enough to have some self-preservation instincts. Most fights are undertaken while exploring, and as for the exploration, I'd say it's just as good as you'd expect from any Bethesda game. The world is full of interesting places, and most of the best moments in the game are bred through this pairing of combat and exploration. However, there is one caveat to these mechanics.\n\nThe issue I have with the combat/exploration duo; is the horseshoe design of most of Fallout 4's dungeons. This is to say, the type of design Skyrim had that circled you back around to the main entrance at the end of each interior level. This is an okay design choice within itself, but considering this is Fallout, where the places you explore are meant to be realistic settings, the horseshoe level structure gets repetitive, and by consequence, immersion breaking - early on in the game. Otherwise, the broader world design suffers no such gameplay errors though.\n\nThe last encouraging thing I have to say about Fo4, is that the power armor, crafting, and settlement systems are all awesome. Power armor is finally given the depiction it deserves, as it's now less of a normal armor type and more of a vehicle that the player drives. The crafting utilizes nearly every miscellaneous item from the game, allowing them to be broken down for components to modify weapons and armor, and to build settlements. The new settlement system is basic, but thematically makes sense in the world of Fallout, as it shows people attempting to rebuild civilization and organize societies for their own well-being. While I don't agree that gameplay gimmicks are where Fallout should target its energy, these systems are well constructed and engrossing, nonetheless.\n\nRefocusing on Fallout's main tenants of design, I'll very bluntly state that the player progression is atrocious. The leveling system in Fo4 removed skills from its makeup, and now relies solely on the S.P.E.C.I.A.L. system and perks. This is a problem, because the level of diversity you can apply to your character is limited to 70 perks (many of which are boring stat-multipliers), where as you used to have over a dozen skills with values of 1-100, which made for incredible variation in player type, as well as more worthwhile perks. To compound this issue, Fo4 almost never provides different solutions to quests and dilemmas [i]based[/i] on the character you've built; making progression pointless in roleplaying terms.\n\nSpeaking of things in Fallout 4 that are pointless, the choices are too. Well, that isn’t entirely true, some quests do have a final decision you can make on how to resolve a situation, but in essence you can't choose to [i]be[/i] anything but a constant quest-sponge. This is partially due to the aforementioned, restrictive progression system, but the actions you can take are so limiting both physically and in conversation, that you can't kill people you don't like because half of all named characters are essential, and you can almost never turn down a quest in dialogue. [i]Player \"choice\" at its finest.[/i] Oh, and as for the damned dialogue...\n\nYet another dumbed-down aspect of Fo4 that was once essential to the series, is the dialogue. The crux of this issue is the limitations the system imposes by always artificially mandating 4 response options, even when more or less may be fitting. This makes conversations feel inhuman, in an uncanny-valley way, which bleeds into both the personalities of the characters and the depth of the quests. Characters (other than SOME companions) are never given the justice they deserve because your interactions with them are so narrow, and quests default to almost always being shoot and loot affairs, because the dialogue is not built for intense, thoughtful debates. Every roleplaying element has proven to be a disappointment, and I’ll expose why.\n\nTake a moment to consider this fact: [b]there is not a single writer credited for the creation of Fallout 4.[/b] The lead designer, Emil Pagliarulo, is the only person whose job description even partially included writing. This illustrates why there is a lack of thought put into the roleplaying, dialogue, choices, and quests; as they require a consistent team of [i]professional[/i] writers to construct and ensure each element works in harmony. That's what's at the heart of Fo4's troubles in my eyes; a complete disrespect towards writing in any form, which is what made Fallout what it is today.\n\nWhen it comes down to it, Fallout 4 is a perfectly well designed game on the basis of being just that; a game. What it is decidedly not however, is a Fallout RPG, because to be one of those you have to actually adhere to what made previous Fallout's so great. Those who have not played a Fallout game before will almost certainly enjoy Fo4, but as a long standing fan of the franchise, and as someone whose favorite game series was Fallout, all Fo4 gives me; is heartaches by the number.\n\n[h1]Personal Rating: 6/10 - Entirely Mediocre[/h1]\n\n(Posted On: 8/13/17)", "timestamp_created": 1448318019, "timestamp_updated": 1529718547, "voted_up": false, "votes_up": 147, "votes_funny": 1, "weighted_vote_score": "0.879698395729064941", "comment_count": 37, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34996694": {"recommendationid": "34996694", "author": {"steamid": "76561198034292043", "num_games_owned": 565, "num_reviews": 7, "playtime_forever": 3740, "playtime_last_two_weeks": 0, "last_played": 1507576027}, "language": "english", "review": "Bethesda 2015 : \"Let modders fix the game\"\nBethesda 2017 : \"Let modders fix the game and we take the money for it\"", "timestamp_created": 1505567698, "timestamp_updated": 1505567953, "voted_up": false, "votes_up": 2291, "votes_funny": 204, "weighted_vote_score": "0.929100513458251953", "comment_count": 36, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34616931": {"recommendationid": "34616931", "author": {"steamid": "76561198047337385", "num_games_owned": 1857, "num_reviews": 31, "playtime_forever": 2732, "playtime_last_two_weeks": 0, "last_played": 1491898870}, "language": "english", "review": "I don't support cash-grabbing attempts and sincerely hope they remove it entirely.\n\nApart from the cash-grab attempt that is the Creation Club:\n\nFallout4 did not live up to the hype. While the visuals are certainly an upgrade to its predecessors, almost every other element takes more than a few steps down the ladder. The role-play element that seemed to be the primary focus of 3 and New Vegas is gone, you have almost no impact on the story or events. Multiple paths to the same goal have diminished to \"path 1 kills these guys, path 2 kills those guys. There are no more alternate paths.\"\n\nPart of this degredation to the roleplay element comes in the form of the voiced protaganist; voice lines are expensive and as such you now have a choice between 4 dialog options at all times - no more and no less. Installing the mod to show you the full sentence they speak, rather than a vague descriptor (sarcastic is always an option) you see that more often than not ALL dialog options achieve the same thing. Yes, I'm not sure but I guess so, sarcastic yes, no... but I have to. Branching paths exist only in superficial forms such as which faction you choose to represent. Regardless of which faction you choose, you will be performing the same exact quest and quest goals but for different quest givers in different places. In other words, they're the same. The illusion of choice is a STRONG element in FO4, and they don't do a particularly good job of maintaining the ILLUSION part of it.\n\nCombat is lackluster. Mechanically, the guns work fairly well, but fall flat in other ways. Guns are extremely weak, legendary enemies such as the legendary raider will take dozens of shots to the head to kill. Scaling enemies work the same as they did in Skyrim. Between the levels of 1-12 the raiders are level 9. Meaning at level 12, they're easy but at 1 they're very hard. As soon as you reach level 13 they scale up for the 13-21 bracket. Now they're level 18. This means that in leveling up from 12-13 you made the same enemies signficantly harder! This is a very poor means of scaling and arguably scaling should be removed altogether. Some areas would be impossible at low levels, but you could work your way up to them or stealthily explore them. Eventually you'd be good enough to take on the challenge. But instead, with scaled enemies like this, you can just go anywhere at any time as long as you're at the right point of the bracket.\n\nThe gun selection is deceptively small, almost everything is a variation of the pipegun. Other guns do exist such as the revolver. but they're extremely rare and odds are you'll be using 3 variations of the pipegun for short, medium and long range. All of which are ugly, boring, and nowhere near realistic for their caliber. Not to mention, gun damage should only increase or decrease with a change of caliber; NOT with a change of items like the stock, which should only increase accuracy and recoil.\n\nQuests are almost entirely fetch, 'explore' and 'liberate'. Explore quests are glorified fetch quests that essentially complete themselves once you pass a trigger at the end of a 'dungeon'. Only now, you're not bringing anything back. The quest could have said to kill all enemies in the 'dungeon' but as long as you pass this trigger, the quest is complete. Dead enemies or not. Liberate quests on the other hand do require you to kill all of the enemies, but these are almost exclusively for gaining new settlements.\n\nSettlements are boring, the selection of items is small, creativity can be achieved but the building system is so clunky and ugly you won't be finding amazing creations from anyone who hasn't modded the game. \n\nTL;DR\nThe illusion of choice is so strong you effectively have no choice at all. The story is lackluster and filled with concerns, settlements are ugly and clunky, combat level brackets ruin difficulty, legendary enemies can be impossible and far beyond realistic and weapon selection is deceptively small where almost every gun you see is just a variation of the pipe gun.", "timestamp_created": 1504123043, "timestamp_updated": 1504124088, "voted_up": false, "votes_up": 166, "votes_funny": 1, "weighted_vote_score": "0.810588061809539795", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34754991": {"recommendationid": "34754991", "author": {"steamid": "76561198195939729", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 21532, "playtime_last_two_weeks": 0, "last_played": 1543193907}, "language": "english", "review": "\"Bringing back Paid Mods? Ignoring your communitiy? Automatically installing 2GB of data onto our customers PC that they can't access without paying for, in an update? That sounds like a great way to m̶a̶k̶e̶ ̶o̶u̶r̶ ̶f̶a̶n̶s̶ ̶h̶a̶p̶p̶y̶  rip even more money from people!\"", "timestamp_created": 1504613121, "timestamp_updated": 1504613121, "voted_up": false, "votes_up": 400, "votes_funny": 9, "weighted_vote_score": "0.83138585090637207", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35492850": {"recommendationid": "35492850", "author": {"steamid": "76561198032424703", "num_games_owned": 74, "num_reviews": 2, "playtime_forever": 185213, "playtime_last_two_weeks": 0, "last_played": 1549612320}, "language": "english", "review": "Paladin Danse looked at the advert for Creation Club filling the screen.\n\n\"It was corporations like this that put the last nail in the coffin for mankind. They exploited technology for their own gains, pocketing the cash and ignoring the damage they'd done.\"\n", "timestamp_created": 1507203548, "timestamp_updated": 1507203548, "voted_up": false, "votes_up": 5189, "votes_funny": 1480, "weighted_vote_score": "0.933658897876739502", "comment_count": 181, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34585191": {"recommendationid": "34585191", "author": {"steamid": "76561198025316968", "num_games_owned": 350, "num_reviews": 10, "playtime_forever": 3855, "playtime_last_two_weeks": 0, "last_played": 1543273549}, "language": "english", "review": "2 GB patch to add paid mods.\n\nC O O L", "timestamp_created": 1504032774, "timestamp_updated": 1504032774, "voted_up": false, "votes_up": 7160, "votes_funny": 502, "weighted_vote_score": "0.929578721523284912", "comment_count": 185, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34756130": {"recommendationid": "34756130", "author": {"steamid": "76561198043859279", "num_games_owned": 188, "num_reviews": 2, "playtime_forever": 6639, "playtime_last_two_weeks": 0, "last_played": 1449166733}, "language": "english", "review": "[b]I'm so sick of corporate greed.[/b]\n\nAnd it didn't take long until it would consume one of my favorite developers back in the day. It saddens me to think about what the gaming industry is turning into, and seems it will only get worse. Maybe I'm just too old and too reluctant to change and adapt, maybe I can't see the [i]greater good[/i] that might come out of the Creation Club.\n\nAnd I can't with clear mind, support this decision. Decision which wasn't driven by the love towards the product, or respect towards the players, but a decision that was driven purely by greed.\n\n[b]It worries me that this is the beginning of something much worse.[/b]\n\nPaid mods. Premium content. Mini DLCs. It doesn't matter which words are used to describe Creation Club, when intention behind it is clear. Modding has been around for a very long time, it's a whole sub-culture. And regardless of the game, there was always one thing in common - modding has always been about passion. And that's why we keep getting amazing, mindblowing mods to this day.\n\nThere are some unwritten rules in this whole story, but [b]respect[/b] and [b]passion[/b] are the key words. Not [b]money[/b]. And I'm worried that if Creation Club keeps this momentum, it will take away more than it will give. So far it's contained within Bethesda's ecosystem, soon to corrupt Skyrim and surely their future releases. But what if all developers and publishers continue the same practice in the future? What if it becomes a standard?\n\n[b]We vote with our wallets.[/b]\n\nI'm not glad of the backlash, I'm not glad that I have to give negative review based on the business decision, and not the game itself. This shouldn't have happened in the first place. But gamers understand when they're being played. And we have to show that we're not mindless sheep consuming everything that's thrown at us, without a second of a doubt.\n\nWhy interfere with system that worked well before? Modders have been keeping Bethesda's games alive for over a decade, and now they've come up with the idea of premium mods, that are supposed to be higher quality than those on Nexus. And no modders are credited. There is no transparency. Creation Club is a collection of dead cells that will grow into a unstoppable cancer if we don't treat it early.", "timestamp_created": 1504616936, "timestamp_updated": 1505209012, "voted_up": false, "votes_up": 1011, "votes_funny": 10, "weighted_vote_score": "0.906475722789764404", "comment_count": 34, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48452872": {"recommendationid": "48452872", "author": {"steamid": "76561198015284606", "num_games_owned": 244, "num_reviews": 14, "playtime_forever": 2916, "playtime_last_two_weeks": 0, "last_played": 1548035877}, "language": "english", "review": "Good times checklist.\n- Refund Fallout 76 right before full launch.\n- Delete Bethesda's digital distribution platform.\n- Use refund to buy fallout 1, 2, 3, NV, and 4 on sale.\nHave a good time.", "timestamp_created": 1548034118, "timestamp_updated": 1548034118, "voted_up": true, "votes_up": 316, "votes_funny": 157, "weighted_vote_score": "0.91349107027053833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34579002": {"recommendationid": "34579002", "author": {"steamid": "76561198003223581", "num_games_owned": 854, "num_reviews": 46, "playtime_forever": 15462, "playtime_last_two_weeks": 0, "last_played": 1511136082}, "language": "english", "review": "Creation Club, aka: Selling mods.\n\nYou know what's smart? Selling mods. That totally worked out fine on the Xbox and Playstation. It also worked out extremely well on PC when they shoved it in for Skyrim. You know what else went well? How well recieved it was for modders who cashed in. The modders got so much respect and had no problems what so ever.\n\nYou know what especially didn't happen when paid mods were introduced to Skyrim? The \"mod store\" sure as hell didn't get spammed with duplicate mods and random people trying to cash in on other people's work, work that was free prior to paid mods(And which was taken down and transfered as paid mods as soon as paid mods became a thing). You know what else didn't happen? The \"mod store\" also wasn't infested with a bunch of useless waste of time, cash grab, shitty \"mods\" that some twat threw together in five minutes. /sarcasm\n\nSeriously, I'm so fed up of the games industry right now. We've got season passes, \"remasters\" of games that are only a year or two old, a bunch of microtransactions not included in season passes(While being sold and released during the season pass' life), we're also seeing the advent of multiple season passes, not just a single season pass per game but upward of three or more season passes for a single game being refreshed every six fucking months. On top of this? We've got lootboxes. Lootboxes upon lootboxes in literally every single game being released these days which ranges from shitty cosmetics which used to be free and unlockable to full on items to make your weapons better(Like the old days of P2W in F2P MMO's). You know how far they've gone now? Lootboxes, paid boosts and \"legendary\" units/items only obtainable through lootboxes, in single player games. Yes. Single player games now have RNG(Basically gambling) lootbox bullshit in them that give progression boosts. Fuck. This. Shit.\n\nNow, the absolute worst of it is the fact that what was once free is now paid(Which seems to be a very common trend these days in the €60 \"Triple Ayy\" games industry). This is content that makes Bethesda's games what they should have been on release and adds a bunch of QoL improvements that should have been in the game on release and haven't actually been developed by Bethesda. Bethesda make the worst inventory systems and have done for years now. It's always been up to the community to fix it and make sense of the shitty organisation in inventory across all Bethesda games. Now, with paid mods, you'll be expected to pay €2-€5 for a simple inventory QoL fix. Like, wtf?! You can't justify this crap. Let's also not forget the fact that there's no gaurentees that these mods will be supported in the future. So, say you buy a mod. Your game gets updated. Your mod breaks and the modder who created it doesn't update the mod. Tough shit. You're SOL and just wasted your money and, possibly, your hundreds of hours game save that relied on a mod to work. Congrats, you've just paid some random asshole and Bethesda to fuck you in the ass and take away hundreds of hours of gameplay away from you.\n\nAnd then you have the whole shitbrigade defending this crap and saying \"Oh, but these things won't be paid mods!\" but they will. They absolutely will. Give all this shit time and before you know it your favourite inventory mod or travel mod or whatever the hell you like will shift from free to unsupported unless you pay. Then we've got the precedence of what it sets for future titles where this shit is baked into the game and there will be no way to support mods outside of it, as in Bethesda and other companies will lock down these games so they can not be modded without using their service. I don't need to explain just how much of an impact that will have on PC gaming. Just remember the amount of freedom as PC gamers we will lose when files and sections of games are locked behind some Single Player DRM which only purpose is to stop people from installing mods outside of the built in \"service.\"\n\nJust remember that everything that was said five-ten years ago about microtransactions came true. Every. Single. Thing. Now every game has microtranscations. Now every MP game has fucking in-game shops to buy skins, weapons, boosts and whatever the hell else. Now every game has a fucking season pass. Now most -- at least -- have locked DLC or \"microtransactions\" gated on release unless you \"pre-order\" or pay extra for this shit. Just as it was with microtransactions and the warnings we had about that shitfest ten years ago it's going to be the exact same with paid mods. If this shit sails, in two to three years time we're going to see DRM for mods(Which is already a thing from the Skyrim paid mods fiasco btw) in every single mod, the mod scene move from being as open and dynamic to allow people to create what they want and enjoy to a more business orientated system which caters to those who make, basically, FotM content. What will happen then? No more breakouts like Battlegrounds, survival genres, nothing because every single modder and their mother will be trying to cash in on flavour of the month bullshit content with not a single bit of original thought between them.\n\nThis is not good for gaming. This kind of content should never have paywalls blocking entry other than the initial purchase of the base game. If a mod really goes beyond and sets a game aside then it should be up to the developers/publishers of said game to reward the modder, not have others pay for it.\n\nThis is not good.", "timestamp_created": 1504018533, "timestamp_updated": 1504018533, "voted_up": false, "votes_up": 2382, "votes_funny": 47, "weighted_vote_score": "0.943399786949157715", "comment_count": 87, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34889587": {"recommendationid": "34889587", "author": {"steamid": "76561198063434418", "num_games_owned": 183, "num_reviews": 18, "playtime_forever": 3863, "playtime_last_two_weeks": 0, "last_played": 1483308966}, "language": "english", "review": "People didn't want paid mods 2 years ago, why would they want them now?", "timestamp_created": 1505160940, "timestamp_updated": 1505160940, "voted_up": false, "votes_up": 1344, "votes_funny": 15, "weighted_vote_score": "0.904643893241882324", "comment_count": 25, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35122081": {"recommendationid": "35122081", "author": {"steamid": "76561197969797584", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 8916, "playtime_last_two_weeks": 0, "last_played": 1486847111}, "language": "english", "review": "I paid full retail for this game and all the DLC. \n\nNot happy about this recent development in paid mods at all. \n\nI guess I am not alone.\n\nPlease get the message Bethesda.", "timestamp_created": 1506064170, "timestamp_updated": 1506064170, "voted_up": false, "votes_up": 2328, "votes_funny": 20, "weighted_vote_score": "0.912332773208618164", "comment_count": 37, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35122035": {"recommendationid": "35122035", "author": {"steamid": "76561198055055887", "num_games_owned": 993, "num_reviews": 13, "playtime_forever": 5878, "playtime_last_two_weeks": 0, "last_played": 1513435349}, "language": "english", "review": "\"They are not going to be paid mods\"- Bethesda", "timestamp_created": 1506063933, "timestamp_updated": 1506063933, "voted_up": false, "votes_up": 958, "votes_funny": 91, "weighted_vote_score": "0.89535444974899292", "comment_count": 23, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35121353": {"recommendationid": "35121353", "author": {"steamid": "76561198108965777", "num_games_owned": 211, "num_reviews": 4, "playtime_forever": 4554, "playtime_last_two_weeks": 0, "last_played": 1509351808}, "language": "english", "review": "Hey bethesda, here's a nice \"fuck you\" \n\nHere, I'll mark it on your map", "timestamp_created": 1506060467, "timestamp_updated": 1506060467, "voted_up": false, "votes_up": 1045, "votes_funny": 596, "weighted_vote_score": "0.905805349349975586", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34571944": {"recommendationid": "34571944", "author": {"steamid": "76561198060139734", "num_games_owned": 515, "num_reviews": 9, "playtime_forever": 37198, "playtime_last_two_weeks": 0, "last_played": 1522923774}, "language": "english", "review": "Fallout 4 is the epitemy of everything wrong with modern gaming, it has a total of 2 compelling quests, its gameplay is worse then the rest, and to top it off they added microtransactions to it. it is the worst of the fallout series.", "timestamp_created": 1503995997, "timestamp_updated": 1527017520, "voted_up": false, "votes_up": 3831, "votes_funny": 59, "weighted_vote_score": "0.908268332481384277", "comment_count": 92, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32860698": {"recommendationid": "32860698", "author": {"steamid": "76561198297564639", "num_games_owned": 66, "num_reviews": 3, "playtime_forever": 22962, "playtime_last_two_weeks": 0, "last_played": 1542173305}, "language": "english", "review": "I shall start by saying that if you are deciding to buy this game then don't let the negative reviews sway you. In general, Fallout 4 is an amazing game and can be incredibly fun.\n\nPros: \n-Very immersive and will drain so many hours, days, weeks and months from your life.\n-Far Harbour, Automotron and (first half of) NukaWorld DLC have really good stories, quests and environments.\n-Mostly fluid combat system. Everything depends on how you want to play the game.\n\nCons: \n-WIll drain so much of your life away (might've forgotten my gf's birthday ¯\\_(ツ)_/¯ )\n-Main story was incredibly lackluster compared to previous Fallout games\n-Giving you the option to be literally any kind of character you want to be....except you're always tied to being a parent.\n-a few repitive quests. (although gives you opportunities to approach these quests, areas and enemies differently\n\nAll in all, If you're a Fallout fan because of previous stories then you might not feel fulfilled playing this game, however if you love character creations, lore and immersive environments with untold stories then I completely recommend this game to you.", "timestamp_created": 1498579781, "timestamp_updated": 1498624220, "voted_up": true, "votes_up": 9622, "votes_funny": 626, "weighted_vote_score": "0.929627120494842529", "comment_count": 279, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34588463": {"recommendationid": "34588463", "author": {"steamid": "76561198175125535", "num_games_owned": 171, "num_reviews": 2, "playtime_forever": 9471, "playtime_last_two_weeks": 0, "last_played": 1522132834}, "language": "english", "review": "3$ horse armour", "timestamp_created": 1504040122, "timestamp_updated": 1504040122, "voted_up": false, "votes_up": 56, "votes_funny": 6, "weighted_vote_score": "0.664952635765075684", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35108211": {"recommendationid": "35108211", "author": {"steamid": "76561197965602632", "num_games_owned": 272, "num_reviews": 10, "playtime_forever": 14594, "playtime_last_two_weeks": 0, "last_played": 1539402720}, "language": "english", "review": "Paid mods now? I was wondering if all the negative reviews were legit but being one of the only games that you pay for mods? You deserve all the negative review just trying to get more cash.", "timestamp_created": 1506010508, "timestamp_updated": 1506010508, "voted_up": false, "votes_up": 1093, "votes_funny": 9, "weighted_vote_score": "0.866495430469512939", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35095526": {"recommendationid": "35095526", "author": {"steamid": "76561198035612662", "num_games_owned": 119, "num_reviews": 3, "playtime_forever": 5945, "playtime_last_two_weeks": 0, "last_played": 1514958005}, "language": "english", "review": "Down with corporate greed", "timestamp_created": 1505959192, "timestamp_updated": 1505959192, "voted_up": false, "votes_up": 1389, "votes_funny": 29, "weighted_vote_score": "0.887610197067260742", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34616905": {"recommendationid": "34616905", "author": {"steamid": "76561198041273484", "num_games_owned": 95, "num_reviews": 2, "playtime_forever": 29394, "playtime_last_two_weeks": 0, "last_played": 1546683762}, "language": "english", "review": "A better FPS experience than previous installemnts of the series, but the replayability and roleplay aspect of the game is much more limited due to voiced player character and a overly simplified leveling system.\n\nAlso the recent addition of paid modding means I would not reccomend this game to anyone.", "timestamp_created": 1504122942, "timestamp_updated": 1504122942, "voted_up": false, "votes_up": 64, "votes_funny": 1, "weighted_vote_score": "0.61271291971206665", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34181478": {"recommendationid": "34181478", "author": {"steamid": "76561198003132759", "num_games_owned": 1332, "num_reviews": 121, "playtime_forever": 6530, "playtime_last_two_weeks": 0, "last_played": 1502524905}, "language": "english", "review": "Fallout 4 is a game of great scale and impressive worldbuilding. It has an exceptional amount of content, and the early sense of exploring the wasteland is thrilling . Unfortunately, it turns out to be a massive letdown. Here are five reasons why.\n \n1) The engine is not up to the task. Its handling of shadows is infamous. On a GTX1080 it suffers significant framerate drops, even with settings turned down. It is also plagued with glitches, such as characters sinking into the floor or the player getting stuck.\n \n2) The UI is poor. Endlessly scrolling through the Misc section of your inventory to find the latest note or disc which you picked up is infuriating. The lack of any sort of indication of the locations of your companions is a glaring omission, especially given how prone they are to lag behind or disappear altogether (I had to use console commands to retrieve Dogmeat at one point).\n \n3) It’s not a good RPG. You are rarely given compelling choices, and most of those are crude binary options. Skillchecks are limited to dialogue, based on RNG and are easily maxed out regardless of your character build due to the levelling system. I never felt like I was playing *my* character. I completed Fallout 2 six times just to try different character builds and choices. Once is enough for this game.\n \n4) The writing is bland and forgettable for the most part. It doesn’t help that I came to this after Shadowrun: Hong Kong – a game with a compelling storyline and deep characters. Nothing about this game made me care about the people, factions or places it depicts. It was hard to choose between factions not because each had strong merits, but because I disliked them all. As the story funnelled me into wiping out person after person, I realised that I didn't care about the named characters any more than the countless faceless enemies who I'd wiped out in the wasteland. It all felt so meaningless.\n \n5) It’s packed full of busywork. Settlement building is utterly pointless and inconsequential; it doesn’t matter if my settlers have no food or beds. Radiant and miscellaneous quests just act as tedious busywork to fill out the playing time. If a fraction of the time spent on this was spent on the UI, the game would be a better experience.\n\nAnd a bonus negative for Australians - as usual, Bethesda have imposed a big price gouge. Make sure to buy it somewhere other than Steam.", "timestamp_created": 1502504169, "timestamp_updated": 1502504169, "voted_up": false, "votes_up": 2163, "votes_funny": 14, "weighted_vote_score": "0.874576866626739502", "comment_count": 40, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35067468": {"recommendationid": "35067468", "author": {"steamid": "76561198027467196", "num_games_owned": 215, "num_reviews": 23, "playtime_forever": 28497, "playtime_last_two_weeks": 0, "last_played": 1545225923}, "language": "english", "review": "Get rid of the creation club", "timestamp_created": 1505837394, "timestamp_updated": 1505837394, "voted_up": false, "votes_up": 876, "votes_funny": 8, "weighted_vote_score": "0.873262107372283936", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34925955": {"recommendationid": "34925955", "author": {"steamid": "76561198124431574", "num_games_owned": 74, "num_reviews": 3, "playtime_forever": 10658, "playtime_last_two_weeks": 563, "last_played": 1551562768}, "language": "english", "review": "Creation Club was a bad idea Bethesda, a really bad idea.", "timestamp_created": 1505331443, "timestamp_updated": 1505331443, "voted_up": false, "votes_up": 470, "votes_funny": 2, "weighted_vote_score": "0.809283792972564697", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34608354": {"recommendationid": "34608354", "author": {"steamid": "76561198138735939", "num_games_owned": 87, "num_reviews": 13, "playtime_forever": 3539, "playtime_last_two_weeks": 0, "last_played": 1529151628}, "language": "english", "review": "Paid mods no good, ncnc.", "timestamp_created": 1504101437, "timestamp_updated": 1504101437, "voted_up": false, "votes_up": 61, "votes_funny": 0, "weighted_vote_score": "0.533597826957702637", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30750892": {"recommendationid": "30750892", "author": {"steamid": "76561198320496393", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 95830, "playtime_last_two_weeks": 90, "last_played": 1551658486}, "language": "english", "review": "Greetings: My grandson talked me into trying Fallout 4. I'm an older player (65) who enjoys video games. I am very impressed with the game overall though I do wish I didn't have the CTD's and other issues with the game. But the ability to do the kind of building along with the post war setting has been a lot of fun. Being able to enhance the game through the modding system is very nice as well and gives you more hours of play as you find new things to try. I have spent hours buidling and actually restarted the game now 4 or 5 times trying out different things. I do use quite a few mods and I'm sure the contributes to the CTD's etc in the game. I thing Bethsadia has done a great job presenting this game. I played the original Fallout many years ago. Having learned how to make video's of the gameplay and posting on youtube (mostly for my grandson to see my settlements) has been a nice side benefit of playing fallout. I would recommend the game and using mods...just do all you can to ensure things are loaded correctly.", "timestamp_created": 1490533911, "timestamp_updated": 1490533911, "voted_up": true, "votes_up": 572, "votes_funny": 34, "weighted_vote_score": "0.952282369136810303", "comment_count": 54, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34968035": {"recommendationid": "34968035", "author": {"steamid": "76561197972728940", "num_games_owned": 1218, "num_reviews": 54, "playtime_forever": 9757, "playtime_last_two_weeks": 0, "last_played": 1523423993}, "language": "english", "review": "I play this game with out mods now all of a sudden I am forced to download a 2GB patch for \"creation club\" that I do not want at all. There is also no option to get rid of it in the menu, so in essence it feels like false advertising because I bought the product when this crap was not even thought of. \n\nSeriously go to hell developers from retard land. Waking up every morning with a retard boner. \n\nNow I have to go out of my way to Nexas and download a mod to get rid of your stupid \"CREATION CLUB\" Text on the top right of my goddamn screen that I dont even want there. Here is the mod for anyone interested https://www.nexusmods.com/fallout4/mods/26493/?\n\nAlso there is this mod that replaces the creation club 2gb files with very small files so you dont even have to worry about that crap on your harddrive. https://www.nexusmods.com/fallout4/mods/26567/?\n\n\nAgain go to hell you dumbass developers. Hope this review helped.", "timestamp_created": 1505469034, "timestamp_updated": 1505469295, "voted_up": false, "votes_up": 490, "votes_funny": 12, "weighted_vote_score": "0.867585718631744385", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35116702": {"recommendationid": "35116702", "author": {"steamid": "76561197996912916", "num_games_owned": 373, "num_reviews": 8, "playtime_forever": 16890, "playtime_last_two_weeks": 0, "last_played": 1539677259}, "language": "english", "review": "Breaking F4SE every update, which happens almost every day because of paid mods.\nFantastic.", "timestamp_created": 1506039536, "timestamp_updated": 1506039536, "voted_up": false, "votes_up": 601, "votes_funny": 5, "weighted_vote_score": "0.836870372295379639", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34521756": {"recommendationid": "34521756", "author": {"steamid": "76561197981690089", "num_games_owned": 272, "num_reviews": 3, "playtime_forever": 23993, "playtime_last_two_weeks": 0, "last_played": 1503813083}, "language": "english", "review": "Zero support for poor engine performance on PC.  Zero support for ultrawide monitors.  Indie games are better at releasing finished products.  Disappointing to say the least...\n\nYes, there are many community mods that allow this game to run and look better.  Yes, I can change the resolution manually in the .ini file.  Just don't expect people to buy this game and receive any patches to fix this stuff anytime soon.  If you like to manually mod the crap out of the game to get it to work on your machine, this is the game for you.", "timestamp_created": 1503813563, "timestamp_updated": 1506628009, "voted_up": false, "votes_up": 2909, "votes_funny": 39, "weighted_vote_score": "0.860586881637573242", "comment_count": 55, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34616823": {"recommendationid": "34616823", "author": {"steamid": "76561198020837281", "num_games_owned": 182, "num_reviews": 6, "playtime_forever": 2262, "playtime_last_two_weeks": 0, "last_played": 1448689730}, "language": "english", "review": "Paid Mods", "timestamp_created": 1504122691, "timestamp_updated": 1504122691, "voted_up": false, "votes_up": 43, "votes_funny": 0, "weighted_vote_score": "0.516599118709564209", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34703592": {"recommendationid": "34703592", "author": {"steamid": "76561198022720155", "num_games_owned": 624, "num_reviews": 11, "playtime_forever": 3995, "playtime_last_two_weeks": 0, "last_played": 1495475739}, "language": "english", "review": "redownloaded the game to play on a whim, so many fond memories ... to find out all my mods broke with this crappy FORCED DOWNLOAD for PAID MODS i DIDNT BUY\n\ntldr; i had to TORRENT a game I OWN and PAYED FOR, drag and drop steam files, disable updates on steam, TO PLAY A GAME I      P A Y E D     F O R", "timestamp_created": 1504418574, "timestamp_updated": 1504419060, "voted_up": false, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.585678815841674805", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34781508": {"recommendationid": "34781508", "author": {"steamid": "76561198015792831", "num_games_owned": 175, "num_reviews": 14, "playtime_forever": 22830, "playtime_last_two_weeks": 0, "last_played": 1536084745}, "language": "english", "review": "Take this Bs CC off my game.I dont want to dl them, I dont wnt to use them. I dont want to see them. I dont want a frickin water mark all over my launch screen reminding me how much you love dollars. Do us a favour and look at cpr buissness model instead. Damn it man.", "timestamp_created": 1504725267, "timestamp_updated": 1504725267, "voted_up": false, "votes_up": 299, "votes_funny": 0, "weighted_vote_score": "0.774583697319030762", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34608344": {"recommendationid": "34608344", "author": {"steamid": "76561197990658369", "num_games_owned": 20, "num_reviews": 3, "playtime_forever": 78796, "playtime_last_two_weeks": 552, "last_played": 1551817345}, "language": "english", "review": "Dearest Bethesda, who the hell asked you guys to force a HUGE download on me for a paid mod I will never use?  Here's an idea, if I want a mod, I will PAY you for it and THEN download it at my leisure.  I have no problem with paid mods if people WANT to pay for them,  but shoveling this garbage on customers without them asking for it was a stupid (very stupid) decision on your part, Bethesda.  If Fallout 4 were a Star Wars movie, this mod is Jar Jar Binks.", "timestamp_created": 1504101390, "timestamp_updated": 1504101390, "voted_up": false, "votes_up": 97, "votes_funny": 6, "weighted_vote_score": "0.65774768590927124", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34315781": {"recommendationid": "34315781", "author": {"steamid": "76561198048232396", "num_games_owned": 105, "num_reviews": 4, "playtime_forever": 27545, "playtime_last_two_weeks": 0, "last_played": 1538295877}, "language": "english", "review": "I was forced to use mod to try and improve the dialog system, but it's still very limited. It's also hard to role-play because the main character's origin and morals are clearly defined.", "timestamp_created": 1503006124, "timestamp_updated": 1503006124, "voted_up": false, "votes_up": 2044, "votes_funny": 16, "weighted_vote_score": "0.832602858543395996", "comment_count": 29, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35117259": {"recommendationid": "35117259", "author": {"steamid": "76561198060376551", "num_games_owned": 75, "num_reviews": 2, "playtime_forever": 54958, "playtime_last_two_weeks": 118, "last_played": 1551550006}, "language": "english", "review": "creation club? microtransactions? how about you choke on a moldy dick?\n\ni honstly dont care about cc. its the fact that any time they add something to cc, the whole game needs to update, which means f4se needs to update too, & probably any (real) mods that use f4se. big issue is these things dont always update right when the game does, you have to wait for everyone to make the needed patches.\n\nthanks beth, for breaking my game with your half assed cash grab. your \"mods\" dont even look very good, most of them i wouldnt use for free.", "timestamp_created": 1506042028, "timestamp_updated": 1506042028, "voted_up": false, "votes_up": 235, "votes_funny": 6, "weighted_vote_score": "0.771851241588592529", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34611383": {"recommendationid": "34611383", "author": {"steamid": "76561198024400388", "num_games_owned": 438, "num_reviews": 3, "playtime_forever": 28100, "playtime_last_two_weeks": 1, "last_played": 1551773929}, "language": "english", "review": "For gods sakes bethesda, you tried this before and it didn't work.\nWhat do you actually think paid mods means\n\nQuote from there creation club page:\n\"How do I get Creation Club content?\nCreation Club is available via in-game digital marketplaces in both Fallout 4 and Skyrim and purchased with Credits. Credits are available for purchase on PSN, Xbox Live, and Steam.\n\nIs Creation Club paid mods?\nNo. Mods will remain a free and open system where anyone can create and share what they’d like.\"\n\nSo they think paid mods means that creators pay to upload them. THATS NOT WHAT 'PAID MODS' MEANS", "timestamp_created": 1504108542, "timestamp_updated": 1504108542, "voted_up": false, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.647148728370666504", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34616842": {"recommendationid": "34616842", "author": {"steamid": "76561198123697434", "num_games_owned": 80, "num_reviews": 5, "playtime_forever": 13531, "playtime_last_two_weeks": 0, "last_played": 1540338316}, "language": "english", "review": "Pay for skins in a single player game. Next year the game will be online single player only.", "timestamp_created": 1504122743, "timestamp_updated": 1504122743, "voted_up": false, "votes_up": 56, "votes_funny": 2, "weighted_vote_score": "0.594243466854095459", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42723716": {"recommendationid": "42723716", "author": {"steamid": "76561198119062068", "num_games_owned": 79, "num_reviews": 5, "playtime_forever": 1748, "playtime_last_two_weeks": 0, "last_played": 1528848679}, "language": "english", "review": "''A baby is drowning in the lake: \n\nFallout 1 \n- Ask for more information \n- Agree to help \n- Decide not to help \n- Accidentally say something that pisses the NPC off , failing the quest \n- Reveal too much information about yourself , causing the Super Mutants to track your vault more easily \n\nFallout 2 \n- Ask for more information \n- Agree to help \n- Decide not to help \n- Accidentally say something that pisses the NPC off , failing the quest \n- Pop culture reference about the baby\n\nFallout 3 \n\n- Yes , I will save the baby \n- Depends on the caps \n- I will not save the baby \n- [Intelligence ] The baby is drowning \n\nFallout New Vegas \n- I will save the baby \n- I will not save the baby \n- [Barter 30 ] Double the caps and I 'll save the baby \n- [ Medicine 30] Thanks to my medical knowledge , I will easily be able to save the baby \n- [ Survival 15/30 ] Uh yeah , I totally know how to swim\n\nFallout 4 \n- Yes \n- No ( Yes ) \n- Sarcastic Yes﻿''\n\n\nEdit 1: (True review) I still find the game very enjoyable. The only thing that trully bugs me (beside the dialogue system) is that you don't FEEL like role-playing, you feel like you're stuck as the ''father-soldier'' character. Although i really like exploring the world. It's a fun game.\n\nEdit 2: Yes, this is from reddit, my friend sent me this in discord and i just taught it would be fun to post it as a review. No bad intentions guys sz", "timestamp_created": 1528993283, "timestamp_updated": 1530567018, "voted_up": true, "votes_up": 1473, "votes_funny": 1645, "weighted_vote_score": "0.904078483581542969", "comment_count": 61, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34669157": {"recommendationid": "34669157", "author": {"steamid": "76561198006788541", "num_games_owned": 276, "num_reviews": 1, "playtime_forever": 7304, "playtime_last_two_weeks": 0, "last_played": 1518407835}, "language": "english", "review": "It isn't paid mods, just mods you pay for. It's totally different!\n\n", "timestamp_created": 1504299453, "timestamp_updated": 1504299453, "voted_up": false, "votes_up": 33, "votes_funny": 7, "weighted_vote_score": "0.552646517753601074", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34608324": {"recommendationid": "34608324", "author": {"steamid": "76561198058456032", "num_games_owned": 125, "num_reviews": 3, "playtime_forever": 16770, "playtime_last_two_weeks": 0, "last_played": 1544699461}, "language": "english", "review": "What the hell are you guys thinking? PAID MODS???? Which genius decided this was a good idea to pay back loyal supporters? We all thought Bethesda are different from EA, Ubisoft, and Rockstar. We hoped that Bethesda will set a fine example of modern gaming industries by giving us good games, reasonable price, great dlc, and free modding. We were dead wrong, and Bethesda is starting something all gamers fea and hated, paid mods. Soon, the rest of the gaming industry will jump onto the bandwagon and start charging people for downloading mods. You know what? One day, I'll start a game company, give free modding support, free dlcs, and make it great with blackjack and hookers. Eat shit and die, Bethesda.", "timestamp_created": 1504101337, "timestamp_updated": 1504101337, "voted_up": false, "votes_up": 70, "votes_funny": 4, "weighted_vote_score": "0.660803139209747314", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34633695": {"recommendationid": "34633695", "author": {"steamid": "76561198027901806", "num_games_owned": 1062, "num_reviews": 80, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1450367961}, "language": "english", "review": "charge for mod", "timestamp_created": 1504184014, "timestamp_updated": 1504184080, "voted_up": false, "votes_up": 40, "votes_funny": 0, "weighted_vote_score": "0.592306375503540039", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35058235": {"recommendationid": "35058235", "author": {"steamid": "76561197980520636", "num_games_owned": 2412, "num_reviews": 44, "playtime_forever": 7329, "playtime_last_two_weeks": 0, "last_played": 1484527651}, "language": "english", "review": "I enjoyed Fallout 4, but a lot of that enjoyment came from being able to taylor the experience to my own preferences through the use of mods.  That's always been the conumdrum when judging Bethesda games; Is it a good game because you can mod it however you please?  Or is it a bad game because you need to throw so many mods at it for it to become playable?\n\nTrying to hide mods behind a paywall makes that question a little easier to answer...", "timestamp_created": 1505797741, "timestamp_updated": 1506280834, "voted_up": false, "votes_up": 744, "votes_funny": 8, "weighted_vote_score": "0.885764777660369873", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34616812": {"recommendationid": "34616812", "author": {"steamid": "76561198033740732", "num_games_owned": 535, "num_reviews": 4, "playtime_forever": 12598, "playtime_last_two_weeks": 0, "last_played": 1535879895}, "language": "english", "review": "Creation Club? More like \"Paid Mods Part 2\"", "timestamp_created": 1504122653, "timestamp_updated": 1504122653, "voted_up": false, "votes_up": 62, "votes_funny": 0, "weighted_vote_score": "0.518139123916625977", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35125524": {"recommendationid": "35125524", "author": {"steamid": "76561198037569578", "num_games_owned": 369, "num_reviews": 11, "playtime_forever": 5498, "playtime_last_two_weeks": 0, "last_played": 1525194715}, "language": "english", "review": "30 dollars for 5500 Credits use on those CC paid mods?\nhaha\n\nyeah of course!!!, no.", "timestamp_created": 1506079338, "timestamp_updated": 1506079358, "voted_up": false, "votes_up": 1459, "votes_funny": 66, "weighted_vote_score": "0.859496057033538818", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34581424": {"recommendationid": "34581424", "author": {"steamid": "76561198057802656", "num_games_owned": 270, "num_reviews": 6, "playtime_forever": 21081, "playtime_last_two_weeks": 1426, "last_played": 1551806645}, "language": "english", "review": "Fallout 4 is meh. Its not bad. But its not good.\n\nThe guns and gunplay are nice. The world aesthetic is good, and the map has variety.\n\nBut the story sucks, the game has been \"streamlined\" read stripped and simplified. And there's a bizzare focus on settlement building.\n\nBuy New Vegas and mod that. \n\nAlso paid mods are back. Booo", "timestamp_created": 1504024691, "timestamp_updated": 1504024691, "voted_up": false, "votes_up": 47, "votes_funny": 1, "weighted_vote_score": "0.56270444393157959", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35589399": {"recommendationid": "35589399", "author": {"steamid": "76561198079779400", "num_games_owned": 103, "num_reviews": 1, "playtime_forever": 43275, "playtime_last_two_weeks": 768, "last_played": 1551848547}, "language": "english", "review": "bethesda, please let obsidian take over fallout.", "timestamp_created": 1507525168, "timestamp_updated": 1507525168, "voted_up": false, "votes_up": 3831, "votes_funny": 165, "weighted_vote_score": "0.887687087059020996", "comment_count": 63, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34925816": {"recommendationid": "34925816", "author": {"steamid": "76561198038832225", "num_games_owned": 313, "num_reviews": 3, "playtime_forever": 18332, "playtime_last_two_weeks": 0, "last_played": 1510513897}, "language": "english", "review": "Paid mods? Kiss my ass Bethesda.", "timestamp_created": 1505330951, "timestamp_updated": 1505330951, "voted_up": false, "votes_up": 310, "votes_funny": 9, "weighted_vote_score": "0.709742069244384766", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34648227": {"recommendationid": "34648227", "author": {"steamid": "76561197991528003", "num_games_owned": 332, "num_reviews": 3, "playtime_forever": 12675, "playtime_last_two_weeks": 0, "last_played": 1538705707}, "language": "english", "review": "Did not ask for this creation club business.  Did not ask to get stuck with a mandatory 2 GB download so I could have a bunch of microtransaction crap pre-loaded on my hard drive in the event I feel like paying for uninspired mods.  For a company with a long history of being dependent on unofficial patches and free mods to fix their games, they sure are handling the community in a stupid way.", "timestamp_created": 1504227508, "timestamp_updated": 1504227508, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.595561325550079346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34772202": {"recommendationid": "34772202", "author": {"steamid": "76561198040989984", "num_games_owned": 111, "num_reviews": 7, "playtime_forever": 4868, "playtime_last_two_weeks": 0, "last_played": 1481539921}, "language": "english", "review": "I did not ask for bloatware, and absolutely nobody asked for micro transactions! After getting the game when it came out, plus the season pass, this is what you do? I've been playing Bethesda games for what, half a decade? You need to seriously consider how many customers and fans you've been alienating with this crap. What were you thinking!?\n \nNow it's downloading unusable content to my SSD that doesn't have much room in the first place. You need to stop. You need to listen to customers, not just numbers and $$$. We shouldn't have to bankrupt you or riot online to be taken seriously.  We're fans, we shouldn't have to explode at the company we love for them to listen to us. We shouldn't have to start boycotting you for you to take note. In the mean time you complain that fans are overreacting and being harsh, but anything else gets completely ignored, no conversation possible, so what do you want from us!? Well, of course, $$$ and no crticism no matter how you screw up. You should be ashamed of yourselves.\n\nWhoever came up with this is bad for your company. They do not have your best interest in mind. They do not give a crap about you and how you look to the people that put food in your mouths. They'll get paid anyway. They personally will not bleed reputation like you have been for the last year.  \nBut no, it's piracy and toxic online communities, right? No, as a company, it's your collective narcissism and your cynicism in dealing with your customers and fans. But if it's your fault you may have to take responsibility and we can't have that, right? It's the customer, the fan, the community.  \nThey didn't make these decisions, they didn't code this crap, they didn't push for this when it obviously wasn't wanted. But it's them! They're crazy for pointing out flaws, they're nasty for not wanting to be scammed, they're toxic for saying 'no' with baaaad wooooords. You should ignore them en masse because they didn't always say it the way you like. Such a toxic environment to work in, it's so hard! So stiffling to innovation and progress, so demanding, oh dear you.\n\nI guess the world has changed, haha. You should plug your ears and distance yourselves even more. It's the only way. Customers and fans need to be told what they want so we can spend less on producing these things. Impressionable moneybags. Trainable. But so loud! We need strategies to work around this, we need to waste some more money on a consultant, we need to make them want it, we need more profit for less work but still keep our image. There is a way. There is a formula that works. The whales are waiting! The shareholders are salivating! KACHING!\n\nOr you could... give the customer a good product and not insult them with your obvious easy money schemes... make shit tons of money... be hyped and adored as one of the few who 'get it'...  \n\nIf all we get from you is underwhelming products, the second coming of microtransactions and insults, how exactly did you expect to be treated?  Throwing shade at the modding community that's been keeping your game popular and relevant and often fixing it while trying to exploit them at the same time. You disgust me. \n\nThis is absolutely absurd. Uninstalling Fallout 4. Watching Skyrim (both versions) like a hawk. If this isn't fixed, if you do not properly fix this, I will never touch a future product of yours ever again.", "timestamp_created": 1504690020, "timestamp_updated": 1504691568, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.559021532535552979", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34591257": {"recommendationid": "34591257", "author": {"steamid": "76561198008127038", "num_games_owned": 1202, "num_reviews": 3, "playtime_forever": 10377, "playtime_last_two_weeks": 0, "last_played": 1526405234}, "language": "english", "review": "Retroactively adding paid mods as microtransactions into the game sure is a nice way to thank your community for fixing your broken game...", "timestamp_created": 1504047230, "timestamp_updated": 1504047230, "voted_up": false, "votes_up": 31, "votes_funny": 0, "weighted_vote_score": "0.540654361248016357", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34619505": {"recommendationid": "34619505", "author": {"steamid": "76561197992460164", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 4189, "playtime_last_two_weeks": 0, "last_played": 1507840963}, "language": "english", "review": "Paid mods insult the loyal fanbase that made this game the giant it has become", "timestamp_created": 1504130275, "timestamp_updated": 1504130275, "voted_up": false, "votes_up": 38, "votes_funny": 0, "weighted_vote_score": "0.527369916439056396", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34593604": {"recommendationid": "34593604", "author": {"steamid": "76561198075605123", "num_games_owned": 89, "num_reviews": 2, "playtime_forever": 33204, "playtime_last_two_weeks": 49, "last_played": 1551190741}, "language": "english", "review": "Todd Howard: \"It just works.\"\nNo Todd. No it doesn't.\n\nWith paid mods now implemented I can no longer recommend this game.", "timestamp_created": 1504054334, "timestamp_updated": 1504054334, "voted_up": false, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.588069021701812744", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34614276": {"recommendationid": "34614276", "author": {"steamid": "76561198042146419", "num_games_owned": 487, "num_reviews": 10, "playtime_forever": 8285, "playtime_last_two_weeks": 0, "last_played": 1542170775}, "language": "english", "review": "Bethesda's now trying to milk their fans for every penny they can. Shameful.", "timestamp_created": 1504115662, "timestamp_updated": 1504115662, "voted_up": false, "votes_up": 52, "votes_funny": 0, "weighted_vote_score": "0.554327309131622314", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34648251": {"recommendationid": "34648251", "author": {"steamid": "76561198091161237", "num_games_owned": 301, "num_reviews": 21, "playtime_forever": 8076, "playtime_last_two_weeks": 0, "last_played": 1472697171}, "language": "english", "review": "Replacing my review as it was not informative enough. \nAs you can see from the hours I have played, I greatly enjoyed this game. I was not one of the people that disliked the settlement system or someone who was angry about the fading rp elements. That being said, I can no longer recommend a game published or made by this company again. \n\nAdding paid mods, or some other method of rewarding mod devs for the hard work that is put in, is not something I am against. However the way Bethesda has implemented this Creation Club shows it is not for the mod devs, but is merely a cash grab for the company. They are taking advantage of mod devs that do not know the value of the mods they create, money being only a one time payment. If Bethesda wanted mod devs to get paid, they would give them a cut of the profits, or better yet, all of them. Bethesda gains plenty of sales from people who enjoy modding, and angering this crowd can harm Fallout's status as a mod paradise. \n\nBethesda has shown they do not care what people think, only what makes them money. Tread carefully around any products they release in the future.", "timestamp_created": 1504227578, "timestamp_updated": 1506664066, "voted_up": false, "votes_up": 748, "votes_funny": 7, "weighted_vote_score": "0.842670440673828125", "comment_count": 25, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34593577": {"recommendationid": "34593577", "author": {"steamid": "76561198020059825", "num_games_owned": 207, "num_reviews": 7, "playtime_forever": 9604, "playtime_last_two_weeks": 0, "last_played": 1513135090}, "language": "english", "review": "Greedy Bethesda paid mods.......", "timestamp_created": 1504054261, "timestamp_updated": 1504054261, "voted_up": false, "votes_up": 30, "votes_funny": 1, "weighted_vote_score": "0.536832690238952637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35059075": {"recommendationid": "35059075", "author": {"steamid": "76561198095731240", "num_games_owned": 94, "num_reviews": 2, "playtime_forever": 6024, "playtime_last_two_weeks": 0, "last_played": 1547672836}, "language": "english", "review": "How much milk is left in the cow?", "timestamp_created": 1505802783, "timestamp_updated": 1505802783, "voted_up": false, "votes_up": 2046, "votes_funny": 497, "weighted_vote_score": "0.850650131702423096", "comment_count": 42, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34382802": {"recommendationid": "34382802", "author": {"steamid": "76561198044016870", "num_games_owned": 267, "num_reviews": 24, "playtime_forever": 7031, "playtime_last_two_weeks": 0, "last_played": 1449688850}, "language": "english", "review": "Gosh, what a disappointment.\nThe dumbing down of games scares me, especially when such a great series as Fallout gets dumbed down.\nAnd its such a shame that this game is so lackluster in comparison to Fallout: New Vegas. \nIm guessing the next game will have microtransactions and crates....", "timestamp_created": 1503265199, "timestamp_updated": 1503265199, "voted_up": false, "votes_up": 2032, "votes_funny": 45, "weighted_vote_score": "0.841128349304199219", "comment_count": 41, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34636098": {"recommendationid": "34636098", "author": {"steamid": "76561198057537923", "num_games_owned": 123, "num_reviews": 4, "playtime_forever": 36066, "playtime_last_two_weeks": 0, "last_played": 1550628339}, "language": "english", "review": " The Creation Club automatically downloads ALL CC content to Your system, weather You have interest in it or not.\nThis means that no matter how large of a storage device You have (HDD or SSD), so long as CC exists in this state and is providing content, You WILL run out of drive space.\n Sure, You can manually delete the files AFTER they've downloaded, but having the user constantly performing manual file maintenance over paid content They have no interest in is insane.\n\nAnd then there are the bandwidth concerns for those poor bastards on limited connections.\n\n In the blink of an eye, Fallout 4 went from \"Silly, poorly written sandbox that I get a chuckle out of\", to \"Multiplier virus\".\n\n Granted, at 254 hours logged in, I've personally gotten My money's worth, so if I have to uninstall FO4 for the sake of protecting My system's integrity, no biggie.\n\nSee ya'll in New Vegas.", "timestamp_created": 1504191643, "timestamp_updated": 1504191643, "voted_up": false, "votes_up": 57, "votes_funny": 0, "weighted_vote_score": "0.638965606689453125", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34510536": {"recommendationid": "34510536", "author": {"steamid": "76561198058393545", "num_games_owned": 526, "num_reviews": 5, "playtime_forever": 2441, "playtime_last_two_weeks": 0, "last_played": 1516215400}, "language": "english", "review": "[h1]Preface[/h1] Buy it when its on sale. The game is a massive overhaul of the former 3D Fallout titles. All actual thinking is removed from the game and now perks mean nothing. Get your overpowered suit of armor 10 minutes in, kill your first deathclaw 12 minutes in. I can't help but ask what is going on in Todd Howard's head. The game revolves around a 3 phase core; \n[list]\n[*]step 1: go to a location; \n[*]step 2: kill everything at said location/complete a shitty quest; \n[*]step 3: loot everything you can and move on to the next place.\n[/list] All the \"RPG\" elements of Fallout are stripped away from the game in favor of a more [i]accurate[/i] representation of combat. \n\n[h1]the graphics[/h1] The art style is okay I guess. Some of the locations look bland and boring and quite frankly I prefer the locations from 3 or New Vegas over these. The color choice is honestly quite sketchy at best and at worse just plain boring. It's akin to going outside and looking at dirt, then turning around and looking at a pile of rocks, then turning and looking at a pile of bricks, then turning and looking at a pile of dog shit. I understand its supposed to be gritty, but couldn't they have made some scenic areas? Something like adding some still functioning neon signs or maybe an area where the vegetation started to regrow? Regardless at its core the game is overall pretty bland on the color choice. Some of the textures look quite hideous for the amount of time and the hardware of todays standards. They don't necessarily detract from the gameplay experience, but when you notice them they do detract from the overall immersion. \n\n[h1]the story[/h1] Okay, lets talk about the story. [spoiler]A nuke crashes into the Boston area and your son gets kidnapped from you at the vault you take shelter in.[/spoiler] Not a bad premise for the story, but not an original one either[spoiler]and by that I mean the kidanpping part[/spoiler]. It's better than being a prisoner who becomes a savior by far, but nothing new on this front. The only problems I have with the story is that it isn't very memorable nor does it have any reprecussions for you ignoring it. You can spend 2000 hours not giving a single fuck about your [spoiler]kidnapped son[/spoiler] and nothing happens. No synth takeover, nothing. It would have been interesting to have a time limit of sorts to [spoiler]save your son[/spoiler] and if you dont get to [spoiler]him[/spoiler] in time then a massive synth incorporation into the society happens. Why this was never thought of or put into the game I'll never know. \n\n[h1]the sound[/h1] Overall the sound design is pretty good. I like the atmosperic sounds of the world and it made me feel more engaged in it. Even the creatures of the world had very wonderful and creepy sounds, I loved it. The guns on the otherhand sounded like... well kinda weak. When I fire a gun in my neck of the woods it makes a loud [b]boom[/b], but when I shoot in Fallout 4 it just feels like I'm playing with an [strike]airsoft gun[/strike] a spring gun. It's unsatisying to hear all these amazing overworld sounds and creature sounds and then when you go to shoot it just feels... meh. In this aspect it makes me feel more obligated to playing a melee character which is really fun. Speaking of which \n\n[h1]the gameplay[/h1] The combat in the game feels pretty solid, especially the melee parts. Every hit makes nice impact [spoiler]not really damage-wise but thats what I get for maxing out the difficulty[/spoiler] and its overall an enjoyable experience. The gunplay is very solid too, every shot I can tell exactly where it's going to hit and shooting things is quite a nice experience. The VATS system used in this game is pretty cool, I like how instead of stopping time like some sort of DIO-esque character you instead slow time to slightly faster than a crawl but slower than a second. The killcams also look quite good and allow for some pretty gruesome screenshots. If you want to get this game the best factor of it is the combat hands down. It's not perfect but it's the best its ever been in a Fallout game. The exploration isn't as rewarding as they make it out to be and the randomly generated loot just makes the grind even more of a grind. Adhesive is going to kill your mid to late game if you don't stockpile it as soon as you get started. \n\n\n[h1]the crafting[/h1] I like the idea of crafting upgrades for your weapons and adding say extra damage or extra firing rate give the already lackluster weapons some actual viability on harder difficulties. Of course punching things is the only good meta in the game though and using a suit of power armor just makes the game a cakewalk. I could easily sneak through any area with a power armor and my fists and kill literally anything that moved, breathed, or had a pulse. Giving something that fundamentally broken so early on is a fool hardy move and also given that the combat even on the hardest difficulties is nothing short of piss easy it makes the fanbase move on to getting mods that increase the difficulty or change the start of the game or the \"perk\" system. \n\n[h1]the \"perks\"[/h1] Alright so let's move on to the meat and potatoes. These aren't perks at all, they're minor passive buffs to stats with specific weapons or with your ability to not eat dogass at picking a lock. The only perk in the entire tree worth getting is Blitz. In fact, its so useful it helped me break through walls and almost broke a quest for me [spoiler]it did however break the castle quest and now I can never complete it[/spoiler]. \n\n[h1]my TL;DR[/h1] The game at its core is flawed and a mess, however that isn't to say the game is awful. It's an average game full of below average qualities with an above average combat system and a superb sound design. If they would have tried to make the game more like an ACTUAL fallout game (y'know like with choices and stuff) then I think it would have been a far better title. Gutting the perk system and replacing it with this bastardized shell ruins the RPG element and basically put it on par with a Call of Duty clone or an MMO but singleplayer only [spoiler]commentary on how ESO is literally singleplayer the multiplayer experience, but not[/spoiler]. The foundation is there but they forgot to put up the walls. And fill in the floors. And put in plumbing. And put in a powergrid. The game falls short on so many levels to its predecesor that honestly I wouldn't even recommend it at all unless you really want to play it for the combat. But then why are you even playing a fallout game if you care about the combat.", "timestamp_created": 1503769536, "timestamp_updated": 1503769536, "voted_up": false, "votes_up": 1821, "votes_funny": 21, "weighted_vote_score": "0.847826659679412842", "comment_count": 49, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34669126": {"recommendationid": "34669126", "author": {"steamid": "76561197993652342", "num_games_owned": 302, "num_reviews": 4, "playtime_forever": 16527, "playtime_last_two_weeks": 0, "last_played": 1542604300}, "language": "english", "review": "Just say no to paid mods.", "timestamp_created": 1504299351, "timestamp_updated": 1504299351, "voted_up": false, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.554849028587341309", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35255513": {"recommendationid": "35255513", "author": {"steamid": "76561198015140861", "num_games_owned": 4220, "num_reviews": 14, "playtime_forever": 11991, "playtime_last_two_weeks": 119, "last_played": 1551258107}, "language": "english", "review": "Creation Club is overpriced, copies mods from the community and then sells them for money.\nThe quality of those paid mods is bad. It's mostly copied from the community, ported from their own games or incredibly basic. Like a solid black skin for up to 1$.\n\nTerribly anti-customer and even breaches their own Creation Club rules.\nThis sort of practices should not be supported. \n\nLast chance to turn things around with this developer.\nEither Creation Club goes or all hope in this developer is lost.", "timestamp_created": 1506577876, "timestamp_updated": 1506580751, "voted_up": false, "votes_up": 234, "votes_funny": 0, "weighted_vote_score": "0.849422454833984375", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34649133": {"recommendationid": "34649133", "author": {"steamid": "76561198004054676", "num_games_owned": 345, "num_reviews": 6, "playtime_forever": 6852, "playtime_last_two_weeks": 0, "last_played": 1476107422}, "language": "english", "review": "Thumbs down for the creation club filling up our hard drives without permission and breaking the fallout 4 script extender.", "timestamp_created": 1504231034, "timestamp_updated": 1508636669, "voted_up": false, "votes_up": 472, "votes_funny": 4, "weighted_vote_score": "0.826210498809814453", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34585169": {"recommendationid": "34585169", "author": {"steamid": "76561197996365972", "num_games_owned": 324, "num_reviews": 4, "playtime_forever": 5850, "playtime_last_two_weeks": 169, "last_played": 1551180651}, "language": "english", "review": "ALL mods from F4 Nexus are broken now!! Game won't even start! TYVM Bethesda, I don't want your freaking paid mods!! Just bought Far Harbor and wanted to play the game I paid for with the FREE mods I used for 2 years! AAHH I'm so angry right now...\n\nedit: uninstalled F4SE, all my mods, deleted Fallout4.ini and Fallout4Prefs and it still crashes to desktop, thanks again Bethesda, you ruined my day!\n\nedit 2: At least I can start the game again. Had to delete a file in my F4 folder that changed F4 main menu. Negative review remains though because of introduction of Creation Club BS. Prices for paid mods are riciculous, they should be FREE!!", "timestamp_created": 1504032727, "timestamp_updated": 1504044308, "voted_up": false, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.610848307609558105", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34736430": {"recommendationid": "34736430", "author": {"steamid": "76561198009390722", "num_games_owned": 158, "num_reviews": 2, "playtime_forever": 26289, "playtime_last_two_weeks": 0, "last_played": 1530422157}, "language": "english", "review": "Mods for a price tag. No thanks.", "timestamp_created": 1504536745, "timestamp_updated": 1504536745, "voted_up": false, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.541778683662414551", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34695401": {"recommendationid": "34695401", "author": {"steamid": "76561198014324527", "num_games_owned": 84, "num_reviews": 7, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1542686886}, "language": "english", "review": "First of all, 2 GB patch to add paid mods. Fuck off.\n\nSecondly, much is the case for most Bethesda games, this game is optimized like total garbage for PC.\n\n\n\n\nAnother settlement needs your help.", "timestamp_created": 1504386325, "timestamp_updated": 1504386325, "voted_up": false, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.626212954521179199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34773196": {"recommendationid": "34773196", "author": {"steamid": "76561198058705791", "num_games_owned": 177, "num_reviews": 17, "playtime_forever": 5218, "playtime_last_two_weeks": 0, "last_played": 1506157766}, "language": "english", "review": "good job Bethesda, you alienated another customer to your company.\n\nI refuse to support any company that tries to pinch even more money when we already get nothing but DLC's and Microtransactions. i would have sent this review to the creation club but no one ( at the time of making this ) was brainless enough to buy it and review it...\n\nTl;DR\nYou stepped in dog crap and are tracking it everywhere. Take your sorry ass and get out :)", "timestamp_created": 1504694936, "timestamp_updated": 1504695184, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.511395514011383057", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34781101": {"recommendationid": "34781101", "author": {"steamid": "76561198227503160", "num_games_owned": 30, "num_reviews": 2, "playtime_forever": 9657, "playtime_last_two_weeks": 0, "last_played": 1544728178}, "language": "english", "review": "2 GB for something behind a paywall", "timestamp_created": 1504723711, "timestamp_updated": 1504723711, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.545786559581756592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34619504": {"recommendationid": "34619504", "author": {"steamid": "76561197998349643", "num_games_owned": 264, "num_reviews": 2, "playtime_forever": 40025, "playtime_last_two_weeks": 0, "last_played": 1507495602}, "language": "english", "review": "Paid mods? Again? Don't you idiots learn? This was the last your products I will ever pay for unless your business practices drastically change, anything else from now on I'll be getting from the usual alternative places (Yarrr).\n\nActual review: Story is weak and a major failing point. Voice acted protaganist hamstrings dialogue choices and role playing options. World is vast but shallow with potential fun to explore that is never reached by the developers and writers. Only after a large variety of creative free mods (and community bugfixes) are added does the game begin to feel complete and compelling.", "timestamp_created": 1504130260, "timestamp_updated": 1504130260, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.54463958740234375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34633673": {"recommendationid": "34633673", "author": {"steamid": "76561198041174911", "num_games_owned": 136, "num_reviews": 3, "playtime_forever": 7985, "playtime_last_two_weeks": 0, "last_played": 1476905031}, "language": "english", "review": "It's just paid mods again!", "timestamp_created": 1504183943, "timestamp_updated": 1504183943, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.527395308017730713", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35804322": {"recommendationid": "35804322", "author": {"steamid": "76561198011544831", "num_games_owned": 882, "num_reviews": 2, "playtime_forever": 4511, "playtime_last_two_weeks": 0, "last_played": 1541194165}, "language": "english", "review": "Greedy bethesda destorying their own flagship titles, never thought i'd see the day.", "timestamp_created": 1508273413, "timestamp_updated": 1508273413, "voted_up": false, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.582376837730407715", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34697730": {"recommendationid": "34697730", "author": {"steamid": "76561198016683102", "num_games_owned": 225, "num_reviews": 2, "playtime_forever": 15094, "playtime_last_two_weeks": 0, "last_played": 1535811395}, "language": "english", "review": "Not only do they decide that they own your SSD, they also deny you the privelage of using mods that the community creates.  Congrats on destroying such a ripe game, Bethesda.  You never game the modding community a chance.", "timestamp_created": 1504394205, "timestamp_updated": 1504394205, "voted_up": false, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.563225150108337402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34910898": {"recommendationid": "34910898", "author": {"steamid": "76561198008966134", "num_games_owned": 147, "num_reviews": 2, "playtime_forever": 9151, "playtime_last_two_weeks": 0, "last_played": 1519083897}, "language": "english", "review": "Microtransactions for new paintjobs in a single player RPG? No thanks.", "timestamp_created": 1505262794, "timestamp_updated": 1505262794, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.568445682525634766", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34619522": {"recommendationid": "34619522", "author": {"steamid": "76561197999453172", "num_games_owned": 225, "num_reviews": 5, "playtime_forever": 7346, "playtime_last_two_weeks": 0, "last_played": 1529518232}, "language": "english", "review": "paid mods for FPS fallout", "timestamp_created": 1504130311, "timestamp_updated": 1504130311, "voted_up": false, "votes_up": 34, "votes_funny": 1, "weighted_vote_score": "0.529841721057891846", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34646217": {"recommendationid": "34646217", "author": {"steamid": "76561198030975740", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 34452, "playtime_last_two_weeks": 0, "last_played": 1533360510}, "language": "english", "review": "I have limited downloads per month from my ISP and Bethesda wasted a ton of mine. I didn't know till after the update that it was about paid mods that I will NEVER use.", "timestamp_created": 1504220324, "timestamp_updated": 1504220324, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.612495064735412598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34672198": {"recommendationid": "34672198", "author": {"steamid": "76561198072147283", "num_games_owned": 61, "num_reviews": 10, "playtime_forever": 7644, "playtime_last_two_weeks": 0, "last_played": 1471877362}, "language": "english", "review": "Good job Bethesda, you have hammered the last nail in your coffin. \n20+ years of reputation down the drain in a few months.\n\nCorporate assholes.", "timestamp_created": 1504310417, "timestamp_updated": 1504310417, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.590548992156982422", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34651607": {"recommendationid": "34651607", "author": {"steamid": "76561198050160910", "num_games_owned": 395, "num_reviews": 2, "playtime_forever": 8151, "playtime_last_two_weeks": 0, "last_played": 1542879873}, "language": "english", "review": "Paid Mods.\n\nBethesda has tried this before to attempt to divide and conquer our modding community where helping others and having fun making mods will be replaced with copyright issues, trade secrets and bunch of other unnecessary shit.\n\nIf Bethesda actually made a complete game, this would be one thing, but any recent Bethesda titles RELY on mods to help push sales otherwise they would have a fraction of the sales they have now.\n\nI will no longer be purchasing anything from Bethesda unless this decision is removed, and this train of thought to monetize mods is completely ended.", "timestamp_created": 1504241836, "timestamp_updated": 1504241836, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.584512233734130859", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34633596": {"recommendationid": "34633596", "author": {"steamid": "76561198129723782", "num_games_owned": 216, "num_reviews": 44, "playtime_forever": 12297, "playtime_last_two_weeks": 0, "last_played": 1533809066}, "language": "english", "review": "good game, bad fallout, sh**** paid mods", "timestamp_created": 1504183611, "timestamp_updated": 1504183611, "voted_up": false, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.528960943222045898", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34915734": {"recommendationid": "34915734", "author": {"steamid": "76561198030605266", "num_games_owned": 607, "num_reviews": 19, "playtime_forever": 11837, "playtime_last_two_weeks": 0, "last_played": 1528814015}, "language": "english", "review": "paid mods, again", "timestamp_created": 1505292973, "timestamp_updated": 1505292973, "voted_up": false, "votes_up": 286, "votes_funny": 6, "weighted_vote_score": "0.688156187534332275", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34608351": {"recommendationid": "34608351", "author": {"steamid": "76561198079366364", "num_games_owned": 42, "num_reviews": 1, "playtime_forever": 16612, "playtime_last_two_weeks": 0, "last_played": 1537522911}, "language": "english", "review": "Paid Mods.", "timestamp_created": 1504101417, "timestamp_updated": 1504101417, "voted_up": false, "votes_up": 66, "votes_funny": 0, "weighted_vote_score": "0.555686533451080322", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47315659": {"recommendationid": "47315659", "author": {"steamid": "76561198137564903", "num_games_owned": 31, "num_reviews": 3, "playtime_forever": 28936, "playtime_last_two_weeks": 18, "last_played": 1550762110}, "language": "english", "review": "Please stop rolling out insignificant patches. The patches fix none of the existing bugs, creation club content are not interesting to most customers, and most customers use mods that require script extender that requires runtime to remain the same. Your patches breaks mods that fix your bugs.\n\nThe customers should not have the burden of preventing unwanted updates that break an already working game after weeks of modding it themselves. Please just stop with the constant updates. With Skyrim SE and with Fallout 4. Just stop. Please.", "timestamp_created": 1544046060, "timestamp_updated": 1544046060, "voted_up": false, "votes_up": 976, "votes_funny": 35, "weighted_vote_score": "0.867971360683441162", "comment_count": 47, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34625146": {"recommendationid": "34625146", "author": {"steamid": "76561197984081126", "num_games_owned": 554, "num_reviews": 1, "playtime_forever": 30485, "playtime_last_two_weeks": 0, "last_played": 1539326983}, "language": "english", "review": "Thanks for breaking the script extender again, and forcing paid mod files that I will never use to be downloaded to sit on my hard drive. \n\nI was in the middle of a survival-mode run, which was actually getting fun, after picking the game back up for the first time since last year. \n\nNow I would have to revert files and double check my saves if I did want to continue playing, which I don't anymore.", "timestamp_created": 1504151605, "timestamp_updated": 1504151605, "voted_up": false, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.568876743316650391", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34633583": {"recommendationid": "34633583", "author": {"steamid": "76561198072857762", "num_games_owned": 216, "num_reviews": 18, "playtime_forever": 4077, "playtime_last_two_weeks": 0, "last_played": 1517755665}, "language": "english", "review": "Creation Club isnt like paid mods. Hahahaha of course not, Bethesda, of course not.....!", "timestamp_created": 1504183557, "timestamp_updated": 1504183557, "voted_up": false, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.526320695877075195", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34608315": {"recommendationid": "34608315", "author": {"steamid": "76561198017598080", "num_games_owned": 952, "num_reviews": 5, "playtime_forever": 7344, "playtime_last_two_weeks": 0, "last_played": 1455578266}, "language": "english", "review": "As with most Bethesda games, Fallout 4 requires multiple quality of life mods. With the introduction of paid mods Bethesda is making a blatant money grab and will have an excuse to release more unfinished, unpolished games with hopes the community will continue to fix it for them while making money off of he effort of others. Download mods from other sources and donate to the mod creators directly.", "timestamp_created": 1504101295, "timestamp_updated": 1504101295, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.555952668190002441", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34619457": {"recommendationid": "34619457", "author": {"steamid": "76561197971260784", "num_games_owned": 144, "num_reviews": 5, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1497497538}, "language": "english", "review": "Paid mods. That's what creation club is", "timestamp_created": 1504130115, "timestamp_updated": 1504130115, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.503047287464141846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34626745": {"recommendationid": "34626745", "author": {"steamid": "76561198126024380", "num_games_owned": 166, "num_reviews": 1, "playtime_forever": 3622, "playtime_last_two_weeks": 0, "last_played": 1503539097}, "language": "english", "review": "Paid Mods..", "timestamp_created": 1504158878, "timestamp_updated": 1511415251, "voted_up": false, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.603304922580718994", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34669167": {"recommendationid": "34669167", "author": {"steamid": "76561198044579031", "num_games_owned": 268, "num_reviews": 2, "playtime_forever": 14965, "playtime_last_two_weeks": 0, "last_played": 1529175723}, "language": "english", "review": "You are now forced to pre-load Creation Club content...... thanks Bethesda i dont need the drive space for anything.... its fine....no really its cool", "timestamp_created": 1504299494, "timestamp_updated": 1504299494, "voted_up": false, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.52848207950592041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34736419": {"recommendationid": "34736419", "author": {"steamid": "76561198062623650", "num_games_owned": 125, "num_reviews": 12, "playtime_forever": 39809, "playtime_last_two_weeks": 404, "last_played": 1551571882}, "language": "english", "review": "The creation club content is practically ransomware, do your reasearch. This is going to destroy peoples hard drives.... I have lost all faith in Bethesda and will no longer be a customer.", "timestamp_created": 1504536709, "timestamp_updated": 1504536709, "voted_up": false, "votes_up": 193, "votes_funny": 4, "weighted_vote_score": "0.6503448486328125", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34759691": {"recommendationid": "34759691", "author": {"steamid": "76561197982620270", "num_games_owned": 360, "num_reviews": 4, "playtime_forever": 4119, "playtime_last_two_weeks": 0, "last_played": 1515199129}, "language": "english", "review": "Creation Club is basically robbery.", "timestamp_created": 1504627979, "timestamp_updated": 1504627979, "voted_up": false, "votes_up": 46, "votes_funny": 1, "weighted_vote_score": "0.612926483154296875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34437455": {"recommendationid": "34437455", "author": {"steamid": "76561198143406344", "num_games_owned": 330, "num_reviews": 6, "playtime_forever": 8357, "playtime_last_two_weeks": 0, "last_played": 1542394808}, "language": "english", "review": "Its not a bad game but its a bad fallout.\n\nIn comparison with the older fallouts(objectively speaking):\nPros:\n-Better gameplay\n-Better graphics\n-New mechanics\nCons:\n-Conversation system is downgraded\n-A lack of choice , reputation or karma system\n-Less interesting perks and S.P.E.C.I.A.L. effects\n-Optimization(at least on my amd setup \"r9 390 fx8350\")\n\nObservations(subjectively speaking):\n-Fallout 4 feels more like a sandbox with some basic rpg mechanics than a actual open-world rpg.\n-The mainstory it's not so impressive.\n-After you do all the quests(not the procedurally generated quests) it turn very repetitive.\nUPDATE: Paid mods on pc? If you want to support the mods developers just donate on nexus and dont waste your money with CreativeClub...\n\nIn conclusion:\nIf you want a skyrim type of game but with a fallout atmosphere buy this game.\nIf you want a fallout game where your decision have a more relevant impact in the world, look for FallOut 3 or Fallout New Vegas.\nIf you want to feel the real fallout experience try Fallout 1 and 2(released in the 90s).\n\nWhy i thumbs down this game?\nI am a big fallout fan and i consider FallOut NV my favorite game of all time.I was very hyped about Fallout 4 and i preorder it(the only preorder i ever made and the last one to). I start playing it from the first day. I ignored the optimization problems however what I could not ignore is the path that Bethesda chose for fallout 4(i understand why they did it). \nThis game is not a bad game, actually is a very good sandbox but i prefer other things from a fallout. I'm referring to the possibility of being who you want to be and see how the world around you reacts to that.", "timestamp_created": 1503492630, "timestamp_updated": 1504265247, "voted_up": false, "votes_up": 1708, "votes_funny": 11, "weighted_vote_score": "0.842848896980285645", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34618311": {"recommendationid": "34618311", "author": {"steamid": "76561197980617595", "num_games_owned": 100, "num_reviews": 1, "playtime_forever": 1901, "playtime_last_two_weeks": 0, "last_played": 1504138996}, "language": "english", "review": "Paid Mods.", "timestamp_created": 1504126764, "timestamp_updated": 1504126764, "voted_up": false, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.546416342258453369", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34563094": {"recommendationid": "34563094", "author": {"steamid": "76561198065082004", "num_games_owned": 589, "num_reviews": 117, "playtime_forever": 6745, "playtime_last_two_weeks": 0, "last_played": 1532868945}, "language": "english", "review": "2 Words. Creation Club", "timestamp_created": 1503956868, "timestamp_updated": 1503956868, "voted_up": false, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.61448979377746582", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34609843": {"recommendationid": "34609843", "author": {"steamid": "76561198060877786", "num_games_owned": 253, "num_reviews": 6, "playtime_forever": 4690, "playtime_last_two_weeks": 0, "last_played": 1545238050}, "language": "english", "review": "no paid mods", "timestamp_created": 1504104991, "timestamp_updated": 1504104991, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.519583463668823242", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34639913": {"recommendationid": "34639913", "author": {"steamid": "76561197993268333", "num_games_owned": 201, "num_reviews": 8, "playtime_forever": 46186, "playtime_last_two_weeks": 0, "last_played": 1546864063}, "language": "english", "review": "The Creation Club is a terrible idea and I sincerely hope Bethesda will realize it was a mistake to introduce this thinly veiled cash grab.", "timestamp_created": 1504202318, "timestamp_updated": 1504202318, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.484409123659133911", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34616996": {"recommendationid": "34616996", "author": {"steamid": "76561198074381521", "num_games_owned": 83, "num_reviews": 2, "playtime_forever": 11078, "playtime_last_two_weeks": 0, "last_played": 1534426248}, "language": "english", "review": "The Creation Club is a bad idea.", "timestamp_created": 1504123223, "timestamp_updated": 1504123223, "voted_up": false, "votes_up": 1490, "votes_funny": 19, "weighted_vote_score": "0.846137046813964844", "comment_count": 12, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34600552": {"recommendationid": "34600552", "author": {"steamid": "76561198002870741", "num_games_owned": 4970, "num_reviews": 90, "playtime_forever": 3408, "playtime_last_two_weeks": 0, "last_played": 1504078524}, "language": "english", "review": "War never changes.. Bethesdas greed also never changes..\n\nThe base game didn´t really impress me enough to write a review back then, the dialogue system was lackluster, the Sim building like outposts thing get´s boring after some time.. etc etc.\nThen the game wouldn´t work proper anymore because of a resolution bug and i couldn´t bother to fix it again.\n\nSo i thankfully missed Beth´s move to open up their own sh*tty mod \"store\" where you can inconveniently browse a long line of mods, for consoles as well as for pc, with lackluster search and bare of any other function. Doing this they also disabled achievements if you just use any mods, something not even Total War Series, with also an often bothersome handling of mods did up to now. So if you just use some graphical improvements or a mod to get rid of some of their many bugs - forget them Cheevos, mate.\nTheir last step, to open up the newest (and probably most important) addition to their modding hell.. paid mods again - with fittingly a f*cking horse armor for just a few bucks - is the last step on their way to my personal shit list.\n\nIt´s quite sad to see what the future for Elder Scrolls (last game a MMO) and Fallout (last game a Web Sim Game) seems to hold, only thing i can do is writing this little rant and make sure they don´t see my money any day soon again.\n", "timestamp_created": 1504079307, "timestamp_updated": 1504079307, "voted_up": false, "votes_up": 849, "votes_funny": 16, "weighted_vote_score": "0.838428914546966553", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34593512": {"recommendationid": "34593512", "author": {"steamid": "76561198012984725", "num_games_owned": 568, "num_reviews": 1, "playtime_forever": 10148, "playtime_last_two_weeks": 0, "last_played": 1530374922}, "language": "english", "review": "Remember that one time? Yeah, that one time they tried paid mods again?\n\nWell don't worry! The mods don't cost real money!\n\nSure you have to invest in a point system to access them, but the mods don't cost money!\n\nYou see? It is still just the same free system, there is no money involved in the mods.\n\nSure you can buy points, but only if you want.\n\nNo, there isn't another way to get points... but the mods are free!", "timestamp_created": 1504054047, "timestamp_updated": 1504054047, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.5695343017578125", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34591311": {"recommendationid": "34591311", "author": {"steamid": "76561198038299763", "num_games_owned": 272, "num_reviews": 4, "playtime_forever": 7807, "playtime_last_two_weeks": 0, "last_played": 1519857811}, "language": "english", "review": "FO4 Creation Club? How many times do we have to tell you... no. Please, no paid mods, whether it be paid with fake currency or real currency. \n\nPros:\n+not as blocky as previous games, most of it is due to lighting\n+player character\n+factions that are pretty neat\n+game does a good job of eating time, it's engaging\n+again, the lighting helps a lot\n\nCons:\n-Power armor in the first hour? ????\n-Radscorpions IN MASSACHUSETTS?\n-Where the heck is karma and why is it limited to companions?\n-The stock weapon choices are abysmal at best, and previous 3D games did not have so many improvised weapons.\n-All of a sudden, power armor requires fusion cores, another odd change from the previous 3D games\n-Performance is bad for how this game has so many relatively low-res objects\n-STOP. TRYING. TO. MAKE. US. PAY. FOR. MODS. Seriously, can't you just use your infinite creativity to do something other than rehash old releases? Release a new game that isn't a friggin' money grab. Shame. On. You.\n-Most of Boston is intact yet everything is coated in rubble, and a nuke didn't even hit it directly...\n-Why did Boston not get hit by any nukes directly? The reasoning should be explored, since New Vegas actually explained why it was that way.\n-How come in the base game, you can't make anything that looks new, and nothing looks new or untattered other than cartons of cigarettes, 210 year old beer, and cans of food? Did people forget how to manufacture and make concrete walls/walls that aren't made of rubble until you added it into the game?", "timestamp_created": 1504047361, "timestamp_updated": 1504047361, "voted_up": false, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.514563381671905518", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34633686": {"recommendationid": "34633686", "author": {"steamid": "76561198038853976", "num_games_owned": 77, "num_reviews": 2, "playtime_forever": 9793, "playtime_last_two_weeks": 0, "last_played": 1496805664}, "language": "english", "review": "Creation Club can suck it", "timestamp_created": 1504183985, "timestamp_updated": 1504183985, "voted_up": false, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.527395308017730713", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34562965": {"recommendationid": "34562965", "author": {"steamid": "76561198002093599", "num_games_owned": 449, "num_reviews": 6, "playtime_forever": 1904, "playtime_last_two_weeks": 0, "last_played": 1542131203}, "language": "english", "review": "[quote]After discussion with Valve, and listening to our community, paid mods are being removed from Steam Workshop. Even though we had the best intentions, the feedback has been clear – this is not a feature you want. Your support means everything to us, and we hear you.[/quote]\n[url=http://kotaku.com/valve-cancels-paid-mods-for-skyrim-1700526130][Source and context][/url]\n\n\nRead: \"[i]We hear you, but our love for money is greater than for our fans and supporters and we are deaf anyways.[/i]\" \n\n\nThis is a slightly better iteration of the infamous attempt, but ultimately it's like saying getting shot in the arm is better than in the head.\nBethesda, [i]at which point[/i] did you think that this was a \"feature we want\"? \n[url=https://www.youtube.com/watch?v=XRkrascT_iM]►The youtube trailer◄[/url] at the time of posting sits at  479800 views, and... \n[b]3383 likes[/b] versus [b]59507 dislikes[/b].\nI am seriously disappointed. I honestly hope this flops just as hard as your other attempt.\n\n\nShame on you! You cannot release a game that works normally 0day, but you have capacity for this. You have lost one customer, and i will make sure word gets around.\n\n\n\nEdit: formatting", "timestamp_created": 1503956452, "timestamp_updated": 1515339464, "voted_up": false, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.624041497707366943", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34622387": {"recommendationid": "34622387", "author": {"steamid": "76561198014043173", "num_games_owned": 656, "num_reviews": 4, "playtime_forever": 5543, "playtime_last_two_weeks": 0, "last_played": 1546536573}, "language": "english", "review": "Thanks a lot for killing a franchise", "timestamp_created": 1504140840, "timestamp_updated": 1504140840, "voted_up": false, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.575258255004882813", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45179724": {"recommendationid": "45179724", "author": {"steamid": "76561198087952112", "num_games_owned": 123, "num_reviews": 2, "playtime_forever": 22295, "playtime_last_two_weeks": 5, "last_played": 1550801502}, "language": "english", "review": "I have a difficult relationship with Fallout 4, I absolutely love this game modding it to no end fine-tailoring the game to any playstyle I fancy at the time and going full ham on it but this here is the problem.\n\nI've spent 300 hours on this game and have enjoyed it (mostly, but we'll get to that), and if you asked me a year ago I would reccommend it despite not meeting expectations of prior Fallout fans (And understandbly) just for the insane amount you can mod this.\n\nBut now days, Fallout 4 is broken as hell and all because of one thing; Creation Club\n\nI'm not going to focus on the controvercy of Creation Club, there is plently to look if you want the full scoop on that, but my main gripe is how Creation Club forcefully updates itself every month onto your Fallout 4, that doesn't sound to bad right? Maybe a bit unexpected but hey it doesn't hurt right?\n\nNo no no, it does; and it's completely destroyed one of my oldest playthroughs.\n\nFirstly; everytime Creation Club updates it breaks F4SE, a lot of people unfortunatly know and experience this, fortunately F4SE keeps itself up to date every month however you'll also need to update any mods that use the script extender thus it can be weeks before you can play your full modded game again (And if the mod auther has stopped working or discontinued the mod you're out of luck), and the cycle repeats every month.\n\nSecond; Creation Club clutters your Load Order, this may sound like more of a nuesence but this is what royally screwed me up, Fallout 4 is only able to load a total of 255 mods (Including Creation Club and DLCs) before it will start randomly knocking out mods and acting strange to keep that 255, because I wasn't prepared for this months update it lead me over the mod load and completely reset all my quests on my main character and also deleted all companions, items and settlements as I had everything in the Mechanist Lair.\n\nFallout 4 is a game made fun by modding it a year ago, but now with Creation Club playing it has become a chore of maintence fixing it every month with time that I'm gated out of the game until F4SE updates and after enduring it for so long I have finally grown tired of it.\n\nRegardless if you agree with Creation Club or not these problems need to get fixed or the very least addressed as it's been months now and we're just repeating the same cycle of having our Fallout 4's broken by updates and being unable to play with mods.", "timestamp_created": 1539028757, "timestamp_updated": 1539028757, "voted_up": false, "votes_up": 414, "votes_funny": 24, "weighted_vote_score": "0.853557765483856201", "comment_count": 17, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34619510": {"recommendationid": "34619510", "author": {"steamid": "76561198012657918", "num_games_owned": 294, "num_reviews": 3, "playtime_forever": 6449, "playtime_last_two_weeks": 0, "last_played": 1500238572}, "language": "english", "review": "First and foremost. PAID MODS. They're back. Wanna pay a dollar for a black paint job on your power armor? DO IT! Wanna pay 4 dollars for a reupload of a fanmade mod? DO IT!\n\nApart from that, watered down story, uninspired combat, more than half the DLC focused entire on the superfluous and honestly terrible base building stuff.\n\nDon't give Bethesda more money. Stay away. Teach these idiots a lesson.", "timestamp_created": 1504130282, "timestamp_updated": 1504130282, "voted_up": false, "votes_up": 395, "votes_funny": 6, "weighted_vote_score": "0.7145233154296875", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 65455, "total_negative": 31058, "total_reviews": 96513}}
