{"reviews": {"48828894": {"recommendationid": "48828894", "author": {"steamid": "76561198065308104", "num_games_owned": 229, "num_reviews": 8, "playtime_forever": 42361, "playtime_last_two_weeks": 0, "last_played": 1520354730}, "language": "english", "review": "They finally moved the genre only minecraft seemed to be able to master and pushed it forward with better graphics, gadgets, easy to use block rotation, plots, and a feeling of steady of progression the deeper underground you go. \n\n1. Graphics and optimization \nNot too much to say here as you can see the video but rest assured everything you see is the same in game. I see a lot of people talking about skipping and optimization being bad but this game is really smooth as butter for me. Can pull off 360 headshots with acorns no problem. \n2. Gadgets\nThere's so many fun gadgets to use. One that can completely remove a block wall to reveal the entrance to your secret lair if you stand in a certain cell for over 5 seconds. Trust me...no one will be able to find this room unless you show them a few times. Or my personal favorite...the teleporter sitting on a single block high up above a pool of lava sorrounded by fans.\n3. Block rotation and plots\nTheir implementation of block rotation saves so much time for building structures and can even make it seem like you have three times as many options as to what you'd like your wall to look like. \nPlots are another thing they made(before Trove) but if you have ever played Trove it's nearly the same except instead of being able to move plots, you're able to have multiple(up to 8 or 10? i normally dont go for more than 4). This way you can make your server public and not have to worry about trolls destroying all your buildings while still having lots of players building. Say you want a friend to be able to  work on your plot? While you can with an easy to use permission menu which also locks chests. \n\nMy final feeling on this is that the BASE game is 10x better than minecraft's BASE game. It's even easier to play with your friends because you don't have to pay monthly for a server and they are not required to input any ip information to join your world. Not to mention the game itself is free too, so there's no loss if they try it out and decide building games aren't fitting to their taste. Of course, in the end modded minecraft is a better game for the extreme amount of options and mods. If you don't own either I would highly you advise you to play this game first", "timestamp_created": 1549563255, "timestamp_updated": 1549563255, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.577668726444244385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49058084": {"recommendationid": "49058084", "author": {"steamid": "76561198248861434", "num_games_owned": 7, "num_reviews": 5, "playtime_forever": 535, "playtime_last_two_weeks": 0, "last_played": 1550429410}, "language": "english", "review": "It's good for a free alternative to Minecraft", "timestamp_created": 1550426799, "timestamp_updated": 1550426799, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.573346078395843506", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49189444": {"recommendationid": "49189444", "author": {"steamid": "76561198067475691", "num_games_owned": 220, "num_reviews": 12, "playtime_forever": 13401, "playtime_last_two_weeks": 992, "last_played": 1551097272}, "language": "english", "review": "Let me start by saying that I absolutely love this game. I started when it still cost money to buy (at launch) and went through a lot with the developers. From suddenly making the game free (without really communicating), to adding the paid option, to suddenly having to buy blocks even though I bought the game so I could play for free for the rest of time. It was a lot of disappointments - one that I still have. I believe this game would do better to make it a paid version and make the rest free.\n\nAnyway, the gameplay is fun. I love building and exploring, and the blue print idea is the very best (one that we fought hard for to let them make something so we could share builds and use blue prints from others).\n\nHowever, the lag spikes are insane. My computer is well enough ,the graphics aren't that high or ask for a lot, yet I get these little spikes every few seconds. And of course it always happens when I need to jump over something high, and the jump fails and I fall to my death - AGAIN. It makes playing nearly impossible and it causes more annoyance than pleasure.\n\nBecause of the bad performance of the server (which they say is our internet or our computer - which in my case it really isnt), their lack of communicating and their unwillingness to solve the number 1 issue from the community and just telling us it's our own fault, I can not recommend this game.\n\nLots of potential, please start listening to your players and don't screw this up. It's still fixable.", "timestamp_created": 1550935112, "timestamp_updated": 1550935112, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.573589682579040527", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thanks for the feedback!  Sorry that you feel we havent been transparent.  We have been pretty active in the forums, specifically as it relates to performance.  Not sure where you are hearing it is your machine, or your internet.  We have performance issues on our side that we need to address.  We own this and are working on that as our number 1 priority.  In the meantime, if you can please submit a ticket to support@playfulcorp.com, Please include your machine specs and world name,  and we will gladly take a look and see if its something we can address right away, or is part of our overall performance updates.  Hopefully we will earn a positive review from you soon.  THANK YOU...."}, "49237512": {"recommendationid": "49237512", "author": {"steamid": "76561198343205247", "num_games_owned": 29, "num_reviews": 11, "playtime_forever": 2834, "playtime_last_two_weeks": 8, "last_played": 1551136109}, "language": "english", "review": "so i really been enjoying this game and i want to make a quick review with pros and cons\n\npros\n+very relaxing and amazing soundtrack\n+lots and lots of blocks\n+many animals and enemies\n+pretty world\n+lots of places and big world\n+fun combat and events\n+when you die you loose only bag stuff\n+you can have pets\n\ncons\n-when you jump at some point you will jump so high you will die\n-well its a dead game and its sad\n-some enemies are same but with other colors\n\nwell thats my review i really want this game to be alive again oh and best way to play and have lots of fun is with friends", "timestamp_created": 1551136713, "timestamp_updated": 1551447650, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.552845537662506104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48834451": {"recommendationid": "48834451", "author": {"steamid": "76561198211106584", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 3793, "playtime_last_two_weeks": 291, "last_played": 1551556449}, "language": "english", "review": "super fun with friends", "timestamp_created": 1549582728, "timestamp_updated": 1549582728, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.564116835594177246", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49289990": {"recommendationid": "49289990", "author": {"steamid": "76561198835599044", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 1711, "playtime_last_two_weeks": 144, "last_played": 1551418822}, "language": "english", "review": "super fun game, I don't do a lot of gaming, but I certainly spend a lot of time in this game. It's kinda similar to minecraft but it's free which I love :)", "timestamp_created": 1551419320, "timestamp_updated": 1551419320, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.508928596973419189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49025284": {"recommendationid": "49025284", "author": {"steamid": "76561198043206903", "num_games_owned": 195, "num_reviews": 15, "playtime_forever": 38590, "playtime_last_two_weeks": 3527, "last_played": 1551876098}, "language": "english", "review": "I have spent over 500 hours with this game - so it is save to assume that this is one of my all time favorite games and i therefore can recommend it to everybody. I play this together with family, friends and the friendly people from the internet.\n\nMy Pro / Cons List\n+ Friendly and helpful community\n+ Easy building (blocks / not objects) - however i recommend to buy the Pro package as the glider helps a lot with larger buildings\n+ Multiple ways / approaches possible eg. Blueprints\n+ Crafting is simple but has many blocks\n+ Big Stacks of Materials which makes it easy to create order (wasn't always like this)\n+ Balanced amount of grinding necessary - it is one of those rare games that i think has found the right amount of grinding necessary for your crafting\n+ All player created worlds have never been wiped - you can still enjoy the buildings from ancient creativerse history\n+ Continuous Updates, Community friendly development Team\n+ Useful server / administrator tools\n- Performance - there are several performance issues that are the main reason when looking through the comments, why they don't recommend the game. However the developer has put this as a top priority to fix (not as other comments suggest that the developer hasn't put it on their to do list) and has proven in the past to be commited on such goals - eventhough i think it will not be easy - i have good faith that they will be able to improve the game. The problem is no game breaker - its just annoying at some times.\n- The bundles can sometimes be a bit expensive and especially the clothing styles should be a bit less pricy in my eyes. But after all stuff like hats are just cosmetic - so...\n- Mobs / animals can sometimes be annoying when your goal is to build something nice and those random pigsys appear on your city street and even at your construction site ;)\n\nHope to see you in game! Test ist with the free option and then buy the Pro for the glyder!", "timestamp_created": 1550307306, "timestamp_updated": 1550307306, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49272176": {"recommendationid": "49272176", "author": {"steamid": "76561198043632915", "num_games_owned": 150, "num_reviews": 5, "playtime_forever": 4643, "playtime_last_two_weeks": 0, "last_played": 1476581376}, "language": "english", "review": "Recommended, but with caveats. \nI have no intention of ever installing this game again, but not because it's bad. \n\nI don't like it personally because there just isn't enough progression. No real tech tree to speak of, and no real adventure elements to speak of. Basically, no reason for me to play. However, if you are looking for a crafting/building game, that seems to be their goal, and they're doing a bangup job with that. I've been watching updates since the first gizmos update that gave us wiring and \"machines\" hoping that they would turn that in to a tech tree and give us a reason to progress through it. Unfortunately, that hasn't happened. While the wiring system was very well done, we never got anything that could be used to build anything interesting, and never anything like a tech tree with any purpose outside of building toys. That being said, that's just what I wanted to see. It isn't something that was ever promised.\n\nWhat I have seen added is A LOT of building materials etc. Building in this game seems to be in a pretty good place.", "timestamp_created": 1551325433, "timestamp_updated": 1551325433, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523121416568756104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49265531": {"recommendationid": "49265531", "author": {"steamid": "76561198141239954", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 3258, "playtime_last_two_weeks": 157, "last_played": 1551427186}, "language": "english", "review": "would be nice if there's an option for creative mode. i mean the name its already CREATIVErse", "timestamp_created": 1551286904, "timestamp_updated": 1551286904, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.508928596973419189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thank you for the feedback!  We are and will constantly evaluate creative mode and others.  Keep an eye out in the near future!  Thank you!"}, "49364032": {"recommendationid": "49364032", "author": {"steamid": "76561198810965415", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 22, "playtime_last_two_weeks": 22, "last_played": 1551748933}, "language": "english", "review": "I tried to play the game but anytime i joined my game or anybody elses game it put me in a void telling me to place touch stone but its hard to place something when im in a void. l0l. i tried to uninstall but still game be big potato. gg 11/10 gameplay", "timestamp_created": 1551749053, "timestamp_updated": 1551749053, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.541029214859008789", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48981335": {"recommendationid": "48981335", "author": {"steamid": "76561198446611563", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 1293, "playtime_last_two_weeks": 0, "last_played": 1550219693}, "language": "english", "review": "this is good its like minecraft but better XP just needs a little bit updating about the fps when ur playing it cause i play it in the fastest one and it still run like dog shit but i still like it i give it 11/10", "timestamp_created": 1550122279, "timestamp_updated": 1550122279, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49163463": {"recommendationid": "49163463", "author": {"steamid": "76561198182236699", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 15, "playtime_last_two_weeks": 15, "last_played": 1550874951}, "language": "english", "review": "Honestly it laggs out so badly that I can't even switch menu. literally running well above their parameters and unable to get the game to cease lag freeze. and it CAN'T be my connection. I'm hardwired to a modem via ether net at 150 mbps.  All that work on what i thought would be a decent sandbox and it lagged out so badly i couldn't even really give it a try.  As someone that is studying game design and knows how to build a server...you guys should have invwested more in server size and traffic bandwidth.", "timestamp_created": 1550875238, "timestamp_updated": 1550875238, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thanks for the feedback.  It's not a server-side or bandwidth issues at present.  We have some fixes we are putting in that should help in the next little bit.  In the meantime, you should NOT be experiencing the type of performance issues you are stating.  Please send us an email at support@playfulcorp.com.  Please include your machine specs, especially OS, Graphics card, and Ram.  There is also an 'Advanced logging\" option that, if you can run that in the areas where you are seeing the perf issues, it will give us more specific information.  If its something we can fix right away, we will and get a hotfix out."}, "49254909": {"recommendationid": "49254909", "author": {"steamid": "76561197976228399", "num_games_owned": 387, "num_reviews": 66, "playtime_forever": 755, "playtime_last_two_weeks": 0, "last_played": 1540003000}, "language": "english", "review": "Love the building aspect more than Minecraft, but after the tad bit of survival there's just nothing there... Would be great to introduce a story or something to work torward like an end boss or something.", "timestamp_created": 1551230055, "timestamp_updated": 1551230055, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508928596973419189", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48980125": {"recommendationid": "48980125", "author": {"steamid": "76561198444227638", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 2648, "playtime_last_two_weeks": 0, "last_played": 1550193720}, "language": "english", "review": "pretty good game", "timestamp_created": 1550115175, "timestamp_updated": 1550115175, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48994901": {"recommendationid": "48994901", "author": {"steamid": "76561198412095288", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 8970, "playtime_last_two_weeks": 823, "last_played": 1551836003}, "language": "english", "review": "this game is really good if you like future tech stuff or like being creative and doing whatever you want i really recommend this game for people like that", "timestamp_created": 1550180313, "timestamp_updated": 1550180313, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49304468": {"recommendationid": "49304468", "author": {"steamid": "76561197979155169", "num_games_owned": 86, "num_reviews": 3, "playtime_forever": 2596, "playtime_last_two_weeks": 2596, "last_played": 1551807151}, "language": "english", "review": "Wow! I am absolutely loving this game. I was always interested in minecraft but was put off by the graphics and what seems like a steep learning curve. Here, in creativerse, everything looks and sounds great and you are helped on your way to limitless creation. My only problem with it is that I didn't start laying when it came out. Explore, build, mine, smack monsters, tame them, farm them, farm plants, fly etc. etc. What do you want to do? It just gets better. Best game i've played in years and recommended to all ages. I hope to see more improvements for the game to last a lifetime.", "timestamp_created": 1551484536, "timestamp_updated": 1551484536, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48939026": {"recommendationid": "48939026", "author": {"steamid": "76561198069139920", "num_games_owned": 115, "num_reviews": 21, "playtime_forever": 5218, "playtime_last_two_weeks": 1, "last_played": 1550910561}, "language": "english", "review": "Similar to minecraft as its a sandbox survival game but has its own view style, mechanics and a tutorial like guild that you can follow if you want\nMaking a server/map is easy and can be limited to who is able to play in\n\nOnly problem is there is only limit ways to get in game currency, which allows you to have cosmetics and more stuff to craft\n\nFor a free game, you can try yourself if its for you", "timestamp_created": 1549936365, "timestamp_updated": 1549936365, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49235804": {"recommendationid": "49235804", "author": {"steamid": "76561198814922692", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 471, "playtime_last_two_weeks": 45, "last_played": 1551132280}, "language": "english", "review": "it is the best game sick as heck plz make updates\n", "timestamp_created": 1551126844, "timestamp_updated": 1551126844, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48798249": {"recommendationid": "48798249", "author": {"steamid": "76561198281495155", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 24989, "playtime_last_two_weeks": 1134, "last_played": 1551871281}, "language": "english", "review": "What can i say. This game stomps MINECRAFT in all aspects. It is a clone i see alot of the MINECRAFT program in this game but it seperates itself in options upgrades adventure and well look. I highly recommend this game for creative Gamer's.", "timestamp_created": 1549457747, "timestamp_updated": 1549457747, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49328419": {"recommendationid": "49328419", "author": {"steamid": "76561198313173443", "num_games_owned": 11, "num_reviews": 5, "playtime_forever": 4268, "playtime_last_two_weeks": 0, "last_played": 1549156245}, "language": "english", "review": "Wish it was offline\n", "timestamp_created": 1551586836, "timestamp_updated": 1551586836, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49323628": {"recommendationid": "49323628", "author": {"steamid": "76561198181819661", "num_games_owned": 83, "num_reviews": 21, "playtime_forever": 272, "playtime_last_two_weeks": 55, "last_played": 1551557726}, "language": "english", "review": "4 years, nothing changed, only the prices changed rofl. Was better in alpha, good idea, bad development.", "timestamp_created": 1551563322, "timestamp_updated": 1551563322, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518950462341308594", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Hi there!  Thanks for the feedback.  Actually, prices of Pro have never changed, but we have release a lot of new content.  In regard to releases, We have actually made a numerous amount of changes over the past few years (We are up to Release #60).  We fully know that we have a lot to do and a  long way to go  We hope that you will give us another chance soon as we release more performance and content/feature updates soon.  Thank you so much!"}, "49144974": {"recommendationid": "49144974", "author": {"steamid": "76561198073221420", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 27, "playtime_last_two_weeks": 27, "last_played": 1550787331}, "language": "english", "review": "this game is literally unplayable", "timestamp_created": 1550784943, "timestamp_updated": 1550784943, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thanks for the feedback.  we are working on performance issues currently, but if you are not able to get into the worlds at all, please send a note to support@playfulcorp.com with your OS and Video card information, along with any error messages you may be receiving and we will correct any issues tight away!"}, "48804843": {"recommendationid": "48804843", "author": {"steamid": "76561198040070937", "num_games_owned": 211, "num_reviews": 5, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1549409279}, "language": "english", "review": "Bad optimization, lags, bad combat system, bad lighting.", "timestamp_created": 1549476255, "timestamp_updated": 1549476255, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thanks for taking the time to give the feedback.  We are aware of the performance issues and that is our number 1 priority.  We have had a couple weekly updates since the review to try and fix some of these, and will continue to work on these and get out fixes as soon as possible.  We have done 3 in the last 3 weeks alone.  I hope that you give us another chance soon to earn your praise."}, "49040468": {"recommendationid": "49040468", "author": {"steamid": "76561198092575640", "num_games_owned": 51, "num_reviews": 10, "playtime_forever": 2405, "playtime_last_two_weeks": 0, "last_played": 1549813079}, "language": "english", "review": "A unique and fun game, a bit lackluster in the moment but it's still under development, but they have been doing quite a decent job on implementing features. I do hope they add more mechanics (mainly survival) such as hunger and maybe thirst, and just make it more challenging in general. Even in the hardest game possible I find it terribly easy, especially without the need to worry about hunger or getting killed by a mob since they are way too slow and don't have any special mechanics to make them more challenging. \n\nPros:\nOffers a unique style of gameplay compared to other survival games\nDecent graphics\nEasy to learn and adapt\nIt's free\nA friendly community and environment\nDoesn't take up much space\nDeveloppers are nice and professional\n\n\nCons:\nQuite lackluster in features and mechanics, which can lead to boredom\nLack of difficulty\nLike mentioned, it can be quite boring\nYou cannot really play this game offline, or it might just be me\nUpdates aren't really frequent, and alot of them aren't really game changing\nNo mods\nThere are performance issues from time to time\n\nThis is overall a good game, but it would be great if there would be more features and mechanics, I can only dream of a modding community to satisty me or for there to be a big update giving tons of new features and mechanics.\n", "timestamp_created": 1550356903, "timestamp_updated": 1550356903, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.556198596954345703", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48953040": {"recommendationid": "48953040", "author": {"steamid": "76561197970876110", "num_games_owned": 66, "num_reviews": 14, "playtime_forever": 499, "playtime_last_two_weeks": 0, "last_played": 1550009493}, "language": "english", "review": "i like this game better then minecraft just need more players", "timestamp_created": 1549993266, "timestamp_updated": 1549993266, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.481751799583435059", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49055661": {"recommendationid": "49055661", "author": {"steamid": "76561198258300439", "num_games_owned": 13, "num_reviews": 5, "playtime_forever": 1229, "playtime_last_two_weeks": 25, "last_played": 1551115409}, "language": "english", "review": "The game It self is nice but some times it gets laggy and anoying.\nI recommend this game! It's pretty good! (but only for some hours :P)\n7.5/10\n", "timestamp_created": 1550418920, "timestamp_updated": 1550418920, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513064146041870117", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49040269": {"recommendationid": "49040269", "author": {"steamid": "76561198149806057", "num_games_owned": 101, "num_reviews": 7, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1497507894}, "language": "english", "review": "its like minecraft if it was owned by EA", "timestamp_created": 1550356008, "timestamp_updated": 1550356008, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519373476505279541", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48869663": {"recommendationid": "48869663", "author": {"steamid": "76561198186883581", "num_games_owned": 69, "num_reviews": 1, "playtime_forever": 1471, "playtime_last_two_weeks": 0, "last_played": 1537572651}, "language": "english", "review": "Honestly really fun", "timestamp_created": 1549712686, "timestamp_updated": 1549712686, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.498113185167312622", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49037008": {"recommendationid": "49037008", "author": {"steamid": "76561198126379196", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1501353815}, "language": "english", "review": "Is this minecraft", "timestamp_created": 1550344731, "timestamp_updated": 1550344731, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.511536359786987305", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48855124": {"recommendationid": "48855124", "author": {"steamid": "76561198242235438", "num_games_owned": 9, "num_reviews": 10, "playtime_forever": 1442, "playtime_last_two_weeks": 0, "last_played": 1549659774}, "language": "english", "review": "Relies too much against its expancion pack. Money hungry developers.", "timestamp_created": 1549657822, "timestamp_updated": 1549657822, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.492307722568511963", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48914220": {"recommendationid": "48914220", "author": {"steamid": "76561198855292377", "num_games_owned": 26, "num_reviews": 4, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1549841911}, "language": "english", "review": "Laggy and bad gameplay.", "timestamp_created": 1549841930, "timestamp_updated": 1549841930, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thanks for the feedback.  We have and will be doing nothing but performance optimizations.  Hopefully you can give us another try soon.  Thank you!"}, "49079021": {"recommendationid": "49079021", "author": {"steamid": "76561198045764381", "num_games_owned": 54, "num_reviews": 6, "playtime_forever": 402, "playtime_last_two_weeks": 0, "last_played": 1550539333}, "language": "english", "review": "Can't see your own armor progression. That automatically moves the game from what felt like a 7/10 to 2/10. Can't recommend asain esc money grubby crap like this. Here's hoping that hytale kills all!\nAlso just killed all content from start to finish in 6.7 hours.", "timestamp_created": 1550520266, "timestamp_updated": 1550550515, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.419847309589385986", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49131218": {"recommendationid": "49131218", "author": {"steamid": "76561198027339565", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 106422, "playtime_last_two_weeks": 3, "last_played": 1550714495}, "language": "english", "review": "An entertaining game I spent nearly 2000 hours on, and a lot of money. Recent updates have made the game unplayable on Mac. Apple system requirements are no longer on the store page, despite Steam marketing this as an Apple compatible game. If you buy this without considering these facts, you are more a fool than I.\n\nCreativerse is another example of cowboy developers who have a great product, but don't give a wet fart about users who have paid for the game. Steam's complete inability to deliver value for money for the Mac community doesn't help. Avoid this game if you run Steam on Mac - it will only lead to tears.", "timestamp_created": 1550721307, "timestamp_updated": 1550721307, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.473509907722473145", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thanks for the post.  I responded to your forum post as well.  We are fully compatible with Mac.  Please send a note to support@playfulcorp.com with the requested information so we can troubleshoot any issues you may be having.  Thank you!"}, "48999839": {"recommendationid": "48999839", "author": {"steamid": "76561198405079606", "num_games_owned": 23, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1536224530}, "language": "english", "review": "this one didnt work.  mostly because it glitched my MacOSX.", "timestamp_created": 1550205559, "timestamp_updated": 1550205559, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504587173461914063", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Hi there! It should work fine on your Mac.   Please send a note to support@playfulcorp.com and we will address your issues to get you into creating!"}, "48960017": {"recommendationid": "48960017", "author": {"steamid": "76561198316051883", "num_games_owned": 92, "num_reviews": 16, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1548472391}, "language": "english", "review": "Uh where do i start. \nPros- it’s free\nCons\nIt looks weird and doesn’t know what it wants to be\nJust play Minecraft, don’t even torture yourself with this. I’m not even finishing the review and I’m only reviewing it because I’m that bored", "timestamp_created": 1550022703, "timestamp_updated": 1550022703, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49061187": {"recommendationid": "49061187", "author": {"steamid": "76561198285990134", "num_games_owned": 67, "num_reviews": 6, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1513460459}, "language": "english", "review": "bootleg minecraft", "timestamp_created": 1550438076, "timestamp_updated": 1550438076, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.48245614767074585", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49050629": {"recommendationid": "49050629", "author": {"steamid": "76561198150362571", "num_games_owned": 17, "num_reviews": 7, "playtime_forever": 4608, "playtime_last_two_weeks": 0, "last_played": 1548707786}, "language": "english", "review": "good game but PRO version destroying it why playful cant let us free PRO version WHYYYY!!!!!!!!!!", "timestamp_created": 1550402654, "timestamp_updated": 1550402654, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.462184876203536987", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49262896": {"recommendationid": "49262896", "author": {"steamid": "76561198851003107", "num_games_owned": 11, "num_reviews": 4, "playtime_forever": 736, "playtime_last_two_weeks": 11, "last_played": 1551277141}, "language": "english", "review": "eat dick developers", "timestamp_created": 1551276016, "timestamp_updated": 1551276016, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.483050823211669922", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31680339": {"recommendationid": "31680339", "author": {"steamid": "76561197973339349", "num_games_owned": 262, "num_reviews": 3, "playtime_forever": 124184, "playtime_last_two_weeks": 18, "last_played": 1550968881}, "language": "english", "review": "Finally decided to write up a review of the game now that I'm starting to play again after months of recovering from an arm injury. Also, now that the developers have decided to take the game out of Early Access, I felt it’s about time I do a review of a game I've put over a year of playtime into.\n\nFor those who who think my playtime is fake,  I started playing the game after it went free to play (update 25) in November 2015.\n\n\n[b]The Good:[/b]\n\n1. The Developers. I've been playing and beta testing games since the dawn of time of computers (remember having to type in your games and not even being able to save to a tape drive?). Even after all that time, I have found that the developers are some of the best I've ever dealt with. They listen to the community and do care about their game and the people playing it. It’s rare to have a developer, even in alpha tests, ask people directly what their problems and concerns are, and you see results within a few weeks, if not immediately. The developers (and the community I play with) keep me coming back for more.\n\n2. Even after all the updates, and the game going free to play; the game has not become pay to win (no matter what other people may think on this). There is no win or lose, except for how you the player view your goals. None of the paid content is required to play. Pro will give you nice, but not needed options, for your world and your character in game. You explore, collect, craft, build, publish adventures and meet people. Unless you want to duel someone in PvP, there isn't a “you win” for the game. People have 1000+ hours on worlds, and are still building away.\n\n3. Most items can be obtained by playing the game. Blueprints are made with in game items, and usually require no premium blocks. And if they ever do require a premium block, those blocks are easily replaced with any non-premium ones.\n\n4. Updates, lots of updates. They are always adding more to the game. As I said before, the developers listen to the players, and many of the things added to the game is what we, the players, have asked for them to add in.\n\n5. Limited to your imagination, but you can always use a blueprint if you can't get inspired. ;)\n\n6. Hundreds of worlds you can play (yes, even if you aren't a Pro account). There are worlds that have been set up for PvP, PVE, RP, etc, etc. Go into the forums on Steam and you can find people asking for players in the Public Worlds section. So, if you want to be social, you have no excuse not to find a place that suits your play-style. There are worlds out there that are kid friendly, and others that are set up for adult players who want time off from the kids and/or work worries.\n\n7. Solo or multiplayer. So again, choose your play-style.\n\n8. The community is very friendly and helpful. This tends to not be the case on many games where the anonymity of the internet seems to make people think that it becomes a right to be a total... um.. . well you get the point.\n\n\n[b]The Not So Good, But Not So Bad:[/b]\n\n1. Even though it’s a necessary evil, the developers need money to keep the game going, and to feed themselves. I will happily show my support of a game that I enjoy by paying a subscription (even a FTP one) or by any micro-transactions that I feel like getting. Some people believe FTP means everything is free, which of course is not true. The developers getting no money equals the game most likely shutting its doors. :(\n\n2. Bugs... okay, what game out there doesn't have them? But this is minor to me with this game, as under the Good stuff, you'll notice that the developers are always fixing every bug they can stomp flat.\n\n3. No running ads across your screen for you to be annoyed with, which you see in many FTP games (as it’s a source of income). No ads that stop your gameplay every xx minutes like some FTP games either. If you don't go Pro, you get a splash screen when logging into the game loading an area after teleporting that mentions going Pro, and an icon in the corner of your screen mentioning Pro. Some people will not like this, but the splash screen is only up during the period that the area is loading [when you can't do anything in game anyways]. \n\n[b]The Bad:[/b]\n\n1. Some people believe that buying things like Pro give you unlimited power in the game, or speed up construction times, etc. Sorry to burst your bubbles, but the game isn't set up to do that. (Not bad in my eyes, but for others who want to pay to win it is).\n\n2. If you are looking for a game with lots of mob killing fun, and difficult bosses to beat, this game may not be for you. They aren't too difficult to kill, especially once you get geared up and figure out the easy ways to kill them.", "timestamp_created": 1494497171, "timestamp_updated": 1511632227, "voted_up": true, "votes_up": 145, "votes_funny": 4, "weighted_vote_score": "0.897382616996765137", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22918445": {"recommendationid": "22918445", "author": {"steamid": "76561197990574383", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 22507, "playtime_last_two_weeks": 0, "last_played": 1541283911}, "language": "english", "review": "This is a fun game. Very similar mechanics to Minecraft but there are more RPG elements which make it enjoyable outside of just mining blocks and building things. \n\nThe crafting system expands as you create new objects and collect new materials.\nThe fighting system is pretty basic, you have a sword (you start out with a stick, however) of various materials which do more damage for each material type. There are health potions which you can make and are very useful because there is no cooldown to use them and they are pretty easy to make. Bombs are also a huge help with combat and if you've killed enough Keepa for gun powder, you should rarely run out. \n\nDeath just means you need to run back to where you were to get what was in your inventory when you died. All equipment and quickbar items remain equipped. Now that they've added a map, its a lot easier to find your way around as well.\n\nThe game looks pretty good, for a block-based world. All npc's have normal looking models, including the player characters. Easy to play with friends and have them join your world too.\n\nI am hoping the dev's continue to work on this game by adding in some boss type monsters or some other kind of challenges and building materials.", "timestamp_created": 1463005767, "timestamp_updated": 1463005767, "voted_up": true, "votes_up": 52, "votes_funny": 4, "weighted_vote_score": "0.834312736988067627", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "31426136": {"recommendationid": "31426136", "author": {"steamid": "76561198047188320", "num_games_owned": 239, "num_reviews": 5, "playtime_forever": 162906, "playtime_last_two_weeks": 337, "last_played": 1551838578}, "language": "english", "review": "So, after nearly 1600 (1593.5 at the time of this review) hours over a bit more than 2 years, I figure I ought to write a review of this game that has sucked up so much of my time and is the foundation of my digital media experience (videos and streams).\n\nThe TL;DR is that it's free to play and if you want to check it out and really see if it's a game you'd enjoy, do it, it's not going to cost you anything but time. I can and do wholeheartedly recommend this game to anyone that may be interested in cube based building exploration sandbox type games. For those who don't TL;DR, read on.\n\nYeah, the immediate knee-jerk reaction is \"Ooooh, Minecraft ripoff!\". If you judge books by their covers, then yes, you are probably correct in the same way that all tissues are a ripoff of Kleenex, all copiers are a ripoff of Xerox, and any FPS game is a ripoff of Wolfenstien 3D. This review is not for the knee-jerk reactionaries out there. This is for those who can look at a game and look at the feedback for a game, and base their reactions and judgements on something more than knee-jerks.\n\nFirst off, the core game is free to play. You can download and play with ALL the core features without having to spend a dime. Now, with that said, the developers are not doing this out of the kindness of their heart, they are in this as a business, and businesses require income. So, with a game that the developer wants everybody to be able to play free, what are the financing options? Well, DLC and/or microtransactions. Creativerse has both. The PRO DLC adds some completely unnecessary but fun expansion to the game. The microtransactions are for some premium block recipes that are completely unnecessary for building, but allow you to add some more variety to your builds. The microtransactions also come in if you want to get building immediately, you can buy a set of blocks and a building plan (a blueprint, in Creativerse terms) to assemble those blocks into something interesting. Howerver, you don't have to spend money for those blueprints, you can craft them out of materials gathered in game and then collect the blocks needed to build them in game. And on the odd blueprints that utilize premium blocks you don't have access to, you can swap in a different block to replace it.\n\nSecondly, the core game is free to play. You can download and play with ALL the core features without having to spend a dime. This means that, before you even have to think about paying for something, you can download and experience all the core features of the game to see if it is really something you want to put time and money into. The survival, the material collecting, the crafting, the building, the combat, the farming, the taming, the machine wiring, the exploration; all of it, free. If that's how you want to play, by all means, play without spending a dime. But if you find yourself enjoying it, consider buying something to support the developers and to encourage further development.\n\nThe community of dedicated players is a friendly and helpful one, in general. Yeah, there are some hot buttons that can be pressed, much as there is with any game with a dedicated fanbase. But overall, if you have a question, there's somebody willing to answer it nicely. If you see some premium blocks that you want to build with, there are people who are willing to craft them for you. Oh, and mulitplayer is easy as sharing your world name and password, so someone can come and assist you on your own world, if you so wish. You don't HAVE to play with other people, but it is a very simple process to do so.\n\nThe environments are elaborate and full of character, both the surface and the subterranean biomes. Yes, the ground is not homogenous. Combat has challenge to it, but not in the simple \"blow for blow, toe to toe\" who can heal fastest sense. You can tame ANY mob in the game and then feed and harvest it for materials. Currently 4 different crops and 7 different liquids that allow you to cook various foods that provide different buffs to you, and provide fodder for your pets. Once your mining equipment gets to a certain level, you start being able to harvest lower tiers of blocks without needing to repair it. The machine system is a wireless logic system that allows anything from simple door openers to complex mini games. And if you get tired of building and exploring in your own world, you can Adventure in other people's builds and stories. In some sense it is a simple game, but there is still much to learn and explore about it if you so choose.", "timestamp_created": 1493417954, "timestamp_updated": 1493417954, "voted_up": true, "votes_up": 68, "votes_funny": 1, "weighted_vote_score": "0.784738481044769287", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21600146": {"recommendationid": "21600146", "author": {"steamid": "76561198009985903", "num_games_owned": 177, "num_reviews": 1, "playtime_forever": 1220, "playtime_last_two_weeks": 0, "last_played": 1455981233}, "language": "english", "review": "[b]TL;DR - You may as well try it.[/b]\n\nAs a minecraft clone, there are a lot of mechanics in this game that will feel familiar to anyone who has played minecraft. Creativerse, however, adds its own spin on the idea. I will be comparing this game to minecraft throughout this review. Lets go through some pros and cons:\n\n[h1] Pros: [/h1]\n\n[list]\n[*] Same feeling of freedom you get from minecraft. Really do whatever you want.\n[*] Animal taming system is a really cool optional part of the game, that has been refined from the model that existed in minecrft.\n[*] biomes look beautiful, considering the limitations of block-based graphics\n[*] Server system is much easier to manage than other games of the genre, with jump-in game worlds with user privilage settings\n[*] Frequent updates are adding content and squeezing out bugs regularly\n[*] Free-to-play model works great (Will explain below)\n[/list]\n\n[h1] Cons: [/h1]\n\n[list]\n[*] Game progression is slower than you'd be used to. It takes longer to get to the better tools than minecraft, and deeper layers are un-minable using older tools. Really don't like this feature.\n[*] Still a bit buggy. Some instances of creatures spawning where they shouldn't and water not acting as it should.\n[*] Too many block types. I will explain this below.\n[*] Some block rarities need to be tweaked.\n[/list]\n\n[h1] Review [/h1]\n\nFor some background, I live in a house with 6 of my friends, guys and girls included. Most of us are heavy gamers, and one or two are more casual. I downloaded this game on a whim and within a day the whole house was playing in my world. They had all built their own little houses and we had started organising larger projects and had delegated tasks to everyone. [b]This. Felt. Great.[/b] It was a really cool experience that I personally never got out of minecraft, even when playing with friends. We all really love the features and look of the game, and the fact that anyone can drop in, work on the castle a bit or collect ore from the mines and drop out whenever they want. If thats the kind of experience you think you'd enjoy then this game will be a fun casual time sink. \n\nNow, the free to play model does have microtransactions. As far as I can tell, you can spend money on blueprints (large outlines of complicated designs that let you know which resources you'll need to build.) and consmetic blocks (recipes that unlock blocks with unique textures). Obviously, all of this content is completely optional and purely cosmetic. This is why I think it is a pro for this game. \n\nBlock types... There are hundreds of them. Trees drop different kinds of wood, stone is only found in the shallowest layer of digging, each digging layer is made up completely of different sets of blocks representing rock types. What's good about this is the cosmetic implications. You can pretty much find a block with the exact texture you want for the walls of your dungeon or treehouse. What's bad about this is your poor poor storage space. It won't take long for you to fill up containers of bedrock, limestone, dirt etc etc and it is often hard to tell the difference at a glance which is which. The majority of these blocks are used is at least one recipe. This makes the crafting system quite complex. If I want to make an iron mining cell for whatever reason, I still have to keep flipping back to the recipe page to check what I need, even though i've crafted dozens of them. \n\nBlock rarity. For the most part, rare blocks are very useful for specific recipes. An I tem called rockster rock is very difficult to find away from a beach, so I'd say its quite rare, but it is only really used in weapon crafting. Obsidion, which is found quite shallow under ground, is also rare. I cannot tell you how many times I found a lump of coal and got excited because I thought it was obsidion. Now, contrary to rockster rock, obsidion is used in a huge amount of essential recipes, including the recipe needed to harvest more obsidion. I spend far too much time just looking for obsision, because it is far too rare for the recipes that use it. Obsidion is just one example, it does happen with other block types, but that might ust paint the picture.\n\nAll in all, creativerse is definitely a fun game, Its free, Its not graphics intensive, It looks great, and its easy to play with your friends. It has its problems, obviously, but they are activley being worked on. Give it a go.", "timestamp_created": 1457002704, "timestamp_updated": 1457002704, "voted_up": true, "votes_up": 121, "votes_funny": 10, "weighted_vote_score": "0.885374367237091064", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23047108": {"recommendationid": "23047108", "author": {"steamid": "76561198198764469", "num_games_owned": 94, "num_reviews": 9, "playtime_forever": 878, "playtime_last_two_weeks": 0, "last_played": 1453417209}, "language": "english", "review": "Personally, I am a competitive gamer. I play games like LOL and CSGO; I come play creativerse whenever I get salty in the matches I play. It helps me relax and just play casually. I recommend it to anyone looking for a game like minecraft but better graphics and more gameplay.", "timestamp_created": 1463532332, "timestamp_updated": 1463532332, "voted_up": true, "votes_up": 62, "votes_funny": 17, "weighted_vote_score": "0.808815836906433105", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "18945111": {"recommendationid": "18945111", "author": {"steamid": "76561198124125155", "num_games_owned": 75, "num_reviews": 5, "playtime_forever": 34842, "playtime_last_two_weeks": 0, "last_played": 1548479136}, "language": "english", "review": "OK I loved Minecraft, It was genius of it's time and really set a standard for Sandbox/Crafting Gaming. That said... Many games have followed trying to pretend it's not Minecraft, but really just a clone. When I first saw Creativerse, I thought Ok it's free for a few days, no harm... Few hours later... \"PURCHASE FOR MYSELF\"\n\nCreativerse, gave me a renewed interest in Sandbox Gaming, I love that it is in Early Access and the devs are actively working on taking the game to further heights. Love the graphics, Love the design, and the gameplay is very smooth. Your ability to create is nearly endless, and it makes you want to Play, Explore, Build, Survive. \n\nI love the way people are banding together, helping each other, building a greater community and relying on each other to grow. In our world: \"The Era RPG Server\" (New Server) we've actually built a thrieving socity based on rules and guidelines, professions, teamwork, trust and communication. We actual have character roles and play out our adventures together.\n\nExploration is very enjoyable, so many different and unique wonders to see, I was exploring and found a spot where 3 biomes met... Beautiful Canyons, Thick Jungle, and Frozen Snow... I was truly amazed at the possiblities of building in places like that.\n\nTheir are ton of mobs, ugly ones, really cute ones, to down right nasty looking mobs... I am excited to see what new functions for pets they will come up with. A few suggestions: \n\nA Pet Whistle to call your pet when they get lost, I like to let mine wander. \nThey should help you in combat, I mean they where kicking your butt while you where taming them what happened to the fight in them,\nA Pet Trough to feed your pets when your away, so when you come back you can gather from them and then give'em a little shower.\n\nCombat is simple Hack and Slash, point and click. For the stage it is, you wont need more than that. However I would like to see implementation of ranged weapons above throwing pinecones, a Bow or Crossbow, maybe the Water Sprayer can deal damage to enemies, implement a flamethower, I KNOW THE ANIMATION IS THERE... Those Firerats will mess you up. Perhaps a Block Button? Just a thought.\n\nHealth should, however slowly, regenerate over time, and recover completely when you sleep. \n\nCharacter Customization is a MUST, even being able to change the simplest details, Skin color(include green), Eye color, Hair color... Hoodie color.... (optional) Ears, Nose, Mouth, Hair style, Shoe color...\n\nA Trade Window, that allows you to trade with anyone in the world. The window pops up, you pick who you are trading to and the item your trading and a request pops up on their screen, they click ok, the trade window opens on their screen.. they add what they are trading, both parties hit confirm... Boom... and they can be anywhere in the world.\n\nThis game can easily set a completely new and different standard for sandbox crafting gaming.\nCreative has the Potintial to Surpass Minecraft in everyway with or without mods.\n\nDEVs PLEASE don't Give up on us! It would be a crime against Gamers... Keep up the Good work and I will play and promote till Creativerse 2!", "timestamp_created": 1446956032, "timestamp_updated": 1449316573, "voted_up": true, "votes_up": 120, "votes_funny": 10, "weighted_vote_score": "0.871796905994415283", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28526834": {"recommendationid": "28526834", "author": {"steamid": "76561198254886741", "num_games_owned": 142, "num_reviews": 7, "playtime_forever": 2249, "playtime_last_two_weeks": 0, "last_played": 1485350155}, "language": "english", "review": "To this Game publishers\n\nI am a Chinese player,  I really like this game.  And I also work in a Chinese subtitle group that we translate the USA TV programs into Chinese. Many Chinese players want Chinese in this game. So if you guys could send us a copy of all the text in this game, we can translate them in Chinese. We can do this for free. \n\n\n致这个游戏的发行商：\n\n我是一名中国玩家，我非常喜欢这个游戏，而且我在一个字幕组中工作。我们翻译美国的电视节目。很多中国玩家想要这个游戏汉化，如果你们可以发送一封游戏中的文字拷贝给我，我们可以帮助你们。我们的工作都是无偿的。", "timestamp_created": 1482408786, "timestamp_updated": 1482408786, "voted_up": true, "votes_up": 73, "votes_funny": 7, "weighted_vote_score": "0.8305472731590271", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24053412": {"recommendationid": "24053412", "author": {"steamid": "76561197965440103", "num_games_owned": 181, "num_reviews": 4, "playtime_forever": 4885, "playtime_last_two_weeks": 0, "last_played": 1549908025}, "language": "english", "review": "Truth - Great game still needs work, Once you learn the ropes you will be gathering resourses fast, Needs more weapons, Needs a better health management system as there is no real points at the moment to growing food. \n\nMost people I see saying Creativerse is a Minecraft rip off well here is the truth below.\n\nAs in so many other fields, innovation in the world of game development doesn't normally entail creating something entirely new and completely unprecedented from scratch. Every developer, to some extent, is building on foundations laid by other developers. Are all 3D FPS's copying \"Doom\" or \"Wolfenstein?\" Are all text adventure games copying \"Zork?\"\n\nNotch and his team at Mojang took a block-based, procedurally-generated style of game created by a developer named Zach Barth, and they used it as the basis for something truly awesome, imbuing it with personality, complexity, appeal, and helping to foster a sense of community around their game. There were other influences, too, like Dwarf Fortress. Minecraft has been overwhelmingly successful; after recently selling to Microsoft, Notch famously just bought the most expensive house on the market in Beverly Hills. Good for him, I say.\n\nMinecraft is not at all the only game to have incorporated Barth's ideas, and look how many Minecraft-type indie games have emerged since Mojang began to enjoy such success. I personally wouldn't call it \"copying,\" and I don't see what's disappointing about it. It's how the gaming industry has always worked, it's how the arts work, and it's going to stay that way.\n\nComplete originality in the arts is mostly a myth. It doesn't happen. We are always the sum of our influences, to which we add some little spark of our own.", "timestamp_created": 1467563114, "timestamp_updated": 1467563114, "voted_up": true, "votes_up": 91, "votes_funny": 3, "weighted_vote_score": "0.840404033660888672", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34397812": {"recommendationid": "34397812", "author": {"steamid": "76561197991209707", "num_games_owned": 145, "num_reviews": 8, "playtime_forever": 7641, "playtime_last_two_weeks": 0, "last_played": 1538076223}, "language": "english", "review": "After reading lots of different \"good, bad n' ugly\" reviews, I've developed a feeling that this is going to be a \"pay to win\" or \"pay to PLAY\" game and decided to test it out on my own perspective. I haven't bought the PRO access option and I must say, in my humble opinion, this game is decent and good without it. I haven't met with \"harsh waiting time\" on gathering resources or processing the materials you gather, I don't get constant pop ups of microtransactions or other kinds of \"pay-wall\" issues. \nThe beauty of this game is in searching, finding, crafting, building. The only time where I feel limited is when I see a block, which I'd love to have as a decoration (which must be bought). But this doesn't limit me, because the variety of blocks and shapes is quite big when you start combining them together.\nIt took me (as a complete newby) around 40~ hours to get the end game content (which is best armour and weapons) and I haven't thought of getting PRO. \nIf I would get PRO maybe my opinion would change, but at the moment, the game is quite polished apart from  a few  bugs. If you really want to understand how it really is at this point, just try it out and see for yourself!\nAnd to all those who think that this game is \"too grindy\" - learn to multitask, not just sit in one place and watch paint dry ;)", "timestamp_created": 1503331078, "timestamp_updated": 1503331078, "voted_up": true, "votes_up": 32, "votes_funny": 4, "weighted_vote_score": "0.786692142486572266", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39788671": {"recommendationid": "39788671", "author": {"steamid": "76561198188925387", "num_games_owned": 104, "num_reviews": 3, "playtime_forever": 22514, "playtime_last_two_weeks": 0, "last_played": 1546624705}, "language": "english", "review": "I'm in love with this game, and honestly completely addicted.\n\nThere's a few things you have to know going in tho: \n- This game doesn't have quests, or any meaningful goal. It's about finding resources and making new items, building more and exploring. \n- It doesn't have a creative mode. You have to find all the resources in order to build. They are looking to create a mode like this though, so I'll try to update the review when they do. It seems to be a bit far off and not prioritized at the moment.\n\nOn the more positive side: \n- It's free. It's no trickery about you getting so and so far and then having to buy the full game. They ask you to buy creativerse pro with few notices here and there, but nothing flashy or annoying. It can be seen as the free version being the full game, and if you want some extra items and advantages, then buy Pro. \n- There are enemies for you to fight, but in general you can build in peace without being bothered, as long as you create a safe, lit room for nightfall. There's more advanced areas you get to when you have better mining tools for example, and that'll give you more challenges if that's what youre looking for. You can adjust how hostile creatures are too, but I haven't really tested that myself. \n- You can make pets, grow crops, cook recipes, build in an endless open world, play easily either with friends, strangers or alone on servers hosted by Creativerse.\n- The worlds/rooms stay when the creator leaves. I'm sharing a room with a friend and it's nice knowing I can go on even if they're not there. Everything anyone does in the world will be saved automatically and instantly. The creator has the power over who has access to do what, so don't worry about strangers coming in and messing up your building (you can also put on passwords if you don't want sight seers either). \n- Co-op and/or PvP is possible\n- You can edit your character, name, server area and world settings whenever you want. All names are available, so the same names can be used by different people (might be a bit confusing, but I like it personally, haven't met anyone with my name either way) \n\nI will say some things are confusing and not informed well, I've spent some time looking things up (like how on earth to get crops to grow properly), but it's easily found online. \n\nAll in all it's an amazing game, and it's free, so if you're curious just check it out. It doesn't take much space at all and it runs fast on smaller computers too. Highly recommended, as long as you know what the game is and what it isn't.\n\n\nEdit: thought I'd add that there's an adventure option to the game too, instead of just joining worlds to craft. I haven't tried this option myself though, so I can't really say anything about it yet", "timestamp_created": 1517571814, "timestamp_updated": 1517934969, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.786330580711364746", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20162280": {"recommendationid": "20162280", "author": {"steamid": "76561198141693530", "num_games_owned": 157, "num_reviews": 2, "playtime_forever": 291247, "playtime_last_two_weeks": 0, "last_played": 1550566688}, "language": "english", "review": "Early Access Review\n6 months, 800+ hours game play\n\nYou start out in a wooded forest.  You have this nifty wrist gauntlet that will suck up blocks and put them in your inventory.  Your first order of business is to upgrade that gauntlet with a wood mining cell.  You'll need to check what you need to craft that cell and acquire the ingredients. So the game goes until you're completely outfitted with top tier armor and equipment.  While you do this, you'll explore many different biomes, and levels to get the needed ingredients.  Some people feel this is the end game, but for me the joy of this game has just begun.  Now You can get down to some creative building.  You can do this solo, or find a good server with like minded individuals and build to your hearts content.  \nThere are also different multiplayer servers you can join, or start your own and list it in the Public Worlds forum for others to join.  \nPVE-player vs. environment is the most common. You'll find your peaceful builders here. \nPVP-player vs. player.  The people who like to steal, loot, blow up stuff, and hunt you can be found here.\nRPG- Role playing servers.  These are very interesting and can be lots of fun.\n\nPros:\nGame updated every 2-3 weeks with bug fixes, and new content.\nProgressive equipment leveling up\nEnvironment exploration\nResource hoarding\nCrafting\nBuilding\nFarming\nTaming mobs for pets you can then feed and harvest from\nSolo or Multiplayer\nWonderful Graphics\nInteresting Mobs\nInteractive Development Team\nFriendly and helpful community forum\n\nCons:\nAll the cons I could talk about are being addressed by the dev team, and could very well be fixed by the time you read this review.\n\nNote on FTP and in-game store.:\nThe devs have decided that only cosmetic additions to the game will be sold in the store.  There will not be anything that is required in the game to level up, or advance in the store.  This means you can have the full Creativerse experience without having to buy a single thing.  On top of that, the game just went free to play just over a month ago, and the devs have already given out 450 free coins for the Winter holiday update.\n\n\nConclusion:\nIf you want a difficult, mob killing game this won't satisfy. If you love sandbox games and building games this just may be your next great obsession.  The mobs aren't too difficult to beat, so it's great for kids, and casual game play.", "timestamp_created": 1451601067, "timestamp_updated": 1452488421, "voted_up": true, "votes_up": 90, "votes_funny": 13, "weighted_vote_score": "0.839575409889221191", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32404928": {"recommendationid": "32404928", "author": {"steamid": "76561198058051839", "num_games_owned": 46, "num_reviews": 29, "playtime_forever": 4535, "playtime_last_two_weeks": 39, "last_played": 1551361975}, "language": "english", "review": "This is probably one of my favourite games on Steam right now, I love it. Even as a F2P player, you have pretty much complete freedom to build and the game graphically does such a good job of conveying the atmosphere of specific environments you really feel like part of the world even though everything is obviously made out of cubes, Pets and farming are an awesome addition as well. Very, very immersive.", "timestamp_created": 1497423575, "timestamp_updated": 1497423575, "voted_up": true, "votes_up": 140, "votes_funny": 5, "weighted_vote_score": "0.8184395432472229", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18738209": {"recommendationid": "18738209", "author": {"steamid": "76561198090739704", "num_games_owned": 188, "num_reviews": 16, "playtime_forever": 571, "playtime_last_two_weeks": 0, "last_played": 1462384242}, "language": "english", "review": "OK before i get into this i just wanna say i have played minecraft since the wee baby years of Alpha. Before i downloaded this i knew without a shadow of a doubt i was gonna hate on it an rage about how this is just another rip off of the game the great lord Notch created. I start the game:\n\n1) Graphics are amazing! You will find yourself just walking around starring at the scenery. (willow trees are the best)\n\n2) Jump 2 blocks! Um thank you sir.\n\n3) Loads of blocks! You can't harvest much at the start but once u get the better equipment everything is yours! EVERYTHING. And it is a lot\n\n4) Many mobs. Some will make u run in terror just at the sight. Some just want to be left alone. I killed a baby crab. Felt evil. Was awesome.\n\n5) Combat system flows really well.\n\n6) Character isn't modable but thats ot a big deal. It could happen in future updates.\n\n7) The cave systems and mining capabilities are simply better.\n\n8) I do however wish it wasn't all server based. Local play would be a great improvement.\n\n9) The grinding element can be annoying but once you locate where certain items are found (aka which biome its in) you can link teleporters and quickly get around the world. The vastness of the universe is incredible.\n\nIn short Creativerse minecrafts better than Minecraft minecrafts. The creators are the new god. give up the throne Notch. I will shed some tears but i think I am benching Minecraft for a while.\n\nEdit: I know Notch hasn't had anything to do with Minecraft in a while. I know he sold Mojang to Microsoft for a pretty penny.", "timestamp_created": 1446097143, "timestamp_updated": 1448386413, "voted_up": true, "votes_up": 229, "votes_funny": 92, "weighted_vote_score": "0.856947600841522217", "comment_count": 23, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21806445": {"recommendationid": "21806445", "author": {"steamid": "76561198086297403", "num_games_owned": 137, "num_reviews": 36, "playtime_forever": 261, "playtime_last_two_weeks": 0, "last_played": 1465268051}, "language": "english", "review": "You know how minecraft is ok and there are several clones of it on steam? This is the only game that does it better.\n\nNot everything better, but it certainly looks and plays better.\n\nWhat it does better:\n-Movement\n-Exploration\n-Monster Design and mechanics\n-Lighting\n-Graphics\n-Exploration and world generation\n\nWhat it does worse:\n-Multiplayer\n-Requiring an internet connection\n-Crafting\n-Weaponry\n\nBasically if they fixed the connection issues it would be a lot better.", "timestamp_created": 1457845593, "timestamp_updated": 1457845593, "voted_up": true, "votes_up": 48, "votes_funny": 7, "weighted_vote_score": "0.801672101020812988", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "12133233": {"recommendationid": "12133233", "author": {"steamid": "76561198007529485", "num_games_owned": 233, "num_reviews": 12, "playtime_forever": 1689, "playtime_last_two_weeks": 0, "last_played": 1457317948}, "language": "english", "review": "As of this moment I see the potential to be the evolution of minecraft. I mean this game could be fun and fantastic co op. They had to be greedy and ruin it with a cash shop though. You literally have to wait on extractors and things to mine and build 5 minutes and up. You can of course rush things with their in game mojo points. When you run out though, despite paying 20 bucks for the game. It's either pay to mine or wait forever. Oh well, was fun while the stuff lasted onward to better games.", "timestamp_created": 1410990850, "timestamp_updated": 1410990850, "voted_up": false, "votes_up": 1331, "votes_funny": 27, "weighted_vote_score": "0.880167186260223389", "comment_count": 49, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32230075": {"recommendationid": "32230075", "author": {"steamid": "76561198065540876", "num_games_owned": 43, "num_reviews": 7, "playtime_forever": 29491, "playtime_last_two_weeks": 0, "last_played": 1535000525}, "language": "english", "review": "If you like Minecraft and know how that game works, then you probably have a good idea of how this game plays out:\n\n-Collect materials\n-Build shelter\n-Craft high end gear\n-Explore this game's equivalant of the Nether and End\n-Maybe build a giant middle finger out of spare sand blocks (and have it get marked as incompatible on the workshop because big 'ol meanies)\n\nExcept that's just it. Your objective isn't to reach the End and defeat the Ender Dragon. Your objective is to do what you yourself want to do. You make the world what you want it to be. Make a giant wood mansion or even go extreme and make a survival entirely based in the lowest layer of the Earth. It's all up to you. But how far you want to go to do those things is based on how long you can make your gauntlet last. Once it's out of power, you're defaulted to lowest tier one until you craft another. And quite frankly, depending on what you mine with it, it can last a week (real time) or an hour.\n\nAlso the fact that every enemy will attack you on sight is a bit ridiculous, even pigs. I can see some of the others, like Mirus and Rocksters, but pigs should not attack you just for walking past them. You can enable \"Peaceful Creatures\" if you own the world, but otherwise it's either you or the creature.\n\nAnd once you get to the bottom layers, suped up versions of enemies appear down there, and they're EVERYWHERE. Combine this with everything attacking you and I'll just say good luck mining a lot of Lumite. It wouldn't be too bad of a problem if they couldn't hit you from (up to) 7 blocks away with melee attacks. I dear hope that is addressed.\n\nThe crafting can be tedious since you need to craft certain things to even know the requirements for others, but once you get them it's smooth sailing. (Compared to Minecraft where if you find diamonds early on, boom. Diamond tools) And a pro compared to Minecraft is that you can rotate blocks after you've placed them and lock that roatation so every addtitional block in that same hotbar slot will be placed in the same way. As well as the equivalant to Redstone, these pieces of ARC technology operate wirelessly, something I wish Minecraft had.\n\nI do wish that the \"Creativerse Pro\" DLC was priced lower, as paying $20 for a flashlight, extra invetory slots and a glider is not worth that much money. Perhaps $10 is more worth it. But after awhile you'll wonder how you played without it, since the bottom layers are super dark and there's health sapping water all over the place down there.\n\nSo, can it be challenging? Yes. Is the world infinite? No, but 10240 X 256 X 10240 is considerably big and there's plenty to see and do. Is it better than Minecraft? In some areas but not all. If you're looking for a steady frame rate game then this isn't it. It feels like it hasn't been optimized at all. Is it fun to play? Definitely.\n\nWould I recommend this? Absolutely. Best of all, it's free to play.", "timestamp_created": 1496795617, "timestamp_updated": 1518125298, "voted_up": true, "votes_up": 31, "votes_funny": 10, "weighted_vote_score": "0.757062137126922607", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38357124": {"recommendationid": "38357124", "author": {"steamid": "76561198019536954", "num_games_owned": 104, "num_reviews": 17, "playtime_forever": 58886, "playtime_last_two_weeks": 0, "last_played": 1535252308}, "language": "english", "review": "The game was good at the beginning. But now there is no new content. All new blocks are paid dlcs. The PRO DLC do not offer a good content. The Halloween season content was good, but the Christmas season content is clearly made to sell \"loot boxes\". \nThe game would be better if they put more blocks types (more wood floor colors, bricks and other) and they focused on made a better PRO content and sell IT, not sell Dumb's Coins.\nPlayful is getting too much like EA.", "timestamp_created": 1513449299, "timestamp_updated": 1513449299, "voted_up": false, "votes_up": 159, "votes_funny": 9, "weighted_vote_score": "0.850417971611022949", "comment_count": 9, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33923484": {"recommendationid": "33923484", "author": {"steamid": "76561198036764944", "num_games_owned": 28, "num_reviews": 5, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1501550027}, "language": "english", "review": "Game is decent. Having to purchase Pro is a bit of a pain, especially since most of the games best items and tools are locked behind this paywall, however, I understand the creator's need to make money off of a game that IS, admittedly, Free to Play. After one hour, I had claimed a plot of land, built myself up to mid-teir mining tools and weapons, setup a home base within a cave, and began a full crafting setup to continue to build up my equipment. A few things about the game to know before you delve into it for yourself:\nYes, its basically a Minecraft clone, however, it is MUCH better than ANY other MC Clone on the F2P AND P2P markets. The dev's take on the Minecraft formula is interesting, and fun to play. My only qualm is that it is WAY more complicated than MC, the crafting recipe's require more resources, both in quantity and variety, and resources for crafting take a lot more effort, exploration, and critical thinking, to acquire. \nThe combat is interesting as well. Certainly more enjoyable than MC's, to me at least, and my favorite part about the combat is the increase in difficulty over MC. In Creativerse, building a home isnt as easy, and you likely wont have one constructed before the first night rolls around. Hence why I setup my homebase in a cave. I recommend using the free 300 coins given to purchase the 100coin Explosives pack (to ease combat), and the 100coin lighting pack (to stop enemy creature spawns). Creatures spawn more often, and due to their method of spawning and the random nature of it, enemies CAN and WILL catch you by surprise. This was fun to me, but may not be to others.\nThe crafting system IS well designed, and intuitive, but nowhere near as \"streamlined\" as MC. You wont be stuck having to lookup recipe's, or using the \"shape-building\" system of MC, as CV tells you exactly what you need and how many of them are required to craft specific items. Again, however, it takes much more effort to get your hands on what you'll need, so be aware of that. It could be more well designed, the menu's can be a bit of a pain to move between, as least for new players, but the overall learning curve is a bit lower than MC's, at least in most aspects. \nCreatures are entertaining, and the fact that their loot drops in bags which can be searched, rather than items you auto-pickup, is welcomed greatly over the traditional MC system of loot drops. \nCombat is also fun, and weapons look pretty cool, in my opinion. Enemies have health bars, and nothing is TOO difficult to take down, but combat CAN be more difficult than MC's at times, again, especially for new players. \nExploration is fun, and the world is pretty and relatively well-built, and top of the line among MC clones. \nLastly, as I said before about coins and packs, you can purchase certain utility items such as lighting, explosives, and materials (such as doors, walls, and decor, NOT crafting materials, not that I saw anyway), and this system is welcomed to some degree. It's a bit cheap, as it encourages Micro-Transactions to ease the beginner's learning curve, and difficulty, but it's done fairly well, and since it does not include weapons/tools/crafting materials, which would essentially be \"pay to win\", as much as it could be in a MC style game, I suppose I can look past the whole \"using real world money to buy in game currency to purchase item bundles\" system. Also, while Pro does increase inventory space, and unlock most of the better items, the space and items available within the Free version are acceptable, and overall, you CAN enjoy this game without ever spending a dime on it. So, not so bad. \n\nOverall Conclusion: Creativerse is a fun, entertaining, and interesting take on the Minecraft formula. While it IS, for better or worse, a clone of MC, it is by far the best one available, and being F2P is a huge plus, even if most of the better items are locked behind a paywall. The variety of items and combinations proves fun and encourages creativity, and as such, offers comparable levels of replayability and time spent in-game to Minecraft. Overall, if you're looking for a Minecraft-style game that can be played for free, or just bored of MC and want a clone of it, or similar game, thats actually GOOD? Then I 100% recommend Creativerse as an alternative. \nMy personal rating? 7.5/10. Gameplay is fun, variety is acceptable, but the learning curve, while easier than MC's, can prove cumbersome, same with the acquiring of crafting materials, and I will almost ALWAYS lower the score when you hav a F2P game with paywalls and in-game currency/Micro-transactions, but perhaps this is mostly just my own personal bias, having been burnt out on Micro-purchases due to their overabundance in gaming, ESPECIALLY on console. \nDefinitely give it a try.", "timestamp_created": 1501491941, "timestamp_updated": 1501491941, "voted_up": true, "votes_up": 46, "votes_funny": 4, "weighted_vote_score": "0.792800843715667725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32400296": {"recommendationid": "32400296", "author": {"steamid": "76561198111671519", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 3273, "playtime_last_two_weeks": 0, "last_played": 1528320272}, "language": "english", "review": "Let me start off by saying that when I first installed Creativerse, I had no idea what to do. So I quit for around a year. Then recently, my friend tells me to try this game, and it just happens to be Creativerse. Yeah, I give it a try because maybe it would make more sense.\nAnd yes, when you begin, most likely you'll be confused. Or bored. I'd say that this game has a lot of good content, but right off the bat, spawning in a boring-looking grassland or woodland doesn't seem so encouraging.\nAnd if you give it some time, you'll find that it's actually quite engaging. The treacherous caves with monsters and pitch-darkness, the high mountains covered in snow, the different layers of Earth. The monsters are scary-looking and have dangerous special abilities. The Earth's deepest layer is dark, empty and corrupt.\nOverall, I'd say this game is amazing. It's free to play, which is awesome. The graphics are simplistic, but just so that they aren't too busy. The creators actually spent time on the 3D rendered carpets and doors and windows. The mobs really freak me out, so I give it a thumbs up! They don't have much variation, but I'd like to say that that is fine by me. The loot bags and chests are insanely detailed. The loot bags even have physics! How about that.\nAnd unlike Minecraft, this game has recipes that you must unlock by venturing throughout the world, and a simple crafting system that is totally cool. Also unlike minecraft, the weapons and other items have more difference than just a color-overhaul. Blocks are detailed and there are so many ways to customize! There's even furniture!\nNow, there are some things I'd change. First of all, the premium recipes. Yes, yes, we all know that the game needs to make money somehow, but recipes? Would it hurt to let people decorate without spending money on a virtual game? Also, there is a shortage of content. Once you reach the Corruption layer of Earth, there's nothing else. I'd like to see more layers. Maybe a weird, misty, glowy layer of Earth with monsters made of light. That would be cool.\nAnd finally, there should be bows as another weapon. It might add more interest, or maybe it'd make the game too easy. That's up to the creators to decide.\n\nOtherwise, I honestly don't think there's anything I don't like about the content in the game already.\n\nI 100% recommend this game. You'll find it more fun than you'd expect, and that's coming from a really picky somebody.\n", "timestamp_created": 1497397858, "timestamp_updated": 1497397858, "voted_up": true, "votes_up": 72, "votes_funny": 2, "weighted_vote_score": "0.781287133693695068", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39468935": {"recommendationid": "39468935", "author": {"steamid": "76561198353187241", "num_games_owned": 12, "num_reviews": 5, "playtime_forever": 6336, "playtime_last_two_weeks": 1, "last_played": 1551401477}, "language": "english", "review": "At first I was pessimistic about this game assuming it was merely a Minecraft clone.  After many hours of playtime, I can firmly say this is a great game that is super fun to play.  It is in many ways everything that I wish Minecraft had.  Better blocks, better graphics and far better building components.  That being said it needs more content and a creative mode in order to really take off.  This game is perfect for building and no one drives traffic to games more than Youtube.  With so many outstanding Youtube builders, I believe lots of them would jump at a chance to quickly build structures in this game.  It never hurts to have thousands of people watch someone build on your game.  Just a thought.  The devs seem very responsive and updates are frequent.  Overall a fun game to play and worth the Pro.  I look forward to what the future holds for Creativerse.", "timestamp_created": 1516400760, "timestamp_updated": 1516400760, "voted_up": true, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.768846035003662109", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19282846": {"recommendationid": "19282846", "author": {"steamid": "76561197960364629", "num_games_owned": 3226, "num_reviews": 225, "playtime_forever": 880, "playtime_last_two_weeks": 0, "last_played": 1449711644}, "language": "english", "review": "[h1][b]Yes Another Minecraft Clone... BUT A DAM GOOD ONE!! [/b][/h1]\n\nYeah its another Minecraft clone that has gone Free 2 Play, but this one is real good !! The games engine is real good and runs real smoothe with no issues and looks pretty darn good.The crafting is just like Minecraft so if you have played that you will be very familiar with this ones crafting system.\n\nThe crafting works by making stuff and you get plans to make new stuff as you go and i think i read you can also find plans for stuff in the world (kinda like drops off mobs and chest around the land) or you can Buy them later i think. They have good aray of baddies to fight and farm for mats and stuff and makes it more neat to explore.\n\nI say being its F2P give it a shot and try it out and see if you like it :) its got my VOTE !!", "timestamp_created": 1448532476, "timestamp_updated": 1448670175, "voted_up": true, "votes_up": 109, "votes_funny": 23, "weighted_vote_score": "0.814789652824401855", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23290466": {"recommendationid": "23290466", "author": {"steamid": "76561198035285721", "num_games_owned": 4471, "num_reviews": 669, "playtime_forever": 12245, "playtime_last_two_weeks": 0, "last_played": 1493073074}, "language": "english", "review": "[h1]\"A Voxel World full of cute piglets and chameleons\"[/h1]\nAn immersive sandbox & crafting game which is just amazing. Honestly I knew it longer but didn't want to spend 10 EUR for it. Now it's F2P and offers the whole content and even some free blueprints. All MTs can also be made with resources payment (zone claims, blueprint buys). Ofc comparsions to Minecraft can be made. But this game has primarly a focus on HiRes graphics and liquid animations of many different kind of specimen (overly cute comic style!). You'll be sucked in easily into this cycle of crafting & building, farming  crops, taming specimen and gathering minerals. The receipts are not too unfair. So you mustn't grind long for resources (except Iron ore seems pretty rare).\n\nLittle complaints about the graphics performance: sometimes you see through unrendered blocks down to lavaworld. Also the game seems to run in some Flash webbrowser mode. On my highend gaming laptop it has the same performance than on my old office notebook. And the RAM memory usage is constantly 1.5 gigs.\nAlso the melee fights (only swords as weapons) are pretty unsharp. Enemies hit you from far distance and even through cavewalls. Another thing is travelling the whole map shows you always the same bioms over and over again.\n\nBut after you crafted yourself up to the highest gear the game has still some more to offer. The building ideas are limitless. The first 100 hours went away very fastly. Still have something to build even after gathering Lumite from the Corruption ...", "timestamp_created": 1464614444, "timestamp_updated": 1464615110, "voted_up": true, "votes_up": 33, "votes_funny": 6, "weighted_vote_score": "0.740284979343414307", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "29149116": {"recommendationid": "29149116", "author": {"steamid": "76561198101116556", "num_games_owned": 57, "num_reviews": 2, "playtime_forever": 53369, "playtime_last_two_weeks": 0, "last_played": 1534263577}, "language": "english", "review": "One of the best building games I've ever played + the Community is really nice and very helpful. Always a public server to join. There is so many people you can make friends with and get to build with. I recommeding this game to anyone that wants to make new friends and have a good time all the time.", "timestamp_created": 1483994739, "timestamp_updated": 1483994739, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.688545942306518555", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "44526008": {"recommendationid": "44526008", "author": {"steamid": "76561197975903337", "num_games_owned": 564, "num_reviews": 39, "playtime_forever": 525, "playtime_last_two_weeks": 0, "last_played": 1536175887}, "language": "english", "review": "You might as well go check it out yourself since it's free to play, but I will lay out why I wouldn't recommend it. \n\nFirst, it's because of technical issues. The game seems to become more laggy over time. This is my system:\n\n16 gb RAM\n1080 GPU\ni7-6700k processor\nU.2 SSD (intel 750)\n\nThat the game lags with this rig is completely unacceptable when it's essentially just minecraft as far as fidelty goes.\n\nSecondly, the freemium style comes through. You can play it without paying anything, but it does lock exclusive things behind pay wall (such as a glider or increased inventory space). If there was a \"this one payment and you'll unlock everything forever\" option, priced at something, like, say, Minecraft, I'd say fair. But as it is right now you'll never know how many more exclusive gameplay-affecting items it'll lock behind a payment.\n\nThirdly, gameplaywise. To mine ores you have to place a consumable extractor on the ore. This can take several minutes to complete depending on the ore and the quality of the extractor. Imagine playing Minecraft, but every ore you mine you have to spend minutes to finish it, in addition to using resources to craft the extractor for every single piece of ore. As you would expect.. they sell the best extractor in the store. \n\nLastly, I find the whole business model highly scummy. You buy ingame \"coins\" (premium currency) which you can then trade for services. They write on the wiki (which I assume is based on statement(s) from the dev): \"However, to prevent players from spending lots of small amounts of money and in time invest large sums this way without noticing, players cannot pay directly with Steam wallet, but have to buy Coin bundles first that have a fixed price each and aren't misleadingly cheap.\"\nBut it's been studied that offering bundles where you can't buy the exact thing you want for real currency actually makes it harder for the customer to judge how much money they're spending and obfuscates prices. In addition, selling coins in bundles instead of letting you buy an exact amount is a way of psychologically making customers buy more. Say you want an item that costs 600 coins, and the lowest bundle you can get is 1000. After the transaction you got 400 left. Oh there's a nice item there that costs 500. But you lack 100... Well you could just get that 500 bundle and buy it. It's just 100 more right? And then you're left off with 400 over and the cycle continues. \n\nAs a developer myself I find this whole thing highly scummy.", "timestamp_created": 1535880468, "timestamp_updated": 1535880468, "voted_up": false, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.776109457015991211", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47558747": {"recommendationid": "47558747", "author": {"steamid": "76561197979425402", "num_games_owned": 397, "num_reviews": 5, "playtime_forever": 65389, "playtime_last_two_weeks": 0, "last_played": 1544690237}, "language": "english", "review": "As you can see from my hour count, I love this game. It would seem that Creativerse is an automatic \"recommend\" for me, but it's never that simple. I've been playing Creativerse since fairly early in development. I've seen several rethinking phases in the design and gameplay. I've bought all the store recipes, sometimes to support the development and sometimes because I actually wanted the blocks. I've played it on three separate computers over the past few years, and here's what I've seen.\n\nI love it primarily because it's a low-attention-demand sandbox game for building. It's a good expression for the “Lego, block building” style of game. Out of the box, it looks better and contains a great many quality of life improvements over the obvious games to compare it to, many of which I also play from time to time. If you want the kind of game that allows you to build, craft, and collect in a beautifully rendered world with distinct personality from top to bottom, yes it's a great game. It has a nice progression of accessibility to more difficult areas, and you can end up wealthy enough in game terms to do almost anything you want, yet there is never a point where you have literally everything you need, and the game compels you to play in different modes to keep up with everything you want to do. \n\nSometimes, you are the explorer, sometimes the miner, the farmer, the builder, the tinkerer, the evil overlord, whatever... It's your game, and you get to decide, yet there is an interesting balance that drives you gently into different aspects of the game. In design, it's a very complete experience.\n\nCreativerse has its problems too. The most annoying for me is that it is riddled with performance problems that seem to actually get worse over time. I do understand that a lot of data is coming with every block on the map. I can ignore the new problem of visual updates that don't happen when adding new blocks or more aggressively when using explosives. I really struggle with frame rate lags as the game struggles to keep up with rapid changes in the view. It seems to be more of a crunch with incoming data than a limit on graphics rendering. As these problems occur, it's easy to imagine a huge chunk of data trying to move from RAM, through the CPU, onto the graphics card, and finally onto the screen. Bear in mind that I'm currently running on a beast of a system that can edit 4K video without a lag or hitch all day, so seeing performance problems in a game is rare for me. \n\nI've learned that reducing the view radius has the biggest effect on performance, but even so, using a teleporter ( a great quality of life feature) means that I will wait a significant amount of time before I can see the environment after I've arrived in a new location. The confounding aspect is that it wasn't always so. My uninformed guess is that as features have been added to the game over time, the level of optimization hasn't kept up.\n\nAnd third, in a game which has clearly given a lot of thought into quality of life of the player in the form of blueprints, etc., there are some obvious missing pieces. If we can have explosives that neatly carve out 7x7x7 cubes of the landscape, why can't we have an explosive that carves a linear one block wide slice? Perhaps the limits of chunks of the world come into play. Why are the circuit systems so limited? We can play with logic and reaction to input, but the physical effects in the world are very limited. It's no redstone system. Why can't we build vehicles that interact with the inbuilt physics of the world in the form of boats, airships, or even rolling vehicles? Including these possibilities might account for the frame rate lag, as a large number of interactions would need to be considered in every block interaction. \n\nThere are certain farming aspects that exist, such as throwing a cold bomb onto tar, followed by a heat bomb to generate a huge pile of diamond. WIth tar, you can create as much coal or diamond as you want. Why are there no similar mechanisms for iron, or lumite? Even if these existed, they still do not eliminate the need for secondary resources at each level, such as magnetite, tourmaline, or corruption dust. They also do not eliminate the need for hunting at each level, such as leather, miru eyes, or warmwood teeth. Or the cold versions of all of the above...\n\nDon't get me wrong. I think one the best aspects of Creativerse is that you must operate as a hunter, explorer, and miner to progress, but I do notice the inconsistency in each of these aspects of the game.\n\nUltimately, it comes down to whether you want a game that follows in the Minecraft tradition with a better game out of the box, with a few problems, or whether you enjoy the endless tinkering that comes with creating the Minecraft game that you want. A younger version of myself may have chosen the tinkering option, but the busier, older version of myself prefers Creativerse, and the arguably more complete quality of creative gameplay it offers. Your mileage may vary....\n\nI'll give it a recommendation, but I still think my monstrous PC should run it effortlessly.\n", "timestamp_created": 1544924837, "timestamp_updated": 1544924837, "voted_up": true, "votes_up": 40, "votes_funny": 4, "weighted_vote_score": "0.774452924728393555", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12255048": {"recommendationid": "12255048", "author": {"steamid": "76561198018195133", "num_games_owned": 60, "num_reviews": 9, "playtime_forever": 3424, "playtime_last_two_weeks": 0, "last_played": 1450402904}, "language": "english", "review": "The game that makes you wait longer then you can take a dump. Pay or wait forever. Pay to have the best items. Purchased recipes can't be earned in game. It's your classic Free to Play get rich now regardless of how badly it messes with the game. It could have been bigger then minecraft. \n\nSave your money and time unless waiting 5+ minutes for each ore to be harvested. The best extractor can only be bought. So theres your pay for best items. Currently (going to be removed and reworked) they have a pay now to speed up crafting. I'm probly half way through the games ladder of ores. Crafting is insanely long. It's like 3 hours in-between mining runs spent on crafting. People have over 50 crafting machines because this games design is so flawed trying to get around it. Like I said it's changing but I mention it to demonstrate the character of the these devs. They thought lets make crafting take hours and stick a pay now button next to it.\n\nWe have a best item only available through purchase.\nwait time attached to everything from crafting to mining. \nPay for quicker noraml paced gameplay. (extractor and the pay now)\nOnline only cloud saves. Game no longer supported its over.", "timestamp_created": 1411793284, "timestamp_updated": 1411793284, "voted_up": false, "votes_up": 987, "votes_funny": 24, "weighted_vote_score": "0.878391087055206299", "comment_count": 33, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "22033727": {"recommendationid": "22033727", "author": {"steamid": "76561198209031605", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 1833, "playtime_last_two_weeks": 0, "last_played": 1485762043}, "language": "english", "review": "Creativerse is similar enough to Minecraft to be its free substitute, but has enough different content to be interesting to people who already own Minecraft. You pull blocks towards you using the Force and can jump 2 blocks high. Torches can actually set your thatched roof on fire. You 'discover' new blocks and recipes in a tiered system that means you don't ever have to remember recipes. You can even track required ingredients as you gather them. I enjoyed going through the levels of the earth, down to the 'corruption' level, which is essentially filled with Dark side energy that slowly kills you. SImilarly, there's mineral water found on the surface that gradually heals you, much like spring water from Biomes O' Plenty. There are fans that work like arcane levitators from Thaumcraft. There are teleporters and you can warp back to your spawn point at any time. Death statues appear holding all your items after you die, much like Openblock's graves.\n\nThe devs don't support modding as of yet, but I found that even I, as someone who loves mods in Minecraft, was satiated with all the different blocks and items in the game. Some of the blocks are gorgeous, like lumite and diamond glass. Some of the trees are so massive and impressive that you just have to spend 10 minutes climbing them. And no lag! The visuals are good quality even with an integrated graphics card.\n\nOverall, if you like the sandbox genre and Star Wars, you'll have a blast with Creativerse.", "timestamp_created": 1458869087, "timestamp_updated": 1458869087, "voted_up": true, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.742528796195983887", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23100546": {"recommendationid": "23100546", "author": {"steamid": "76561198016050449", "num_games_owned": 182, "num_reviews": 8, "playtime_forever": 234112, "playtime_last_two_weeks": 929, "last_played": 1551021137}, "language": "english", "review": "This game is about creating.  It has elements of survival, exploration, crafting, resource gathering, mining, but in the end, this game is about you creating your own world which anyone can play at any time.  The world is hosted and never goes away unless you delete it.  Any of your friends can instantly join you, or you can become a hermit and lock down the world with a password.\n\nContrary to the minecraft fanbois who come here, this is NOT a minecraft clone.  Anyone who plays the game for any length of time will realize that this game is also a game creation tool, in that you can craft and publish standalone adventures with the worlds you build in.  After creating an adventure with puzzles, traps, riddles, and physical feats, you then take a snapshot of your world and people can play the adventure without damaging or causing mayhem in your regular world.\n\nThis game is all about creating.  You are the designer.  You control your destiny.  You can now create.\n\nIn Creativerse\n\n\n[h1]RECOMMENDATION:[/h1]\n*Yes, if you like creative games in which YOU create your world with awesome tools\n*No, if you are looking for an rpg or somethign with evolving/dynamic story\n\n[h1]GAME IMPRESSION:[/h1]\nFirst 2 hours, The Miru are terrifying and gang up on me as soon as the sun goes down.\nAfter 20 hours, I finally figured out how to rotate blocks and craft even cooler stuff\nAfter 200 hours, I created my own server with over active 900 users\nAfter 2000 hours, I started making my own adventures for other people to explore\n\n[h1]MAX GEAR / CRAFTING TREE COMPLETION TIME:[/h1]\n*Rushing:  pro player: 2 hours to full lumite without buying items from the store\n*Leisurely: a couple weeks\n\n[h1]GAME COMPLETION TIME:[/h1]\n*Rushed play style: there is no completion time in a game where you are the creator\n*Leisure play style: eternity\n\n[h1]RECOMMENDED GAMING HOURS:[/h1]\n( ✔ ) Busy Adult, have very short time to play\n( ✔ ) Freelancer, playing on and off\n( ✔ ) Gaming anytime anywhere, memorized every corner in the game\n\n[h1]GAME DIFFICULTY:[/h1]\n( ✔ ) Adjustable on new game world (only for pro)\n( _ ) Adjustable on each stage\n( _ ) Not adjustable, game made for casual gamer\n( _ ) Not adjustable, game made for average gamer\n( _ ) Not adjustable, game made for professional\n( ✔ ) world customization (only for pro)\n\n[h1]vGAME MODE:[/h1]\n( ✔ ) Online Player versus Player\n( ✔ ) Online Cooperative\n( _ ) Campaign Mode (Linear story)\n( _ ) Campaign Mode (Multiple Ending)\n( _ ) Random level generated\n( ✔ ) Random AI/item/pickups generated\n( ✔ ) Level-up progression\n( _ ) Statistic\n( _ ) Leaderboards (Friends Ranking)\n( _ ) Solo Score Attack\n( ✔ ) Mircotransactions (yes, but uneccessary)\n( _ ) Split Screen / Local Coop\n\n\n[h1]POSITIVES & NEGATIVES[/h1]\n+Very easy to play\n+vast areaa to explore\n+Collect resources to survive, build, craft and trade\n+Quick fast travel to personal touchstone, and craftable teleporters\n+nearly 500 craftable blocks, hundres of other found items\n+Mysterious alien creatures\n+treasure chests on many layers in many biomes\n+snapshots\n+multiple DLC to enjoy\n+developers give out free material packs and item packs when they release store items\n+Photo Mode \n\n-no xbox controller play\n-no way to enter & return from adventures to an existing world \n\n[h1]QUALITY\tSCORE[/h1]\nGraphic (2017)\tA\nPresentation\tA+\nArts & Design\tA+\nLevel Design\tA\nCombat Tactic\tC\nMusic Flow\tA\nSound Effects\tA\nRealistic\tB\nReplay Value\tA+\nBug-free\tB+\nOverall\tA\n\n\n[h1]PRO DLC BEST PRICE HISTORY:[/h1]\n25% off  ($14.99)\n\n[h1]WORTH BUYING:[/h1]\n( ✔ ) Yes, normal price worth it!\n( _ ) Yes, can wait for sales\n( _ ) No, the developer has no plan to improve\n( _ ) No, not worth the time on it\n\n[h1]WORTH BUYING WITH DLC?[/h1]\n( ✔ ) Yes, base game + individual DLC\n( _ ) Yes, base game + DLC + Season Pass\n( _ ) No, DLC is different value\n( _ ) No DLC\n\nI really enjoy this game, I've put over 8000 hours into it!", "timestamp_created": 1463762920, "timestamp_updated": 1543270523, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.633700251579284668", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26255781": {"recommendationid": "26255781", "author": {"steamid": "76561198090237578", "num_games_owned": 50, "num_reviews": 4, "playtime_forever": 13285, "playtime_last_two_weeks": 0, "last_played": 1498234313}, "language": "english", "review": "[h1]Review R35/R36/R37... Oct 27, 2016[/h1]\n\nThis game like so many has lots of potential.\n\nI write this review from the perspective of enjoying to build structures and crafts as I have little interest in PvP, and people should learn to be creative together rather than destructive.\n\n[b]Briefly about the game[/b]\n\nLike in \"Minecraft\" you just spawn in the middle of an area with a few supplies and are left to your devices.  You are given a note advising you to find shelter before dark or face the unknown.\nYou have a power glove that can harvest resources by pulling them towards you, which when you have enough can be used to craft and create other blocks allowing you to build what ever your imagination can dream up.\nBlock recipes are learned as you acquire contents, craft other items, find them in treasure chests, or take them from the native life.  Many mobs are hostile all the time, at night and are burned away with the rising sun.\nThis world operates very differently from other mining/building games by increasing the difficulty as you dig deeper and build higher.  The deeper you mine the tougher the materials to break and the harder the native mobs.  At higher altitudes its very very cold and you need a heat source to avoid freezing to death.  In addition to vertical temperature changes you also experience changes as you move from region to region ( for example tropical is warmer than forest or snow ).\nAs the sun crosses the sky shadows of the buildings being created will  stretch forth for a nice affect.\nYou must keep exploring and searching or some recipes will never be known.  Once found they are yours for good if and only if you have paid for the Pro version.\nDuring the progress of the game you can tame various animals, once tamed if feed and washed they will yield some resources or even recipes.   Don't expect to get them without a fight, even in peaceful mode.  This aspect seems a little childish to me.. and probably more oriented to ten year old's teaching them to look after their pets.\nWARNING do not use the free 300 coins to buy any claims, as you will loose the benefit in other worlds.  Only the bought recipes will be available in other worlds.\n\n[b]Pro's:[/b]\n\n[list]\n[*]Texture detail is high resolution and merge almost seamlessly with each other making for better looking walls and floors.\n[*]You can hold a large volume of items in your inventory, ( lets face it 1 cubic foot of steel weights 490lbs in reality so its never real ), so as far as gaming is concerned a large inventory stack ( 99 ) saves a fair amount of time.\n[*]You can craft items directly from your inventory as long as you have the stock.\n[*]You don't need to eat to play the game... only to heal yourself.\n[*]You can use TNT to blow up useless terrain, and the rare valuable ores are maintained.\n[*]Ores are more bountiful than some other games.\n[*]You have teleporters to travel almost anywhere, which adds a nice touch.  Each one can be coded to allow access to specific  other teleporters.\n[*]Block orientation within Creativerse has a nice addition, you can rotate most blocks into different positions.  For example slabs can be placed on edge allowing the creation of narrower walls etc...  Tapered roofing can be placed on the ends of gable roofs giving a correct feel and look.\n [*]The wiring and electronics available within the game is superior and does not take up extra space.  You also have number pads to enter values within the game for some nice security features.\n[/list]\n\n[b]Cons:[/b]\n[list]\n[*] Creativerse has no \"Creative Mode\" what a surprise\n[*] Boring, Boring, boring... not sure why the point but I've just spent the last 9.8 hours looking for recipes for the new xmas features to only discover about 60% of them.. basically a waste of 9.8 hours of my life... no building, just mindless pointless jumping around searching for recipes. I've decided to dump this game since the develper obviously does not care about my time.\n[*]This is a pay to keep playing game, even after you buy the \"Pro\" version, you still can't play locally.\n[*]Single Player and offline are not available period, due to server authentication.   So if the server is down or runs out of cash you are done.\n[*]You must claim land by one of two methods, pay real cash to buy coins, to buy land or harvest expensive ores to pay for them.  At first its coal, then obsidian, then diamonds, then lumite (very hard to find in large quantities without wasting a ton of time. \n[*]To smelt blocks and Items you must click once for EACH piece to enter the furnace. ( a very bad idea that can lead to  potential physical injury ( I speak from experience ).\n[*]To process blocks and items you must click once for each piece. They have a collect all button but not a process all, and its 21 clicks to fill the machines.\n[*]To place items you must click once for each piece.\n[*]Recipes found are not retained from world to world unless you pay for the pro version.\n[*]More slab shapes could be enabled in various hue's to better match the building materials in play. This con was addressed by [b][i]R36[/i][/b] now have lots of slabs and new slopes\n[*]Colours in some blocks look like they came from totally different palettes  ( for example 3 iron blocks belong and look in place while the corresponding stairs don't match at all ).\n[*]Their are very few mechanisms, only doors, pressure switches and fans to interact with players.  Currently I'm not aware of a way to hide a pressure plate. ( No pistons)\n[*]I've played the game for a long time and even with a \"Pro\" version I'm missing many recipes.\n[*]Timing errors occur between family members playing over the Lan and obviously sharing a connection to the server.\n[*]Buggy, but they do make an effort to fix them.\n[/list]\nDue to the high high repetition of clicking and the lack of single player  and offline, I can not honestly recommend the game, and personally feel its doomed to fail.  If you are a casual builder that comes on once in a blue moon then you may not have any issues, but serious large scale builders will not be happy if their efforts just vanish one day without a trace.  I also personally feel that if you've got the \"Pro Version\" you should be able to retain the game and play offline, including \"Lan\".\n\nPS.. Comment to steam... life is not black and white... we need a star rating system in addition to Yes/No 7/10 stars.", "timestamp_created": 1477619238, "timestamp_updated": 1495642456, "voted_up": false, "votes_up": 89, "votes_funny": 1, "weighted_vote_score": "0.814163863658905029", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19628814": {"recommendationid": "19628814", "author": {"steamid": "76561197974869646", "num_games_owned": 334, "num_reviews": 6, "playtime_forever": 11009, "playtime_last_two_weeks": 0, "last_played": 1510001364}, "language": "english", "review": "This game has quite a few features that simlar games do not like placeable teleporters, you can tame anything and then feed/milk it for its loot table, and very involved friendly devs to name a few.  It does not have any automaion/engineering ATM, NPCs, or Mods but a large chunk of what they dont have they know most of us want and are open to adding it if it wasnt already planned (Early Access still in development and all).\n\nIt is a pretty well functioning game, runs well and have encountered only one bug when my friend was declaring war on the terrain with explosives.  It is now F2P, with the only in game purchases being cosmetics (Different blocks) and fireworks.\n\nIm not really a huge fan of EA and all the downsides it entails but I am actually enjoying this quite a bit especially since you can make a private world with friends (All servers are on their end so that can be good or bad for you depending on preference).  The one absolutely huge thing that will keep me in is the friendly and helpful devs which are quite active in the forums.  Example, in the middle of the night for North America, servers went down and within a few hours they were posting on the forums and had them back up.  I also had my world go down for 50 mins once.  After 45 mins I finally put in a ticket, and even though the problem resolved on its own I had a dev come into my world and check to make sure everything was ok 37 mins after putting in the ticket.  They might not always be this fast but often they are and always working hard to find out what their players want.  Gotta love that =)", "timestamp_created": 1449832300, "timestamp_updated": 1449832300, "voted_up": true, "votes_up": 45, "votes_funny": 5, "weighted_vote_score": "0.772801876068115234", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "37342110": {"recommendationid": "37342110", "author": {"steamid": "76561198253862689", "num_games_owned": 232, "num_reviews": 5, "playtime_forever": 122965, "playtime_last_two_weeks": 6, "last_played": 1551663351}, "language": "english", "review": "My wife and I found Creativerse and instantly fell in love with it.  It's a builder in the same vein as Minecraft, but we prefer Creativerse.  Build, explore, above ground, high into the sky -- the freedom is yours.  The developers are constantly updating the game and introducing new systems and new block types and new tools, so don't worry about the game being one of those that gets released and then has no support.  These guys care, and it shows.\nYou get the ability to create an unlimited number of worlds to play in if you buy the $9.99 Pro version (free limits you to one world), as well as the ability to define that world in more ways (more resources?  Fewer?  Peaceful animals?  etc etc).  The pricing is very reasonable (in a world where pricing is usually utterly ridiculous).  \nThere's no \"tutorial\" per se, and there's no guide to define a path for you.  The world is yours, and the freedom to choose is yours.  If you like having that sort of open-ended freedom and design, this game is for you.  If you must have quests to follow or assignments and get lost without them, then perhaps it isn't.\nWe love it.", "timestamp_created": 1511533066, "timestamp_updated": 1511533066, "voted_up": true, "votes_up": 81, "votes_funny": 4, "weighted_vote_score": "0.782953321933746338", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31656933": {"recommendationid": "31656933", "author": {"steamid": "76561198018218771", "num_games_owned": 151, "num_reviews": 3, "playtime_forever": 80670, "playtime_last_two_weeks": 0, "last_played": 1550175095}, "language": "english", "review": "[h1]WARNING!   ADDICTION AHEAD![/h1]\nHaving played through the tail end of the Early Release (Since late January, 2017), I have come to realize that I am fully addicted to this game.\n\nThe sandbox game play allows you to create most anything your brain can imagine, granted it will be stationary, but you should visit some of the worlds out there where creativity abounds!\n\n[h1]Private or Multiplayer:  The worlds are always available and your plants grow even while you're away![/h1]\n\n[u]Entire cities, large communities of players working together to make the absolute most of their world.[/u]\n\nWorld owners can assign others to be Admins to help moderate the worlds.\nWorlds settings can be modified by the owner.  \n      Want peaceful creatures?  Go for it!\n      Want PVP (Player Vs. Player) combat?!?   Have at it!\n      Want to decide of fire and TNT can damage the world?   It's at your whim.\n\nClaims within the world can be bought with materials harvested.\n       Claim owner can override world settings.\n       Claim owner can appoint their own claim admins, and decide who is a visitor or a builder.\n\nAdventures created by the users, which give you such a vast array of different challenges, are becoming more and more plentiful as more users become comfortable with the already easy to use tools.\n\n[h1]The development team listens to the community in the forums, or through email.[/h1]\nYou see them interact with people as questions are asked.   Not very many other games I own can say they do that.\n\nThey also have explained to the users their vision of what they want to see added to the game. \nThere has been almost bi-weekly changes made, with content being added all the time!\n\n[h1]Early Access allowed people to experience, and in some instances, help mold the core of the game.[/h1]\nIn the forums, players have the ability to speak out and explain that works and what doesn't.\nNow that the game is 'Live' I don't forsee any reason for the devs to stop this train of thought.\nIn fact, with more users giving input and pointing out things, I think the game will just advance that much more!\n\n[h1]Haters be haters.. and want to hate.[/h1]\nDon't listen to the negative people who have played only a mere hour of the game.\nThat doesn't even begin to allow you to explore the massive worlds that exist, or to find communities and see just how friendly this game and it's playerbase is.\n\nWhile the game is [b]FREE TO PLAY[/b], and [i]yes, there are micro-transactions[/i], [b]YOU DO NOT NEED TO BUY ANYTHING[/b] to be able to explore worlds and advance the crafting and building tools.\n\n[h1]Try the game yourself, there is no cost required to play![/h1]\nIf you DO buy the DLC, it allows for extras that aren't 'PAY TO WIN'..\n\nYou gain flight.. which makes it easier to get around.. but you can craft foods that [spoiler]increase your walking speed, and also protect you from fall damage![/spoiler]\nAnd [spoiler]teleporters can be built to help you move from place to place easier![/spoiler]\n\nYou gain a flashlight .. but you can craft torches, lamps, lanterns, etc and place them as you go.\n\nYou gain more bag space.. but you can make chests to store items and have a touchstone to return instantly to when your bag becomes full.  And as mentioned above.. [spoiler]TELEPORTERS TO MOVE AROUND EASIER![/spoiler]\n\n[h1]So very much more I haven't touched on..[/h1]\nSearch for the social media streamers who are showing off the game.\nI've seen them find stuff that I didn't even know about.\n\nIf you start playing.. and can't seem to stop..\n...you could just do what the devs do.. \n...and claim the leafies made you do it.", "timestamp_created": 1494376758, "timestamp_updated": 1494376961, "voted_up": true, "votes_up": 52, "votes_funny": 2, "weighted_vote_score": "0.723017096519470215", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22926125": {"recommendationid": "22926125", "author": {"steamid": "76561198276987293", "num_games_owned": 104, "num_reviews": 8, "playtime_forever": 4869, "playtime_last_two_weeks": 0, "last_played": 1541652195}, "language": "english", "review": "This is probably one of the best free games on steam. If you read the bad reviews, saying that you have to pay to get things faster, they completely removed that feature. There still is an in game shop, where you can get more blocks and builds, but you start off with 2,000 coins. That seems to be enough to get the things that you want. I haven't added a penny to this game, and it is one pf my most played games. I would definatley reccomend this game to anyone, regardless of wheter you like the genre, or not.", "timestamp_created": 1463059174, "timestamp_updated": 1463059174, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.616895616054534912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "45258951": {"recommendationid": "45258951", "author": {"steamid": "76561198158554599", "num_games_owned": 205, "num_reviews": 7, "playtime_forever": 9195, "playtime_last_two_weeks": 0, "last_played": 1537116556}, "language": "english", "review": "==[PLAYER BASE]==\n☑ Kids\n☐ Everyone\n☑ Casual Players\n☐ Pro Players\n☐ Hackers\n\n==[ ⚙️Graphics]==\n☐ Potato\n☐ Really Bad\n☐ Bad\n☑ OK\n☐ Good\n☐ Amazing\n☐ Masterpiece\n\n==[PRICE/QUALITY]==\n☐ Full Price\n☐ Wait for sale\n☐ Average\n☐ Refund if you can\n☐ Don't do it\n☑ Free\n\n==[ ☣ REQUIREMENTS]==\n☐ 90' PC\n☑ Minimum\n☐ Medium\n☐ Fast\n☐ High end\n☐ NASA Computer\n\n==[DIFFICULTY]==\n☐ You just need 2 arms\n☑ Ez\n☐ Easy to learn/Hard to Master\n☐ Hard\n☐ Dark Souls\n\n==[ 🕒GAMETIME]==\n☐ Very Short (0-2h)\n☐ Short (2-8h)\n☐ Few Hours (8-12h)\n☑ Long (12+h)\n☐ Endless\n\n==[ ♫ STORYLINE]==\n☑ No story\n☐ Still better than Twilight\n☐ Average\n☐ Great\n☐ Harry Potter\n\n==[ ⌭ BUGS]==\n☐ Game itself is a bug\n☐ PUBG\n☐ Lots of bugs\n☑ Few Bugs\n☐ You can use them for speed run\n☐ Nothing\n\n==[ ⌕ OTHERS]==\nSingleplayer: YES\nMultiplayer: YES", "timestamp_created": 1539487589, "timestamp_updated": 1539487589, "voted_up": true, "votes_up": 43, "votes_funny": 24, "weighted_vote_score": "0.74787747859954834", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32063172": {"recommendationid": "32063172", "author": {"steamid": "76561198037307473", "num_games_owned": 101, "num_reviews": 5, "playtime_forever": 3483, "playtime_last_two_weeks": 0, "last_played": 1496151737}, "language": "english", "review": "The graphics and visual is stunning and the POV is better than Minecraft. \n\nLike and unlike any other sanbox game, it's wonderful to play at first but I am not entirely keen on it's replayability.\n\nIn Starbound, you upgrade your matter manipulator and that's it, it doesn't break. In Creativerse, you have to craft your gloves over and over. The durability seems to break as fast as you can get blocks/materials. \n\nI've played Minecraft way before it became popular. The PRO version was fun and feels rewarding but the world looks the same after a while. Exploring the world becomes boring after that. \n\nThe idea of making \"farms\" to get finite materials (iron, diamond, etc) is tedious compared to Minecraft. I never had to go to such length to look for them.\n\nPets: Feeding them is fine but I have to wash them? And the glove to wash them breaks. \n\nThe opportunity for creativity is wonderful but it's quite a chore to get all the blocks because your glove breaks.\n\nEvery glove breaks!\n\nWould I recommend you to try it? Yes.\n\nWould I recommend this for long term gaming? Not really.", "timestamp_created": 1496152708, "timestamp_updated": 1496152708, "voted_up": true, "votes_up": 97, "votes_funny": 7, "weighted_vote_score": "0.818599343299865723", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31714453": {"recommendationid": "31714453", "author": {"steamid": "76561198011235385", "num_games_owned": 92, "num_reviews": 3, "playtime_forever": 2547, "playtime_last_two_weeks": 0, "last_played": 1546707715}, "language": "english", "review": "Picked this game up so I would have a minecraft game the whole family could play together. The only annoying part about this game is how my daughter likes to destroy the houses I work so hard on but that could be more of a statement on my parenting than this game. \n\nCompletely addicting and I can totally recommend for someone who doesn't want to buy Minecraft lol.", "timestamp_created": 1494643960, "timestamp_updated": 1494643960, "voted_up": true, "votes_up": 127, "votes_funny": 156, "weighted_vote_score": "0.806407809257507324", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35866881": {"recommendationid": "35866881", "author": {"steamid": "76561198179205231", "num_games_owned": 39, "num_reviews": 6, "playtime_forever": 5740, "playtime_last_two_weeks": 0, "last_played": 1542072583}, "language": "english", "review": "Alright, in a realistic sense we can all agree this is DEATHLY similar to Minecraft. So similar it's scary, but it still has amazing potential as a game. I'll address the negatives first & give my outlook on them.\n\n1. \"Boring & Grindy\"\nPersonally, I ENJOY the curve of grind and building up. Instead of having everything ready to craft, you'll have to craft things to unlock more recipies. This gives incentive to explore and collect materials, fight mobs, etc. \n\nAs for boring, I recommend playing it with friends. Even when I didn't have Pro, a ton of fun was still availible for free players. If all else fails, just start screwing around. \n\n2. \"Laggy/Connection Issues\"\nThis must be player specific, because my connection is fine when playing. After multiple friends played Creativerse, with each having varying computer setups, 90% have played fine without issue. There ARE lagspikes when entering places such as the lava layer, but these last only briefly. \n\n3. \"No Creative\"\n...We all cringe at this one. Lack of sandbox ability hinders fully testing & experimenting with everything. However, there is a sense of wonder & excitement when you start piecing things together in survival and testing it out to see the results. Hell, I was ECSTATIC over wiring. You can still explore the items within' Creativerse, it just takes time to build the recipies (play with friends).\n\n4. \"Pro\"\nI agree the paywall can be a pain for some people. Restricting free players to ONE WORLD seems a bit much. I do suggest the developers buff free players so they have a little more freedom. Forcing players to buy Pro for more worlds isn't fair, and I think Playful needs to take a look at this again. ...Especially with the massive store.\n\nOverall, Creativerse is a great game. It has its flaws, but there's massive potential for fun & creativity. If you don't dig it solo, grab a few friends & unlock the potential for building cities & enjoying yourself. For people who don't want to fork over $27 for Minecraft, this is a great alternative. \n\n", "timestamp_created": 1508514828, "timestamp_updated": 1508514828, "voted_up": true, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.754762411117553711", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43594743": {"recommendationid": "43594743", "author": {"steamid": "76561198841582699", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 34261, "playtime_last_two_weeks": 0, "last_played": 1541647419}, "language": "english", "review": "Creativerse is a really great block-based, open world sandbox game. The biggest surprise for me is how incredibly feature-rich, polished, and well-rounded the game is for a free-to-play. You can purchase the \"Pro\" version, which earns you some enhanced gameplay and the ability to create multiple worlds... but at this point? I feel compelled to purchase the Pro version simply to support the developers, and ensure that they keep expanding and enhancing this incredibly fun game.\n\nWith regard to the thematic style, the graphics are simple yet surprisingly detailed, the music is unobtrusive yet provides great atmosphere, and the sound effects are cool as well (I love the sound of the forge and processor on headphones). All of these things add to the fun gameplay, and make it a really great game.\n\nWhile Creativerse is pretty easy to pick up and get the hang of things, the option of a quick tutorial at the onset would be a welcome addition, just to give newcomers the choice of learning the basics and pointing them in the right direction. I had a general understanding of block-based sandbox games before starting, and I still got a little confused initially as to how certain things worked. \n\nGameplay is very smooth and responsive on my machine, but it makes my CPU fans spin up like a jet engine. My specs are significantly higher than base requirements, so I'm curious what's going on with the processing.\n\nAll-in-all, Creativerse is a feature-rich and engaging game that's a lot of fun to play. Plus, you can't beat free – it's definitely worth the time to install, sit down and give it a whirl!", "timestamp_created": 1531870087, "timestamp_updated": 1531870087, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.717642068862915039", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18268501": {"recommendationid": "18268501", "author": {"steamid": "76561198068800201", "num_games_owned": 546, "num_reviews": 8, "playtime_forever": 6015, "playtime_last_two_weeks": 0, "last_played": 1494720040}, "language": "english", "review": "This is a refreshing start for Survival games. I've been playing Minecraft for over 3 years now and I got fed up a long time ago. Yet, Creativerse has a new and fresh look to it, which makes it super fun to play, for Minecraft players and for those who have never played Minecraft.\n\nAfter playing for 13 hours, here's my list of pros and cons:\n\nPROS:\n- Amazing textures and graphics\n- Beautiful ambience and sounds\n- Large variety of mobs and items\n- Great amount of building blocks and possibilities\n- Complex, mysterious and very well made spooky cave system\n- Teleporting system\n- When you die, you don't lose all your stuff nor progress\n- Awesome crafting system, with recipes, challenges and more\n- Spawning of random chests throughout the world\n- Farms and plenty of cool contraptions to make\n- Easy to play with friends, for free\n- Plenty of furniture to decorate your home\n- Addictive and challenging\n- Cool GUI/HUD\n- Temperature system\n- You can own pets and take care of them, dress them and bathe them\n\nCONS:\n- The server side system makes it buggy, laggy and glitchy\n- The characters aren't (yet) customizable at all\n- Upon launch it will be free to play, which makes me afraid of seeing this game turning to the micro-transactions dark side \n- Still has plenty of bugs (most of the times are fixed by relogging, but still annoying)\n\nIf you are thinking about wether you should buy it right away or wait for launch, I would recommend you to buy it right away, these devs definitely deserve the support for such a great game.\n\nThank you!", "timestamp_created": 1443648083, "timestamp_updated": 1444869958, "voted_up": true, "votes_up": 67, "votes_funny": 2, "weighted_vote_score": "0.759464383125305176", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "22452291": {"recommendationid": "22452291", "author": {"steamid": "76561198101717197", "num_games_owned": 125, "num_reviews": 3, "playtime_forever": 2155, "playtime_last_two_weeks": 0, "last_played": 1513897341}, "language": "english", "review": "Hello everyone! This'll be a medium to long review.\n\nOkay, so first of all, I don't play alot of games like this. The only one I've played similair to this is Terraria.\nThat being said, I was drawn to it because it's free and it looked okay.\nI actually really like Creativerse as a whole, even though I've played for 3 hours total when writing this review.\nIt's open world is quite immersive, and it doesn't take ages to find other biomes and explore. Night-time is dangerous but the creatures look really awesome!\nBuilding/crafting isn't that hard and pretty much explains itself. Which is good in my book.. It's a good book. 'cos it's my book.\n\nRIGHT!\n\n\nPROS:\n\n+ Graphics: Smooth graphics and it runs rather smooth aswell. Even the blocks have detail! The scenery is often breathtaking even though it's made from blocks. It's beautifull!\n\n+ Relatively easy crafting:  As said above, the crafting explains itself. That being said, recources aren't that hard to come        by in early stages appart from exploring but I figure it'll get alot harder later on.\n\n+ Bestiary: Since I always want to read up on monsters before I actually encounter them, I came across a relatively large bestiary. From pig..things.. to  Things. It's pretty diverse and each spawns within it's own biomes and Lord help me if I find myself in a cave!\n\n+ Biomes: As diverse as the bestiary, as diverse are the different biomes to explore. Didn't take long before I found myself in a jungle.. at night time... getting nuked by creatures I was trying to run from. 10/10 would explore again!\n\n+ Mining: Okay, so it's not actual mining with a mining pick. Why not? Because that's boring. And who uses a mining pick when you have a cell-powered WABBAJA-  ehm.. MINING GLOVE! That's right! You just rip blocks out of their comfort zones and put them in your dark, dusty inventory only to be processed into more usefull things like rods or slabs.\n\n\n\n\nCONS:\n\nI can't really think of any major flaws. It's early acces, what would one expect? Goats stay on the ground? Wrong, I saw a couple fly into the air... Which was quite the hilarious sight, I might add. \nSo... so far so good! I hope the developers keep up the good work as I, and many others, would probably want to see more awesomeness!\n\n11/10 Would recommend to anyone who likes exploring, gathering, crafting, surviving, building your own secret laboratory and slap pigs with a stick! No pun intended.\n\n11/10 Would play again! Which I'm going to do.\n", "timestamp_created": 1460812192, "timestamp_updated": 1460812192, "voted_up": true, "votes_up": 48, "votes_funny": 18, "weighted_vote_score": "0.750835418701171875", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "31670664": {"recommendationid": "31670664", "author": {"steamid": "76561198269369647", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 71679, "playtime_last_two_weeks": 135, "last_played": 1551026083}, "language": "english", "review": "Close to 500 hours playing this game. Now why do I have that much time playing it?\nPros and Cons:\n -Pro: Free to play; no need to memorize recipes; public worlds you can visit without the host being online; parents can create safe world for younger kids who want to play same stuff the older ones do.\n-Con: Only way to get eggs is to tame a chizzard. Oh well.  If you don't like it, it was free.\n\nI found this game during Early Release in 2016.  \n\nMy first time in Creativerse, I loved the variety of textures and colors.  The most of the creatures are different from the usual run-of-the mill animals.  I absolutely loved the autumn colors on some trees.  I also loved that I could make my world no-pvp and peaceful creatures.  Oh, and the peace because the boys weren't fighting over an accidental hit or kill.\n\nFor me as a parent, that is a BIG ace! \n\nNow, as to the \"reviews\" where the people are complaining about cost. This game was free to play in Early Access, and is still FREE TO PLAY.  That other game people compare it to? You can't play it unless you buy it first!  Yes, I did purchase Pro. I did so because I like the game and I want to help support it. The premium blocks? I don't need them. I don't have to buy them to play the game. I may if I want to use them on my private world. On the public worlds, I have made friends who, if they have the blocks, are happy to make some for me (especially if I ask what is needed and collect the materials).\n\nPro means you are helping to support the game. The developers show their thanks with a few cosmetic things. You can play the game without them. A mobile light that stays with you? Torches aren't too hard to make (and stack up to 99!). Gliding? I still have to run through a jungle or cave. You can have multiple worlds...well, since there are so many public servers, that is a moot point. Frankly, it is a lot of fun to visit other servers and see what has been created there, even if you don't want to play on that particular world. Go ahead - it is free. You may just like it.", "timestamp_created": 1494442279, "timestamp_updated": 1494551511, "voted_up": true, "votes_up": 25, "votes_funny": 3, "weighted_vote_score": "0.702776312828063965", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29454100": {"recommendationid": "29454100", "author": {"steamid": "76561197989537004", "num_games_owned": 2065, "num_reviews": 31, "playtime_forever": 901, "playtime_last_two_weeks": 0, "last_played": 1485507460}, "language": "english", "review": "This isn't half bad. I don't really enjoy Minecraft but I enjoy this, for whatever reason; it's similar, but not really the same game. It's a bit more... progression-based is probably the best way to put it, although I hate to imply that it's anything like Dragon Quest Builders either.\n\n\nThe free content here is more than sufficient, which was my initial concern, given that there's a paid option for more stuff. You can do pretty much anything you want to do. There's also the option to pay money, if having more fiddly little bits to build with suits you, or if you want some extra convenience features. If I put enough time into this, which I may or may not, it might actually be worthwhile to have the flashlight, etc., that come with the Pro upgrade, and the developers certainly deserve their share.", "timestamp_created": 1485226541, "timestamp_updated": 1485226541, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.665366113185882568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21986168": {"recommendationid": "21986168", "author": {"steamid": "76561198286320993", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 4989, "playtime_last_two_weeks": 0, "last_played": 1462071402}, "language": "english", "review": "I don't do a whole lot of gaming (as evidenced by my lackluster profile here) but I do really enjoy this game. There's a level of cathartic, relaxation to it. I can sort of immerse myself in the world (which is quite beautiful) and lose myself for hours. I highly recommend it to anyone who likes crafting, mining, and building stuff. :)", "timestamp_created": 1458666423, "timestamp_updated": 1458666423, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.691615700721740723", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "48337898": {"recommendationid": "48337898", "author": {"steamid": "76561198166587670", "num_games_owned": 18, "num_reviews": 2, "playtime_forever": 168111, "playtime_last_two_weeks": 56, "last_played": 1551819620}, "language": "english", "review": "My rant:\n\nI no longer play this game. The devs ultimately chose a direction for the game that didn't really fit the way I wanted to play and have to-date chosen not to allow modding. I will not judge them for this despite my disappointment. I understand that the business model they chose would crumble if players could simply mod in their blocks and resources. It's a business. \n\nHonestly, I would rather have paid $60 and been able to mod it and host a private server but, oh well, that's not what they offered. It is what it is. Still, at the end of the day, I have spent so many joyful hours here I cannot rightly give this game a bad review. \n\nYes I did receive Pro for free as a pre-release supporter, but I spent that price at least a couple times over in recipe packs and such. I don't regret that at all, even though I no longer play. I more than got my money's worth from Creativerse.\n\nMy actual review:\n\nCreativerse has a lot going for it.\n\nIt offers some very enjoyable and unique building mechanics. Full block rotation, blueprints, autofill, wiring, logic gates. I actually played this before I played Minecraft and trying to go from Creativerse building system to that one was a rough transition I was never able to fully adjust to. Felt like a downgrade.\n\nIt's free, though I must say you REALLY want the glider to maximize the fun here, so my stated opinions really refer to the Pro version. Try it free, like it, spend the $20. \n\nAnd though I found this much more true in previous versions, the game still has a cool and funky vibe, kind of cartoon-spooky, that I really found delightful when I first ran across it. The background music and ambient sounds are really well done too. \n\nSo if you like exploring and mining, easy building and very mellow combat, especially with a group or with your kids, I recommend trying this game. It has its ups and downs, but if you have a decent CPU and a really good internet connection you will have a good time. \n\n\nTL;DR \nRead a shorter review", "timestamp_created": 1547513851, "timestamp_updated": 1547562939, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.682327210903167725", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42948816": {"recommendationid": "42948816", "author": {"steamid": "76561198171023033", "num_games_owned": 58, "num_reviews": 3, "playtime_forever": 4903, "playtime_last_two_weeks": 0, "last_played": 1529714954}, "language": "english", "review": "This is a creative game with tons of potential executed by a semi dedicated and somewhat lacking developer. The payed features used to be a benefit but are becoming the main focus. The severs are lagging and although I can play AC origins on ultra this game runs poorly. The glitches, lag spikes and overall lack of new content and focus have driven me away from this game and considering taking up a modded minecraft", "timestamp_created": 1529715235, "timestamp_updated": 1529715235, "voted_up": false, "votes_up": 33, "votes_funny": 1, "weighted_vote_score": "0.701949417591094971", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23392331": {"recommendationid": "23392331", "author": {"steamid": "76561198248760116", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 2915, "playtime_last_two_weeks": 0, "last_played": 1513973757}, "language": "english", "review": "I hope this the game is Chinese~", "timestamp_created": 1465096384, "timestamp_updated": 1476785989, "voted_up": true, "votes_up": 26, "votes_funny": 3, "weighted_vote_score": "0.720588266849517822", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23157929": {"recommendationid": "23157929", "author": {"steamid": "76561198025554146", "num_games_owned": 52, "num_reviews": 3, "playtime_forever": 464, "playtime_last_two_weeks": 0, "last_played": 1487314015}, "language": "english", "review": "I picked up this game a few days ago and forgot about it. And then sunk my evening yesterday into it. For Minecraft players, they'll find this game familiar yet fresh and different. There are a few really minor thinga that make the play experience much nicer than Minecraft, for me. One major thing is jumping. You can jump 2 blocks straight up and you can jump across a pretty wide gap. The other thing is mining. Rather than stand there and swing your pickaxe like a fool, you simply place the gatherer, and walk away. Then when you come back when it's finished, and your ores are sitting there all nice waiting for you. Eating also isn't a necessity. Which I know will be a point of contention for some, but rather it's there to boost your play experience rather than hinder it. There are some other things, like falling damage, that are equally convenient but you won't notice so much.\n\nThere are also features you may notice from many popular Minecraft full mods. The death beacon is a major one where you can collect your items you dropped on death (but your quick bar handily remains on your person!). Equally convenient and awesome are personal and craftable teleporters. You can set teleporters to travel to eachother, and players in your world can travel directly to your person teleporter. This is especially handy when playing with a friend and you're able to explore without a concern in the world about getting lost. There's also many different overworld mobs with different varieties for biomes. And dozens of items to pick up off the ground you'll think you're chasing butterflies in Skyrim.\n\nThat said, there are a handful of things I find cumbersome coming from the super flexibile Minecraft background. First and foremost is recipe progression. Personally, I don't like having to 'find' recpies only after creating the items that are lower than it. Even though I can't create it, I like to see where I'm headded for eventually (a la Don't Starve). Also having to refine every item at the processor is a bit of a drag. It makes it so that your cave dives eventually have to turn back home or hole up and take a long pause while you refine the stone you need for more gatherers. \n\nI also found combat and taming to be quite clunky. I may not be getting the full grasp on how it plays properly but from what I gathered, you're pretty much guaranteed to take damage. The combat system heavily focuses on your gear rather than your ability to kite and hit. Taming falls on the same spectrum: while you're ringing your bell it seems like you just stand there and take damage. There are a few non-obvious ways to avoid taking damage, but I'd personally like to see it play a bit more 'obviously'.\n\nOverall, I highly recommend this game. It's a slightly different, yet familiar, take on the sandbox construction/survival genre and I think plays really well. It's a smooth experience that does a pretty great job of guiding newbies into it through individual tasks, though a wiki will still always be your best friend. It's a great early access game with a few minor hiccups (most of the stuff I noticed is graphical glitches) but doesn't interfere with your play experience.", "timestamp_created": 1464020831, "timestamp_updated": 1464020831, "voted_up": true, "votes_up": 19, "votes_funny": 2, "weighted_vote_score": "0.633344888687133789", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "20444686": {"recommendationid": "20444686", "author": {"steamid": "76561197994706018", "num_games_owned": 181, "num_reviews": 7, "playtime_forever": 4336, "playtime_last_two_weeks": 0, "last_played": 1501407725}, "language": "english", "review": "I used to run a couple MC servers with nearly 100 mods installed on each, plus I've made some tweaks to existing mods, spendind thousands of hours, so I'll just compare (+/-) Creativerse to Minecraft, because it's basically a MC's descendant\n\n+ beautiful consistent built-in graphics\n+ very convenient harvesting/mining\n+ resourceful crafting with detailed info\n+ recipe learning/discovery\n+ useful pets!!\n+ better Survival experience\n+ runs smoother\n+ blueprints (although in a very basic state atm)\n+ tons of tweaks which MC annoyingly lacks and force players to install tons of mods\n(the list would be too long to go through)\n\n- MC has got tons of items/recipes\n- MC is more complex (redstone!, pistons etc etc.)\n- unlimited MC world\n- lots of MC mods allowing to construct factories, production lines and even basic computers(!) or just add anything else you'd imagine\n- huge MC community with thousands of public servers (PVP, parkour, RPG)\n- dedicated servers\n\nIf I were to compare VANILLA Minecraft to Creativerse, then I'd go with Creativerse. However what really makes MC a true breakthrough in the whole gaming genre is it's community (with mods and customizations). Creativerse is still in production, so it might come as an interesting alternative to MC one day, but definitely won't supercede it.\nBut should you play this game? Creativerse is well designed, has really entertaining gameplay, and it's free...so why not?", "timestamp_created": 1452425235, "timestamp_updated": 1452432838, "voted_up": true, "votes_up": 94, "votes_funny": 6, "weighted_vote_score": "0.757362842559814453", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "14431746": {"recommendationid": "14431746", "author": {"steamid": "76561198113343519", "num_games_owned": 130, "num_reviews": 20, "playtime_forever": 2003, "playtime_last_two_weeks": 0, "last_played": 1438736381}, "language": "english", "review": "\n\nI wish there was a \"blah\" review.\nCreativerse is one of many Minecraft \"next generation\" games, hoping to cash in on that $2B trend. It's a good game. It's visually more attractive than MC, but then, aren't they all? There are some interesting novel new ideas, in the arena of mineral extraction. The character avatars are currently limited to two congenital twin white people with the same armor/clothing. Here's to hoping they introduce more diversity of races, both real and fantasy.\n\nYou could spend a lot of time in this game, like Minecraft, just wandering around. They have plugged in more mobs, and the crafting system is more streamlined. One of their selling points in their own copy was \"No more googling for craft recipes!\" Ok, that's cool and everything, but not exactly original.\n\nWhat needs to happen is for the developers to COMPLETELY disavow themselves of the pay for content model. They need to make an original game that works, right now, that people will flock to, or else it's just another bloated dead beta corpse in the water. When they said they wanted to charge for content and upgrades and rushed completion of contruction (they were/are going to use a pay-to-hurry-completion model similar to every exploitative MMORPG ever), that really pushed them into the margins. It was a major PR messup.\n\nI know I'm probably not the first to suggest:\n\nNPCs that are actually interesting and contribute to the environment in an original way. Vendors are the first thing people make in sandboxes. Okay, what could be more interesting? NPCs that give you missions. Okay, that's great. That would improve the game. What else? NPCs  that form relationships with the characters, that can tell stories.\n\nThe mobs are more interesting in Creativerse than in Minecraft. They have \"special moves\" which seems to promise a lot of potential. Unfortunately, they're a little stupid, although seemingly more dangerous than in Minecraft. \n\nCreate features that are interesting to explore and interact with, not just showcases of a new graphical innovation or mob. Minecraft is minecraft. You can't compete with minecraft by being Minecraft. At this current stage, I see no major innovation in this game. No story, no new angle. Fun and playable, but nothing I'd buy again if given the chance.\n", "timestamp_created": 1423653620, "timestamp_updated": 1423653620, "voted_up": false, "votes_up": 698, "votes_funny": 29, "weighted_vote_score": "0.791974723339080811", "comment_count": 16, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "22947079": {"recommendationid": "22947079", "author": {"steamid": "76561198010492196", "num_games_owned": 87, "num_reviews": 1, "playtime_forever": 2085, "playtime_last_two_weeks": 0, "last_played": 1550110817}, "language": "english", "review": "I went into this game with a firm expectation of yet another minecraft clone. And it is. But it's also a lot more. The controls are clearly largely based on that of minecrafts (not a bad thing, just an observation) but that and the blocky style is where the overlap ends. All sorts of well designed creatures, as well as an amazing art-style, makes this game an absolute beauty. I was skepticle at first, but after only five minutes I could tell I was going to like this. On another note, the crafting is very complex and fullfilling, with a blockheads-type feel to it in terms of the tiering system for each item crafted. Anybody who has seen this and had second thoughts due to the fact that it came out at the same time as all the other sandbox surivival games (some of which aren't that great), download this game with now, it's free, and you'll get hours upon hours of intriguing gameplay. Only complaints are that online has a few minor bugs, and once you've played one game the next feel slightly repetitive and tedious. Those complaints aside though, great game, very much recommended :)", "timestamp_created": 1463106640, "timestamp_updated": 1463106640, "voted_up": true, "votes_up": 29, "votes_funny": 4, "weighted_vote_score": "0.706946969032287598", "comment_count": 2, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "20487397": {"recommendationid": "20487397", "author": {"steamid": "76561198024055972", "num_games_owned": 70, "num_reviews": 3, "playtime_forever": 39847, "playtime_last_two_weeks": 0, "last_played": 1467954588}, "language": "english", "review": "So, is this game another version of Minecraft? \n\nyeah, but just wait one minute there.. \n\nI HATED minecraft, way too much micromanagement and what not. i would have passed this one by, but it kept showing up on my reccommended lists and it was free, so i figured what the hell.\n\nSo i enter the game, figure out how to use the blueprint for a very basic house. i figured i would spend 15 or 20 minutes, then delete the game and forget it forever.... alas this was just not meant to be....\n\ni gathered the materials, built the house, then started a mine and gathered more materials to expand the house... by the time i looked up...  9 hours had passed.... i was like... WTF?!?!? it was morning and i had no clue where the time had gone. \n\nso i get some sleep, my biggest frustration at this point is how the hell to make glass and i go to sleep thinking about it. \n\ni get up around noon, and think i've figured out the glass thing, so i get in to the game to test my theory, and i was right. at this point my house is good sized for a beginner, my mine is getting bigger, deeper. i'm progressing pretty good. so i go check out the store and end up using part of the 450 gold they gave me to buy a great big castle blueprint. \n\ni go about getting the supplies i need to build the thing, build it with a little help from people coming in and out of my game world, amd finally, the thing is built. i look up, its  6am........ \n\nmy biggest frustration at this point? that i'm inturrupted when i'm playing by the pain in my bladder... the upside... my bladder is getting stretched out giving me more time between bathroom breaks to play.\n\nto say this game is mildly addictive would be a gross understatement. its fun, easy to figure stuff out, and the real challange is, can you get your ideas out of your head and in to the game... i'm working on it. \n\n", "timestamp_created": 1452608150, "timestamp_updated": 1452608150, "voted_up": true, "votes_up": 117, "votes_funny": 78, "weighted_vote_score": "0.786083400249481201", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13373269": {"recommendationid": "13373269", "author": {"steamid": "76561198072017110", "num_games_owned": 350, "num_reviews": 54, "playtime_forever": 5060, "playtime_last_two_weeks": 0, "last_played": 1540599399}, "language": "english", "review": "UPDATE 9/11/2015\n\nWell it has finally happened, PlayfulCO has moved up in the world from the \"greedy, lying, misinformation\" company into the \"censorship, theocracy (where they are the Gods), and terrorist” company. What better day for them to transition than on Sept 11th? What better day? \n\nGamers everywhere, if you support this game you are not only supporting a downright evil company, you are the cause of the downfall that is video gaming. You need to pull your heads out of your butts and start opening your eyes. If you support these companies and these business practices you are the cause of the “Early Access” problems, the cause of “PTW/PTP/PTC” problems, and the cause of video game companies having the right to stifle freedom of information with censorship. You ARE the cause of gaming review companies, personalities, and publications going the way of the “sell out”, and why? Because if they don’t “sell out” they are “snuffed out”. \n\nToday, on Sept 11th, I have been permanently banned from Sell-a-verse forums. Was I given a warning? Nope. Was I talked to? Nope. And why was I banned? Here, take a look for yourself:\n\n http://steamcommunity.com/app/280790/discussions/0/517141624282545953/\n\nOh, and don’t worry. If they destroy the evidence and that link doesn’t work check out my blog, I have every screenshot needed for you to take a look at. ( http://www.tihie.com/creativerse.html ) \n\nSo what happened? Someone (Will have to censor screenshots as to not get myself in trouble with Steam) whose first language is French, had a problem. You see he bought the game because it says “solo play” in the description and bought the game in a bundle and now finds out that the game is “online only”. He asked for help and doesn’t understand why the game can’t be played offline. I post a comment (in English and then I took the time to translate it into French for him) explaining how the game is going the FTP micro transactions *(PTW/PTP/PTC) route and that is why it will always be online. I also tell him that he should have read reviews before buying said game (hoping that he would do so in the future but also because some of us take the time out of our lives to try and help other gamers, the least you could do is read it and inform yourself). He then thanked me, first for taking the time to respond, second because I translated it into French for him to easily understand, and third for answering his question. \n\nWhat happens next? Enter Fan Boi (let’s call him “Bent”) Bent, he wants to turn the thread into how the game isn’t a PTW/PTP/PTC game, basically giving the middle finger to the person with the problem, and then reports me. Within minutes I am permanently banned for helping this French person with the problem. I get a message:\n\n“You don't seem interested in having a civil discourse with our community and seem to delight in spreading misinformation about our game and business model. We think you'd be happier spending your time somewhere else. Goodbye.”\n\nPlease feel free to read my older reviews for this game on my blog, check out all of my postings in the Sell-a-verse forums, please read that thread above (if they haven’t killed it) and you tell me if I have not been civil, if I have not been doing anything but spreading simple truths. I would be happier spending my time somewhere else, and I shall. More importantly, gamers, so should you. This sort of “people in power quelling people’s voices just because they don’t like what they are saying”, THAT is the death of gaming as we know it, THAT is the death of honest game reviewers as we know it, that SHOULD be the death of early access! Who is going to give an honest review when they get censored? Who is going to give an honest review when they will never be given early copies of games and/or have to buy every single one of the games they review? When companies start censoring conversations that scare them and then only give access to those that will say what they want to say what do you have left?\n\nIn my last review (which you can find on my blog) I pointed out that a lot of the reviews had tags/titles that read “reviewed with key sent by developers”, since that time they have all removed that tag. Every, single, one of those “given free keys” (hundreds of these reviews on Steam) was “positive”. \n\nOver the course of this game I have given voice to the thousands (literally) that hate the PTW/PTC/PTP game destroying features in this game, features including but not limited to this: http://steamcommunity.com/app/280790/discussions/0/619573787463233789/\nAnd I have done so civilly and with facts. \n\n(*After posting this review PlayfulCO locked my review and deleted every-single-post I have ever made in their forums in a spectacularly guilty attempt to cover themselves and the truth*)\n\nBottom line is this, you want to buy into early access and support this game YOU are the problem with gaming. And how does Steam respond? By putting reviews that get 50%, 69%, and 70% “found helpful” in the “most helpful” section because they are all “positive” reviews when all of the negative reviews are much, much higher. Tell me this isn’t censorship? Tell me this isn’t “buying away all the negative reviews so no one ever sees them…” If you have a brain, or if you care about gaming in the slightest, do NOT support this game/company or any like it. \n\nTL;CR \nLook, you can’t read because it will fry your brain but honestly want to know what this game is about, then go to Playfulcorp.com/candycraft2 and see for yourself. Honestly don’t know how long that will continue to be up on their website before they take it down, it is a PR nightmare. \n\n*Please don't bother commenting on review to let me know that \"you ♥♥♥ need go die in whole yo!\" because I will just delete it... \n**I suppose people don't even get this far in my review before posting troll comments; as I have said, please don't bother, I honestly delete them without even reading them. You don't like something down vote and move on, if you have a reasonable question I’ll try to answer it otherwise all other comments will be deleted. Ignoring this just proves you can't even read this far before having a fan boi explosion in your pants...\n***Older reviews of this game in their completeness can be found here: http://www.tihie.com/creativerse.html\n****As of June 7th 2017, \"Bent\" is still at folks! http://steamcommunity.com/app/280790/discussions/0/1290691937721855215/?ctp=3", "timestamp_created": 1418614487, "timestamp_updated": 1496907486, "voted_up": false, "votes_up": 2589, "votes_funny": 243, "weighted_vote_score": "0.771073758602142334", "comment_count": 179, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20180831": {"recommendationid": "20180831", "author": {"steamid": "76561198143322893", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 1840, "playtime_last_two_weeks": 0, "last_played": 1550103606}, "language": "english", "review": "Me and two of my friends picked up this game to play something till new year countdown.\nWe played it for 10 hours straight. \nMissed the countdown. \nIt is 15:39 on january 1st.\nStill playing.\n\n10/10 send help...", "timestamp_created": 1451659186, "timestamp_updated": 1451659186, "voted_up": true, "votes_up": 116, "votes_funny": 365, "weighted_vote_score": "0.774324715137481689", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "48355870": {"recommendationid": "48355870", "author": {"steamid": "76561198181402210", "num_games_owned": 100, "num_reviews": 2, "playtime_forever": 12077, "playtime_last_two_weeks": 0, "last_played": 1548709054}, "language": "english", "review": "Nearly 200 hours on record at the time of this review.  Such a beautiful and fun building game.  The biggest problem and the only thing that keeps me from playing is the constant stuttering.  There is nothing more aggravating than stuttering frames and lag spikes.  I have great internet and a custom made computer that plays all of my other games on ultra settings, so I know the problem is obviously with this game.  I already upgraded to Creativerse Pro thinking it would solve it.  It hasn't.  Such a bummer.  I will leave the game untouched for months at a time and come back to see if anything has improved the lag and stuttering.  So far, nothing has been addressed.  It's disappointing and, for me, makes the game unplayable over time.  My threshold for dealing with the stuttering and lag wanes quickly, and I end up uninstalling it for large chunks of time.  As soon as there is a fix for the lag and stuttering, my review would be 10/10!", "timestamp_created": 1547599150, "timestamp_updated": 1547599150, "voted_up": false, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.735835373401641846", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 0, "developer_response": "Thank you so much for taking time to write the feedback.  We fully admit that we have had a bunch of performance issues.  I can say that since the time of this review, we have done about 4 updates to help address this.  Additionally, as the Franchise Producer, I can say that we are fully committed to addressing these, and we have all of our engineers doing nothing but performance fixes until we have the game running smoothly.  Creativerse is a LARGE game and it does take some time.  This is our number one priority.  I hope you give us another chance soon.  Thank you so much!"}, "41480329": {"recommendationid": "41480329", "author": {"steamid": "76561198376724634", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 6242, "playtime_last_two_weeks": 12, "last_played": 1550707352}, "language": "english", "review": "===[ ❤ Audience: ]===\n👍Kids\n👍Everyone\n👍Casual players\n👍Pro players \nHackers\n\n===[ ☼ Graphics: ]===\nPotato\nReally bad\nBad\nOK\n👍Good\n👍Beautiful (For the type of game)\nMasterpiece\n\n===[ $ Price/quality: ]===\nFull price\n Wait for sale\nAverage\nRefund it if you can\nDon't do it\n👍Free\n\n===[ ☣ Requirments: ]===\n90' PC\nMinimum\n👍Medium\nFast\nHigh end\nNASA computer\n\n===[ ☼ Difficulty: ]===\nYou just need 2 arms\nEz\n👍Easy to learn / Hard to master\nHard (first few hours)\nDark Souls\n\n\n===[ ۞ Game time/length ]===\nReally short ( 0 - 2 hours)\nShort ( 2 - 8 hours)\nFew hours ( 8 - 12 hours)\nLong ( 12+ hours)\n👍Endless\n\n===[ ♬ Story] ===\n☑ It doesn't have\n☐ Still better than Twilight\n☐ Average\n☐ Good\n☐ Fantastic\n\n===[ § Bugs ]===\nGame itself is one big BUG\nBugs destroying the game\nLot of bugs\n👍Few Bugs \nYou can use them for speedrun\nNothing\nthis game is fun af and if survival gets boring theres creatuve which is fun", "timestamp_created": 1523708923, "timestamp_updated": 1523734433, "voted_up": true, "votes_up": 61, "votes_funny": 19, "weighted_vote_score": "0.728551745414733887", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20560928": {"recommendationid": "20560928", "author": {"steamid": "76561198125505807", "num_games_owned": 128, "num_reviews": 6, "playtime_forever": 949, "playtime_last_two_weeks": 0, "last_played": 1520779991}, "language": "english", "review": "Great game, I highly recommend this to anyone who at any point enjoyed minecraft, which is fair to say a wide variety of people have that play video games.\nThis game is extremely fun and is obviously going to be compared to Minecraft due to the fact it is a voxel based game.\nTop marks to the developers :D\n\n[b] [u]Pros[/u] [/b]\n\n[h1]Music[/h1] To whoever made the tracks in-game I offer you a high five my friend!\n[h1]Crafting[/h1] The crafting system is very well made. For you to be able to create some items (mining cells for example) you need to create its less valuable counter-part. Which I for one really enjoyed on my first world because you don't know what you will unlock in the future\n[h1]Servers/worlds[/h1] The system in-game for the worlds in amazing in my opinion and have found it to be rather extraordinary, probably because I have not encountered this kind of thing before. Every world you/your friend creates will save and for example if your friend leaves the world he creates whilst you're both connected, you will remain in world and are still able to play-through the game as per usual. I'm not entirely sure how it works but I have found it rather handy for this feature to be in game.\n[h1]Gameplay[/h1] I personally was expecting this game to be a bit of a bum, probably because I instantly thought of the hundreds of minecraft rip-offs there are but my friend got it so we both decided to take the game \"For a spin\". Instantly we were both 'wowed' by the extensive world and great crafting system and number of new options available to us!\n[h1]Graphics[/h1] There really isn't much to say about graphics but that they are very good for a voxel based game title, I was rather shocked with the detail of shading in some places and marvelled at the fab-u-lus view from my tree base. looking over the mountains.\n\n[strike] [b] [u]-Cons[/u] [/b] [/strike]\nIn my opinion this game is amazing so I'm going to name a few improvements I think could be made.\n\n[h1]Items[/h1] I personally believe that this game should have a few more weapon choices (ranged) and extra armour/clothing too, some rare gear/items could be placed around the world with a somewhat 'mini-boss' guarding whatever the gear/items may be. Me and my friend have come up with a number of ideas such as 'Goo-Boots' which reduce fall damage/make you bounce without a block being underneath you. Items like this would be rather nice and would seperate this game from minecraft and other voxel titles even further.\n[h1]Character Customization[/h1] I positive this has been said before and I'm sure it will be said again. This game would be amazing with customised characters, I'm not asking for the 'skins' from minecraft to be put in the game but I would quite like an RPG style customization in-game, even if it was just complextion, hair, eye and voices even that would be rather nice.\n[h1]Sounds[/h1] I think it would be rather nice for your character in-game to have some voice emotes like laughing etc, this would again bring the game further away from other voxel based titles.\n[h1]Animations[/h1] Along with the voice emotes, visual emotes such as waving could be added or even combine the visual and sound emotes together for example with the laughing emote.", "timestamp_created": 1452951133, "timestamp_updated": 1452951243, "voted_up": true, "votes_up": 21, "votes_funny": 4, "weighted_vote_score": "0.727441370487213135", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "29331285": {"recommendationid": "29331285", "author": {"steamid": "76561198060355664", "num_games_owned": 334, "num_reviews": 100, "playtime_forever": 19435, "playtime_last_two_weeks": 0, "last_played": 1548150436}, "language": "english", "review": "Ok so .. i recently upgraded to Pro and i thought i should atleast write a review about the core game. This game is definately to me far better than minecraft ever was or ever will be .. its like minecraft on steroids.. I love the music though its so soothing that sometimes it makes me sleepy and doze off lol .. The graphics are nicely done and the animations feel very solid. The crafting system doesnt leave you clueless and confused but instead guides you along your way with blueprints and informational tooltips that show you what is needed to either craft or unlock items that are either locked or unlocked respectfully. \n\nThe game is 100% free to play and not a single dime is needed to be spent to unlock anything in this game. That being said you do have the option to spend real money for in-game premium currency to unlock special blocks and blueprints if you just dont feel like gathering the needed materials. There is also the Creativerse Pro DLC which unlocks a glider, flashlight, faster run speeds, longer sprint time before getting tired, more backpack space, the ability to change the way the sky looks, the ability to customize your world to your hearts content like changing all creatures to be friendly and turning off gravity for some pretty fun space walking (which makes it useful in some situations).\n\nI totally recommend getting this game and supporting the devs! These guys have done a tremendous job on this game and they push out updates very often. If your new to the building games or if your a master builder all kinds of play styles will find this game enjoyable and fun to play.\n\n", "timestamp_created": 1484719894, "timestamp_updated": 1484719894, "voted_up": true, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.657254636287689209", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "33062206": {"recommendationid": "33062206", "author": {"steamid": "76561198145958888", "num_games_owned": 12, "num_reviews": 7, "playtime_forever": 36261, "playtime_last_two_weeks": 3, "last_played": 1551557795}, "language": "english", "review": "I cannot stress enough how much I love this game. Sure, it's still a bit buggy, but obviously these bugs haven't really bothered me. None of them really make the game unplayable, the worst I have to do is exit a world and come back. Simple fix. When I first grabbed this game, I thought \"oh, a free minecraft, awesome,\" but I've found after so much time on the game that it really is different. Each layer underground is like an entirely new world to explore and each biome has its own creatures. Multiplayer is also fantastic.\nLag is occasionally a problem (especially when using the glider after purchasing pro- which I also recommend), but it doesn't make it unplayable. I have one of the most basic gaming computers and it handles the game like a dream.\nLove it so much. I'd even stretch as far to say that it's better than minecraft in many ways.\n\nEdit (8/29/2018): Since more recent updates, the game has become pretty laggy on my end. Needs some performance optimization. Further, I'd have to say that the addition of so many shop items is a little disappointing. But I still recommend the game.", "timestamp_created": 1498869717, "timestamp_updated": 1535582774, "voted_up": true, "votes_up": 60, "votes_funny": 5, "weighted_vote_score": "0.716090738773345947", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34777607": {"recommendationid": "34777607", "author": {"steamid": "76561198031048858", "num_games_owned": 108, "num_reviews": 2, "playtime_forever": 179616, "playtime_last_two_weeks": 1673, "last_played": 1551546103}, "language": "english", "review": "As a minecraft fan, I tried this game with hesitiation. Infact after a few hours, I decided it was too awkward, and stop playing for awhile, went back to Minecraft. But, then I needed a change and tried it again. Watched a few YT videos of ppl playing it, and now I am really into it. Lots of new updates and things to use for building. Starting playing on the Playfulverse server and found lots of really cool ppl doing some amazing builds. Now I am hooked. Havent been back to MC for months. :)", "timestamp_created": 1504711680, "timestamp_updated": 1504711680, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.661553859710693359", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21781928": {"recommendationid": "21781928", "author": {"steamid": "76561198010668465", "num_games_owned": 281, "num_reviews": 22, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1458357324}, "language": "english", "review": "Found it to be free to play.\n\nLogged in, made a new world.\nFound the UI to be pretty easy to use.\nCan make tons of stuff.\nIt's like a mix between Minecraft and Planet Explorers, but with Minecraft blocks.\n\nNot bad, and considering it was free, didn't seem terrible or pay to win.\n\nWorth a shot and seems pretty cool.", "timestamp_created": 1457761358, "timestamp_updated": 1458175208, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.681159436702728271", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "36920188": {"recommendationid": "36920188", "author": {"steamid": "76561198254233162", "num_games_owned": 85, "num_reviews": 50, "playtime_forever": 2078, "playtime_last_two_weeks": 0, "last_played": 1511797245}, "language": "english", "review": "At first I thought this was another rip off of minecraft.\nTurns out, its actually pretty fun. It isn't a total rip off \nCertain aspects of the game makes it different from Minecraft for example this game focuses more on exploring and makes building easier with blueprints linked to the steam workshop which is pretty awesome\netc", "timestamp_created": 1511408869, "timestamp_updated": 1511408869, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.666683554649353027", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33308733": {"recommendationid": "33308733", "author": {"steamid": "76561198117160143", "num_games_owned": 83, "num_reviews": 6, "playtime_forever": 4347, "playtime_last_two_weeks": 0, "last_played": 1532599018}, "language": "english", "review": "This game is kinda iffy, yea its a fun free minecraft clone, but its missing alot of things, like NPC you can talk to and trade with, temples, hidden structures, etc. \nAfter a while you lose the will to actually go out and explore the vast open world because there is nothing out there, theres nothing to go look for, 90% of everything you need can be found digging and 10% is getting a few things from the animals and nature. \nHopefully the developers start to add something new that you don't have to pay for or some of the stuff i said to make the game a little more interesting.", "timestamp_created": 1499340886, "timestamp_updated": 1499340886, "voted_up": true, "votes_up": 54, "votes_funny": 0, "weighted_vote_score": "0.778914391994476318", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29321495": {"recommendationid": "29321495", "author": {"steamid": "76561198018018466", "num_games_owned": 129, "num_reviews": 30, "playtime_forever": 982, "playtime_last_two_weeks": 0, "last_played": 1485033831}, "language": "english", "review": "imo, this game trades the simplicity and intuitiveness of vanilla minecraft for more extensive progression mechanics\n\nalso its free without needing like 3000 of a material for a single piece of furniture cough trove cough", "timestamp_created": 1484676951, "timestamp_updated": 1484676951, "voted_up": true, "votes_up": 29, "votes_funny": 23, "weighted_vote_score": "0.661738276481628418", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "16111420": {"recommendationid": "16111420", "author": {"steamid": "76561197979692248", "num_games_owned": 143, "num_reviews": 1, "playtime_forever": 25866, "playtime_last_two_weeks": 0, "last_played": 1546185758}, "language": "english", "review": "The game has lots of potential and we've gotten much enjoyment from it up to R16. That being said I'm glad it was a gift from a friend and Playful was kind enough to give me a few keys for my son and some friends to try the game. As the game stands right now myself, my son and the few friends that did play pretty much stopped playing. If you're looking for more of a survival game experience then you probably will enjoy the game. If you're looking for creative freedom to build and explore maybe killing a few of the world's increasing variety of creatures then that's becoming harder to do with the latest updates. Totally put off by the new elemental damage introduced to the game. Forces you to micromanage more now because you need potions to counter the effect where before you could just explore and have fun as long as you stayed a few blocks away from lava or corruption. It takes the fun out of exploring for us. You now also take damage in cold and hot zones even when inside your own home?! No thank you. If you plan on doing little exploring and stick to the level mid surface ground then you'll be fine, bored, but fine. \n\nThe whole server only play isn't always great either. On more than a few occasions I've noticed clunky lag times when playing side by side on the same world with my son. Also you can't play if the server is down for any reason, but luckily that hasn't been an issue up to this point.\n\nWater physics still need work, but are improving. There are some times you need to fight to get out of water or you may get sucked into a pocket of water that's hard to break free from. \n\nUpdate R16 was just such a disappoint after so many hours playing. We went back to Minecraft for its ability to switch between peaceful & survival modes on the fly. Also the ability to have unlimited resources to enable the building of anything as well as all the great mods. Much easier to have creative fun specially for the younger kids playing. We've also started playing lots of Terraria.\n\nI'll keep checking on the game every few updates, but I'll not be playing like I was once. Wish them well.\n\nI recommend it to survival game fans when it's released as F2P or the early access is on sale next.", "timestamp_created": 1433138374, "timestamp_updated": 1433138374, "voted_up": true, "votes_up": 63, "votes_funny": 3, "weighted_vote_score": "0.760763704776763916", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "21309720": {"recommendationid": "21309720", "author": {"steamid": "76561197972640322", "num_games_owned": 82, "num_reviews": 2, "playtime_forever": 1912, "playtime_last_two_weeks": 0, "last_played": 1470781818}, "language": "english", "review": "It's like Minecraft, but enough of a difference that makes it a game in it's own right. Has features out of the box that Minecraft doesn't, like block rotation and mobs that can be tamed into pets. A lot of nice tweaks over Minecraft, that comes with the game, no mods needed. HD graphics out of the box, no special texture packs needed, in fact it's better than HD texture packs for Minecraft. Processing machines are better than vanilla Minecraft. Can put multiple stacks in at once. Recipes are easier. You just have to have the required materials, then tell the crafting menu to make it, no more arranging items on the crafting table. In fact there is no crafting table, craft at home or on the go!\n\nWill allow modding in the future with hopefully a better system than Minecraft offers. So far the game play is fun and just makes sense. However it is pretty similar to vanilla Minecraft, not a whole lot of tech machines and items or trains/tracks/carts, has it's own unique items though. It's still in development and could offer a lot more than that in the future through the game itself or when modding is enabled.\n\nIsn't a memory hog like Minecraft, though there isn't 50 mods loaded with it. Runs smooth on max settings, 1080i", "timestamp_created": 1455849142, "timestamp_updated": 1455849142, "voted_up": true, "votes_up": 58, "votes_funny": 6, "weighted_vote_score": "0.72497248649597168", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "41646108": {"recommendationid": "41646108", "author": {"steamid": "76561197972222660", "num_games_owned": 115, "num_reviews": 12, "playtime_forever": 19603, "playtime_last_two_weeks": 65, "last_played": 1551813587}, "language": "english", "review": "The massive problem with Creativerse:  Once you reach the corruption level and craft Lumite gear, the game is over. There are no new surprises. No new reasons to explore. Minecraft has done the whole building thing, and whilst Creativerse massively improves on that with blueprints, it would have been nice if there was more. Minecrraft has villages, the end, the nether, exciting structures to find, and so, so much more. Creativerse has progressive gear (a great idea) different levels (another great idea), wiring (hmmm) and? No railways, no villages, no story mode, just crafting and exploration from that point on. It checks so many boxes, but ultimately feels hollow. You can play it a few times through - about 20-30 hours of fairly repetitious game play, then you reach the corruptiion layer and any further sense of purpose evaporates.\nSuch a wasted opportunity. The dev needs to consider how to give the game more purpose..", "timestamp_created": 1524500654, "timestamp_updated": 1524500654, "voted_up": false, "votes_up": 85, "votes_funny": 4, "weighted_vote_score": "0.736897408962249756", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24416265": {"recommendationid": "24416265", "author": {"steamid": "76561198135983290", "num_games_owned": 626, "num_reviews": 20, "playtime_forever": 1471, "playtime_last_two_weeks": 0, "last_played": 1548188252}, "language": "english", "review": "When I tried this game for the first time, I was put off by the ore mining system. After giving it a second shot and actually going further than \"my first mining experience\", I found out it's a great game and mining system isn't that bad at all. However, as any game that there is, Creativerse does have a few drawbacks. \n\n[h1] PROS\t[/h1]\n\n+ [b] building [/b]\nYou have quite many types of blocks available, more can be found throughout the world or unlocked by crafting. It allows you build realistic things and you also have furniture available, so you don't have to pretend some particular stairs and wooden sign make up a chair like you did in Minecraft, but rather craft a real good looking one. It even has many types and color of lighting, with this every room can have different feel and it's literally builder's heaven. I enjoyed my creations much more than in MC and you can actually interact with some of the objects (sitting on chairs). \n+ [b] graphics [/b]\nFinally a building game with blocks, that doesn't look straight outta 2004. Great textures, lively colors, sunlight rays, motion blur, good stability, you got it all. \n+ [b] crafting [/b]\nCrafting is based on discovery upon obtaining certain item or crafting. This means if you want to make diamond sword, you cannot just make it without having crafted all other types of swords that are before it. This could be a drawback to some, but I didn't mind it. Also you no longer have to go and search everything on the wiki, all recipes are shown, no crafting tables, yay! It also tells you where to get the item, so I'd say crafting is fun and rewarding. \n+ [b] mining[/b]\nSomething I didn't like at first, but ended up loving it. If you want to mine, you have to craft an extractor first, yet these are easy to get (you need just wood and stones) and extracting takes some time. It ranges from 1 minute (not exactly sure), but caps at 10 minutes for rarest ore. I didn't mind using it and you can craft better extractors, it adds the futuristic feel to the game and it's not bugging you, as from 1 block you can extract up to 6 ores, so actually you'll end up with more and it's not bad at all. Ores and fairly easy to find, maybe a bit too easy. \n+ [b] free servers for everyone[/b]\nIn this game you don't have to pay for a server, you can just open your own for your friends, protect it with password, etc. Also people can buy these protected chunks of land which are really huge and they cost just a few coals. Prevents griefing a lot so in this aspect it's awesome, easy to play with a friend and secure. \n+ [b] taming and pet system [/b]\nYou can tame any pet in this game, then you should (but you don't have to, it's immortal) feed the pet, wash it for it to give you gifts (useful items). Entire process of taming is a bit tedious, as you just ring the bell in front of the pet and there could be some sort of minigame with multiple difficulties, to make it more interesting, Also, monsters sometimes bug out and they don't attack you, so makes taming easier. \n+ [b] dying system [/b]\nI actually called it dying system, ha. When you die, this game is not as punishing as minecraft. It marks place of your death on your compass and you got plenty of time to get in there and obtain all your items. Also, you got this mini device and wherever you put it, you're able to teleport to it anytime, so moving out of caves isn't digging up and praying to lava gods or getting lost trying to get out then ending up with option #1. \n+ [b] explosives! [/b]\nIn this game you got many options how to f**k s**t up and it's not just TNT. \n+ [b] mining/collecting animation [/b]\nIn this game you say goodbye to axes, shovels and pickaxes, for all of these there's this cool futuristic glove that kind of sucks in the blocks to your inventory, it's extremely satisfying and fast. \n+ [b] funny and original item descriptions [/b]\nI really like to read stuff and based on certain item descriptions or game telling you stuff, the devs seem like funny people and I'd definitely love to see quests in this style as well. \n\n[h1] NEUTRALS [/h1]\n\n= [b] gardening/cooking [/b]\nThis is what you'd see in Minecraft, exactly the same farming formula and same with cooking, except not many meals can be cooked and you'd find feeding them to your pets more than to yourself. Currently there's no reason to eat food, as you don't have hunger bar, only hp bar and meals only extend it, they don't fill it up. To get full health you'll just suicide or get hit by mobs till you die so your hp resets. \n= [b] character customization [/b]\nI put it as neutral, because you won't ever be looking at your character, but if you're a person like me, you'll appreciate it. In this game you unfortunately only change your gender and colors of pre-made outfit. It's not a big deal, but it's something.\n\n[h1] CONS \t[/h1]\n\n- [b] variety of mobs [/b]\nBy the time you'll be a few hours in game and not having spent lots of time with building, chances are, you've already seen all the enemies and  killed them. There are 2-4 (or so) types of enemies per biome and also a few types of night monsters, but if you live in certain biome, it'll get boring rather quick with the variety. But I do believe later on new will be added, as this is still early access game. \n - [b] not enough of things to do  [/b]\nI didn't get to this point yet, but I've got just 17 hours in game (of maybe which 15 is the actually gameplay) and I've already killed all types of mobs and mined the rarest kind of ore and I have loads of it. At this point, only thing I can think of doing is maybe a [strike] diamond toilet [/strike] pet collecting or more building, but you do get the point. \n - [b] combat  [/b]\nNot the most impressive thing you will see. You got a bit clumsy sword swinging and that's about it. It's pretty chaotic and you got no skills, I wish they added bows or guns.\n - [b] water physics [/b]\nIn short, if you want to have more than 1 block deep pool, you'll be pulling your hair trying to fill it up with water. \n - [b] few minor bugs [/b]\nFor example after you teleport you can see underground and it won't go away, also when you randomly walk sometimes you can see all the underground caves, but don't take this in account, as it's just early access game. \n\n[h1] Conclusion\t[/h1]\n\nCreativerse is one of the the better block building survival games and let's not call it Minecraft clone, as everything in gaming industry could be called a clone with this logic. I think if the devs put more work in variety of content, the game will truly shine, but in its current state it's already solid 7.5/10, that I'll definitely put more of my time into. I'd definitely recommend this game. LPT - get a friend to play with, boosts the fun factor by a lot!", "timestamp_created": 1468969175, "timestamp_updated": 1468970576, "voted_up": true, "votes_up": 64, "votes_funny": 6, "weighted_vote_score": "0.788451671600341797", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26544301": {"recommendationid": "26544301", "author": {"steamid": "76561198065835247", "num_games_owned": 97, "num_reviews": 1, "playtime_forever": 50039, "playtime_last_two_weeks": 0, "last_played": 1550276153}, "language": "english", "review": "First things first, this is my highest recommended game in my library. \n\nIf you enjoy sandbox crafting type games especially voxel based ones, this game is incredible.\n\nI have put in hundreds of hours and have met and played with tons and tons of other players jumping around different community worlds and creating several of my own, built worlds with themes, giant castles, small homes, crazy farms, petting zoos, world trees, villages, temples, the list goes on and on. The multiplayer aspect of this game is amazing and the community is truly great I have met so many awesome people on this game and I honestly couldn't have asked for a much better experience.\n\nThe game has awesome mechanics like the option to rotate blocks or the use of slabs, stairs, or tables to hide your lights, now with the awesome things people are making with machines and the fact that they are still adding to the game giving you so many possibilities. \n\nThe real heavy hitter in my recommendation though is the developement team. I have never in my life experienced such a responsive team that quickly implements what people ask for or fixes bugs and will sit there and go back and forth on subjects with you to get the fix you need to enjoy their content. Even better is if you have done something amazing and want to show off you can submit screen shots and they might mention your works or even come build on your world! The player developer interaction I think is important it helps both sides connect with each other and bring more enjoyment to the players game experience and the developers work experience. People ask for more slabs, stairs, and roofs, devs drop multiple new packs, players ask for machines with pressure plates and switches, we get much more than we asked for. Players are still asking for more and we are still getting more! For an early access game, this is the most complete, most enjoyable, and most exciting experience you could ask for. I have supported this game by purchasing extra cool shop texture packs, pro edition, and will probably continue to fund the game by purchasing whatever else they release because I know contributing adds to their susstainability and growth and from a game with this much in early access I can't imagine what it will look like a year from now. \n\n\nIf you can handle communicating your issues to developers and talking over forums, and if you like sandbox builders this game offers a unique and enjoyable style to the genre like nothing i've played before.", "timestamp_created": 1478896985, "timestamp_updated": 1478896985, "voted_up": true, "votes_up": 34, "votes_funny": 0, "weighted_vote_score": "0.742953121662139893", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34116163": {"recommendationid": "34116163", "author": {"steamid": "76561198171904534", "num_games_owned": 2447, "num_reviews": 97, "playtime_forever": 12357, "playtime_last_two_weeks": 0, "last_played": 1547050972}, "language": "english", "review": "The perfect mix of beauty to the craft system. \nLooks like Creativerse seen the previous games errors and managed to become \nThe Best of this genre.\n\nAn exploration sandbox open world game, rich in detail where you can run, jump,\nfight and create items for your own survival. If you have the PRO version, you also have a\nportable flashlight (L) and Glider (G), a device attached to your back that gives you the possibility to raise flight and to glide, useful for exploration of new areas and to avoid deaths by fall.\n\nCreativerse has an open world full of biomes, each with its own flora, fauna and resources. \nAmong them are Woodlands, Forest, Mountains, Canyons, Savannah, etc ... It was in Savannah \nthat I made my first \"kingdom\" project, [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1097700714]Pxl's Reign[/url], there you will find the Parchwoods,\ngolden colored trees with huge tops, big enough for you to build a base on them. \nThe game also has the underground biomes, which are fundamental for collecting mineral ores  for the evolution in the craft system. Example: Fossil Layer, Lava Layer, Corruption Layer.\n\nThe game doesn't have an explicit plot, you need to collect parts of the story by finding the\nJournals, are small reports written on pages, and Data Chips. They can be found in treasure chests. \n\nI wrote what I gather of information till now:\n[i]\"A man, probably a scientist, seems to have fallen on the planet Creativerse. He found the Arctek technology  on this planet, it uses Arcstones as a source. In the face of loneliness, this man developed PIXI,  an AI with childlike and feminine touch. PIXI researched and reported a lot of information In Data Chips. It seems that this scientist has used Arctek technology to create a \"pulling\" mechanism, with the objective of pulling people to this planet.\"[/i]\n\n[b]10/10[/b] - For me, the strength of games of this genre is the creative freedom. Creativerse isn't different. It allows you to create a huge variety of decorative items, specific to construction. Check out how is my \"kingdom\" at this moment: [url=http://steamcommunity.com/id/blancamuniz/screenshots/?appid=280790&sort=newestfirst&browsefilter=myfiles&view=grid]Printscreens[/url]. It has great gameplay and free servers to play with your friends. It's worth it.", "timestamp_created": 1502244866, "timestamp_updated": 1547094924, "voted_up": true, "votes_up": 33, "votes_funny": 3, "weighted_vote_score": "0.668694555759429932", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23846446": {"recommendationid": "23846446", "author": {"steamid": "76561198076363877", "num_games_owned": 233, "num_reviews": 98, "playtime_forever": 1351, "playtime_last_two_weeks": 0, "last_played": 1536913021}, "language": "english", "review": "I believed the game was not free to play, yes? (correct me if im wrong) I put the game on my wishlist, maybe it didnt come out when I was browsing the game. But now, I SHOULD HAVE MET THIS GAME SOONER! This game has lots of features that minecraft vanilla could not cover: claiming area (protection against raider), free and all to use teleportation, no need to eat, no need to farm, just build whatever your dreamland is, suit up, and be creative.\n\nIf you like Minecraft, but dont wanna buy server, code stuff, put command blocks here, plugin here and there, do lots of reading, then you better try this awesome game. Graphics and game crafting similar to Minecraft, you'll adapt quickly!\n\nAlso the main feature: FREE SERVER (24/7) FOR ANYONE! You can make your own server, that anyone you want can join (with or without password). The server stays up even the creator left. So players can always come in and go anytime they want. No need to host/buy a freaking server, you can do it FOR FREE. NO COST AT ALL. (unlike minecraft where you have to pay a service in order to do it). I've tried dedicated server myself (only using pc to standby) and it's kinda pain in the ass for casual minecraft player like me. I cant keep my pc on 24/7.\n\n80/100 i recommend this game.\n\nReccommendation for Devs:\n\nMake more of cosmetics for players and make it cheaper. Example: with 1 USD you can buy a wide range of clothes, hats, masks, pet item, etc. Currently the price is around 5 USD for some amount of coins, its not worth it for some of us :)\n\nSimpler crafting recipes! I do not like at all that you need to upgrade to Obsidian Cell, Iron, etc just to collect higher tier of resources. I need to start from bottom again if I lose my stronger power cell.\n\nThanks. I love this game. Goodluck!", "timestamp_created": 1466986790, "timestamp_updated": 1469077932, "voted_up": true, "votes_up": 33, "votes_funny": 7, "weighted_vote_score": "0.687481880187988281", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "20382727": {"recommendationid": "20382727", "author": {"steamid": "76561198033876350", "num_games_owned": 1050, "num_reviews": 8, "playtime_forever": 1749, "playtime_last_two_weeks": 0, "last_played": 1500666624}, "language": "english", "review": "[h1]May The Creativity Be With You![/h1]\n\n[b]Overall: 68% (176.8 / 260)[/b]\n\n[code]\n---------- [b]Aesthetics[/b] ----------\nAtmosphere    8.0/10\nGraphics      13.0/20\nInterface     4.0/10\nLevel Design  7.0/10\n-------------  64% (32.0 / 50)\n\n---------- [b]Audio[/b] ----------\nSound Effects 10.0/20\nMusic         14.0/20\n-------------  60% (24.0/ 40)\n\n---------- [b]Functionality[/b] ----------\nNetworking        6.0/10\nPerformance       8.5/10\nStability         6.0/10\n-------------  68% (20.5 / 30)\n\n---------- [b]Gameplay[/b] ----------\nBalance       8.5/10\nControls      7.0/10\nMechanics     10.8/15\nRewards       7.0/10\nTutorial      0.0/5\nVariety       8.5/10\n-------------  70% (41.8 / 60)\n\n---------- [b]Multiplayer[/b] ----------\nBalance     8.5/10\nMotivation  9.0/10\n-------------  88% (17.5 / 20)\n\n---------- [b]Technics[/b] ----------\nAI            5.0/10\nPhysics       5.0/10\nGeneration    7.5/10\n-------------  59% (17.5 / 30)\n\n---------- [b]Writing[/b] ----------\nCorrectness   4.5/5\nDiction       3.0/5\n-------------  75% (7.5 / 10)\n\n---------- [b]Others[/b] ----------\nCost-Benefit Ratio  5.0/5\nReplay Value  9.0/10\nSystem Requirements 2.0/5\n-------------------  80% (16.0 / 20)\n[/code]\n\n\nWant to read more reviews like this? Follow us on Steam!\n[url]http://steamcommunity.com/groups/ScoreCritic#curation[/url]\n\nYou can find more reviews like this on our website.\n[url]wwww.scorecritic.com[/url]", "timestamp_created": 1452199266, "timestamp_updated": 1529206909, "voted_up": true, "votes_up": 248, "votes_funny": 37, "weighted_vote_score": "0.728849649429321289", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39862891": {"recommendationid": "39862891", "author": {"steamid": "76561198089567363", "num_games_owned": 230, "num_reviews": 115, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1535237199}, "language": "english", "review": "With a very Minecraft feel to it Creativerse adds its own unique spin on the voxel open world genera.\n\nA large 3D world full of different biomes, creatures and resources to craft and build, either alone or with friends on a private/public server. Find lots of buildings and custom made scenarios on the workshop.", "timestamp_created": 1517825085, "timestamp_updated": 1517825085, "voted_up": true, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.667329967021942139", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42590427": {"recommendationid": "42590427", "author": {"steamid": "76561198185687818", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 1856, "playtime_last_two_weeks": 0, "last_played": 1528506737}, "language": "english", "review": "Subtracting from content previously available for free is the wrong decision. Locking content behind a pay wall when it should be free is not okay. This game has crashed, for those older players who've returned. It's lost it all for non-pro players. Some people just don't want to play with others, or only with friends - accessing other people's servers to play with friends isn't the solution to the previous way - who they trust.", "timestamp_created": 1528508217, "timestamp_updated": 1528508217, "voted_up": false, "votes_up": 44, "votes_funny": 6, "weighted_vote_score": "0.733989179134368896", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12564827": {"recommendationid": "12564827", "author": {"steamid": "76561197972632347", "num_games_owned": 179, "num_reviews": 44, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1413710290}, "language": "english", "review": "Game looks pretty, plays smooth. Thats about as far as they got with it.\n\nInterface is half-built. Can't even see the keybinds in-game, and the keybind menu out of game is utterly irrelivent and makes absolutely no sense.\nNo control for the field of view, which is supidly narrow considering how close the mobs are to you when attacking you.\nCan't group with friends, or disable friendly fire.\nThe night time mobs are insanely overpowered. Killing the player in 3 hits.\nGame is not ready to be played or even tested. They actually have to build some mechanics.\nThey don't even have a female body model.\n\nI got the impression the devs came up with the idea \"What if we made minecraft with smooth gameplay and graphics?\" So they made the core mechanics and it worked. Then they lost interest.\n\nThis is just another Minecraft wannabe vaporware project.\nMove along.", "timestamp_created": 1413710724, "timestamp_updated": 1413710973, "voted_up": false, "votes_up": 729, "votes_funny": 20, "weighted_vote_score": "0.739807426929473877", "comment_count": 34, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31682247": {"recommendationid": "31682247", "author": {"steamid": "76561198123396383", "num_games_owned": 98, "num_reviews": 10, "playtime_forever": 8527, "playtime_last_two_weeks": 0, "last_played": 1541539853}, "language": "english", "review": "I have played many types of games and started out with minecraft a long time ago. This is simular but MUCH more as you get to take some of the better of the MMO simularities that i have played with like developing your toon, and have better graphics and change worlds. The crafitng system is a bit different to get used to at first but its easy enough to learn. One thing i like is that you have to survive as like in other games, but collect everything and as you do when getting new objects, you get more experince and more things opens up for you. Its a fairly decent thoughtout game and the concept is pretty good.\nFor one of the Cons when you die, it automatically puts you back to where you where when the last save was done in the game no matter where that was or how long ago that was. So you have to go through the whole map back to where you where before and i havent found a way yet to save it while in game so that doenst happen? Anyways, its a decent game and you can play alone or with others and when you buy pro it allows you to have your won world so that others can come into your world and play with you from the web. Just one of the perks i guess. I know i have only spent a few hours in the game but for a free game, its well worth it and i know i will spend a lot of hours playing and exploring, collecting, building and killing monsters while having fun doing it all.", "timestamp_created": 1494506519, "timestamp_updated": 1494506519, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.606009721755981445", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44364668": {"recommendationid": "44364668", "author": {"steamid": "76561198183270926", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 35673, "playtime_last_two_weeks": 944, "last_played": 1551680529}, "language": "english", "review": "It's amusing to see so many conflicting reviews of this game. Personally I have never had an issue beyond the occasional lack of performance when running on an older machine. And as for comparing it to Minecraft.. what's the point in that? After over 500 hours I still enjoy the look, sound, and feel of the game. It has interesting creatures, simply designed mechanics, and a look that is aesthetically pleasing. With each update I have, like others, found something I didn't care for at the time. Such as changing creature and character model designs (Warmworm's original look was much cooler). But overall I've been pleased with my purchase. This latest update (August, 2018) has introduced yet another new player model that took me a couple of days to appreciate. I was sad to see my character go, but have enjoyed the new models slightly more realistic look. Being able to interchange the costumes is a neat feature as well, though I would like to be able to see my armour again. Perhaps in a future update? I also enjoy the battle mechanics in third person. Still some bugs to work out (character model thumb has a freaky curve..maybe its just me) but you're heading in the right direction.\nIt's been a good ride. Looking forward to future updates, new creatures, costumes, weapons and such.", "timestamp_created": 1535183967, "timestamp_updated": 1535183967, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.724446773529052734", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34982376": {"recommendationid": "34982376", "author": {"steamid": "76561198257022389", "num_games_owned": 43, "num_reviews": 2, "playtime_forever": 92258, "playtime_last_two_weeks": 791, "last_played": 1551750942}, "language": "english", "review": "☆☆☆☆☆\n\nThis is my favorite game of all time!\nOver the last year or so I have seen this game grow and develop so much! The developers really listen to thier players and release some amazing new content nearly every month. \n\nThere are a couple bugs here and there but over all this is a beautiful game. \n\nWhat I love the most is that there is something for everyone. Some people love to build and some love to explore and some love to just visit a bunch of worlds. \n\nThe newest update with Blueprints and the Workshop allows you to carry your favorite builds with you into another world, LIke that Cabin you have been working on for so long.", "timestamp_created": 1505513539, "timestamp_updated": 1505513539, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.656130313873291016", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31985572": {"recommendationid": "31985572", "author": {"steamid": "76561197974281429", "num_games_owned": 521, "num_reviews": 76, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1495847214}, "language": "english", "review": "I like the IDEA of Creativerse, because the first mod anyone usually installs for Minecraft is a good graphical texture facelift, but I can't recommend the game in good conscience.  I've played about an hour or two to get a feel for how the crafting operates.  On about every screen is something announcing I should upgrade to \"Pro\" and it seems half the recipes and blueprints are locked behind paywalls.  If you're stuck on a console and don't mind buying mod packs from Xbox Live or whatever then this game won't bother you, but this IS a Steam review, for PC.  Going from Minecraft which is a one time pay for life to this where most of the content is gated doesn't sit well with me.  As for MC clones it's visually better than 9/10 of the other ones you see, but the cash grab phone app nickel and dime business model is one I personally avoid like the plague.", "timestamp_created": 1495847491, "timestamp_updated": 1495847491, "voted_up": false, "votes_up": 283, "votes_funny": 18, "weighted_vote_score": "0.76691967248916626", "comment_count": 26, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21760769": {"recommendationid": "21760769", "author": {"steamid": "76561198060039111", "num_games_owned": 67, "num_reviews": 9, "playtime_forever": 2252, "playtime_last_two_weeks": 0, "last_played": 1471804255}, "language": "english", "review": "8/10 Needs more content but the already existing content is superb. Minecraft on steroids, but not as much items as it should have. Villages and more weapons are needed. Hammer, spear, javelin, other projectiles besides bombs.", "timestamp_created": 1457678622, "timestamp_updated": 1457678622, "voted_up": true, "votes_up": 20, "votes_funny": 4, "weighted_vote_score": "0.680442988872528076", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35720656": {"recommendationid": "35720656", "author": {"steamid": "76561198193388617", "num_games_owned": 142, "num_reviews": 10, "playtime_forever": 111605, "playtime_last_two_weeks": 5, "last_played": 1551244874}, "language": "english", "review": "after 1500+ hours and a own server (Missing Kings) i thought a little sweet comment would be cool.\n\nI started this game and played it in my own world till ive learned anything.\n\nafter 2 weeks ive decided to make it a public world and had till today over 12k ppl visiting our world.\n\nive won the best friends in this game im still with them a family in our discord.\n\nwe had a real great time in this game and we sure will always return to it <3 !\n\n1mio time better then minecraft !!!\n\nrecommended for sure !!!\n\nits one of the games i will always play till i die lol", "timestamp_created": 1507993102, "timestamp_updated": 1511711538, "voted_up": true, "votes_up": 28, "votes_funny": 5, "weighted_vote_score": "0.647785961627960205", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12786214": {"recommendationid": "12786214", "author": {"steamid": "76561198079658001", "num_games_owned": 406, "num_reviews": 17, "playtime_forever": 690, "playtime_last_two_weeks": 0, "last_played": 1466018414}, "language": "english", "review": "I really can't say what i should think about the game yet.... seems like minecraft in pretty graphics... with less possibilitys.... unique? naaah.... ingame shop .... oh come on guys! the game is 20 euro in alpha and even if its free to play after release, we all paid to explore and test everything in the game and a ingame shop while testing a game makes it not trustable to me.... that is very rude! and i don't see what it makes it really diffrent from other block crafting games...  at the moment i would say i cannot recommend it... sorry!!!", "timestamp_created": 1415107427, "timestamp_updated": 1429484162, "voted_up": false, "votes_up": 507, "votes_funny": 13, "weighted_vote_score": "0.678538262844085693", "comment_count": 37, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23339196": {"recommendationid": "23339196", "author": {"steamid": "76561198128010895", "num_games_owned": 43, "num_reviews": 10, "playtime_forever": 775, "playtime_last_two_weeks": 0, "last_played": 1535864823}, "language": "english", "review": "This game wasn't that great before- To be honest, it actually seemed like a rip off of Minecraft. Yes, a good one, with great visuals, easy multiplayer, and a few mechanics not found in Minecraft. But recently it's somewhat blended Terraria and Minecraft together, with the luxury of Minecraft's 3D, easy multiplayer, and stuff, with Terraria style character customization and greater amount of content over Minecraft. Yes, it doesn't have as much content as Terraria, and never will, to be honest. But now it's blended the 2 most popular sandboxes, along with content not found in either, such as a tutorial. Well done. If it's to be called a rip off byb ANYONE, it's a very, very good one.\nBasically, it combines Minecraft's style of gameplay with Terraria's progression in equipment, and where you go. You might not be going far without decent equipment...\n\n...And now is when it hits the shitter.\n\nCreativerse Pro- A Builders club style subscription service allowing for Flashlights, Gliders, and various exclusive blocks. \n\nY'see, with F2P games there is ALWAYS a catch, whether it be excessve ads, or what you're probably used to, Micro-transactions. I quite literally knew that the game would come to this someday, as a F2p game. I literally knew it. Yes, you can argue that those features aren't necessary, but there's something about a free indie game going into the We-Do-Want-Money category, just like Roblox. Atleast this isn't as bad as the removal of tix, but it just rubs me the wrong way. \n\nDespite that, i can't not give this game a reccomendation. It's still a great game to play with friends, so go do that.", "timestamp_created": 1464846742, "timestamp_updated": 1470479536, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.66547161340713501", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "30102421": {"recommendationid": "30102421", "author": {"steamid": "76561198137112749", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 64099, "playtime_last_two_weeks": 0, "last_played": 1515043746}, "language": "english", "review": "I have played two other sandbox building games like this before, one of course is MINECRAFT (PE version) and the other is TROVE on steam. I have also been eyeing on \"PORTAL KNIGHTS\" which I can't afford, so obviously I went for this F2P game.\n\nIn my first 5 hours of solo gaming with this game, I can say that it's a bit of a Minecraft clone but waaaaaay different. I also immediantly liked the gameplay on this better than Trove which I got bored of real quick. Let me give some Pros and Cons of this game.\n\nPROS:\n+ Very large and open world\n+ Minecraft-ish. If you enjoy games like Minecraft you'd definitely find this a whole lot better.\n+ The F2P content is very sufficient enough to fully enjoy the game.\n+ No cheats as far as I know. Makes the game more challenging.\n+ No creative mode, meaning more sense of achievement each time you build something.\n+ You can own regions of lands.\n+ Blueprint system makes it easier to build things.\n+ Good overall gameplay and crafting system with diverse mobs.\n+ Lots of potential if updated properly.\n\nCONS:\n- Glitchy.\n- Unpopular game, which is kinda sad.\n- Low population. Most Public worlds' population is only about 2-5 people a world.\n- Gets progressively boring unless they add more stuff to do in the game. You will eventually run of things to do.\n- Although has a lot of potential, I still feel like the game is lacking.\n\nIf the developers would be bold enough to copy a bit more gameplay from games like Trove or Portal Knights, this game would rock! I feel like it needs a little it of RPG element :D", "timestamp_created": 1487780998, "timestamp_updated": 1492055261, "voted_up": true, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.72752082347869873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28323765": {"recommendationid": "28323765", "author": {"steamid": "76561198130735961", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 4003, "playtime_last_two_weeks": 0, "last_played": 1510431556}, "language": "english", "review": "Downloaded it yesterday  (12/12/16), started playing with a friend who I used to play Minecraft with. Beautiful graphics,  nice crafting options and didnt get boring over 7 hours of exploring and building a bigger house next to my friends cottage. If you liked Minecraft, I can highly recommend this  game, if you dont like voxel-based Sandbox games, why are you even here?\n\nAnd  by the way, it is definitely not pay to  play  resp.  pay to win. If you dont buy the  pro-version you dont have a flashlight,   but you can build torches, and the glider is for the  same people  that   ride those little carts in Wallmart instead of walking. \n\nRegarding the fact that you have only 1 world in the free version, well, I am totally fine with that as I am just playing with           a friend, so I dont mind.\n\nBest regards,", "timestamp_created": 1481532579, "timestamp_updated": 1481532579, "voted_up": true, "votes_up": 35, "votes_funny": 8, "weighted_vote_score": "0.703645586967468262", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "41007372": {"recommendationid": "41007372", "author": {"steamid": "76561198047820016", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1521960032}, "language": "english", "review": "The art in this is incredibly adorable. The Textures on the blocks are fantastic, and the fanciful creatures are amazing. \n\nThree things I don't like, and I'll share those. Note: I don't hold any hate in my heart for this game. It's well-executed, it's just that the cons outweighed the pros for me. My qualms are easy to pinpoint, since Creativerse is pretty much built off the pre-existing platform of the Minecraft saga, and as such, is directly comparable in most aspects:\n\n1--No 'Creative Mode.'\nI really wanted to just play in the sandbox first, get my feet wet, visit the biomes and navigate block apparance. I'm mostly interested in building the tiny temples, and designing the cozy cottages...and this game is solely a 'Surivial mode' concept. Makes it a bit of drag for those of us who don't have the time to dig up all the materials required to make our imaginations a reality. \n\n2--Say Goodbye to Easy Mining.\nYou get this nifty gauntlet upon game entry, and with occasional upgrades, you can move more/better stuff. It's a swiss army tool for building the world, however, it's not well engineered as a tool past that. This swiss army knife doesn't mine the world's ore AT ALL. In order to mine: you have to build somewhat expensive 'extractors' and apply those directly to EACH ore-node. You build swords for whacking enemies, bells for training creatures, but for some reason, there's no multi-use method (like, oh, say, a pickaxe) for mining. Pretty much all the ore you find, you turn back into extractors in order to mine more stuff. \nCatch-22, anybody?\nMakes it miserable to piece together anything that's not wooden or green-organic matter.\nConsider that your head's up. It's just weird.\n\n3--'Optional Purchasable Concent in-Game.'\nWant to be able to build stuff? You're going to need recipes for that. \nTo my knowlege, thusfar--attaining those badboys can be incredibly difficult. And when you do find them, you can't use them until you unlock a buttload of other stuff. So they pretty much sit in a chest and make jeering noises at your back for most of play.\nOf course if you want access to all the really cool stuff: you have to pay upwards of 15 dollars a pop for various block styles, (which I don't get at all, if it's an integrated part of the game, shouldn't it be a part of the initial game purchase?...ugh. Micro-pay systems are the devil.)\n\nThe reason it's a thumbs down, and the only reason it's a thumbs down, is because the reasons above would make me NOT recommend this game--which is why we write reviews; to share those reasons.\n\nIt's prettily created, the art is worth the look, but in my opinion: the playstyle is not, and the content is just too expensive to get into for a game that similar in concept to another heavy-hitter on the market.", "timestamp_created": 1521863964, "timestamp_updated": 1529285044, "voted_up": false, "votes_up": 100, "votes_funny": 9, "weighted_vote_score": "0.720483839511871338", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31660001": {"recommendationid": "31660001", "author": {"steamid": "76561197970651248", "num_games_owned": 67, "num_reviews": 5, "playtime_forever": 5745, "playtime_last_two_weeks": 0, "last_played": 1550315163}, "language": "english", "review": "Got this last year while in Early Access, tried it for a bit in Free Mode enjoyed it to the point I bought the Pro Upgrade.. A very good game and very enjoyable, be good to have a HQ graphics option for all the textures and some other options but in all a fun way to while away the hours.. :)", "timestamp_created": 1494396276, "timestamp_updated": 1494396486, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.502418458461761475", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33378922": {"recommendationid": "33378922", "author": {"steamid": "76561198214583372", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 157193, "playtime_last_two_weeks": 7795, "last_played": 1551865390}, "language": "english", "review": "Good Day Creativerse Fans,\nFirst off I would like to say how much I enjoy this game. I have never played a building game before let alone a block building game. I came into this game totally a noob.  There is SO much you are able to do with this game from just playing, to building, site seeing, PVP or not, adventures, Solow or co-op. This list can go on and on. You can build more things than you can even imagine.  Each world has some amazing places to see. The company of this game is awesome.  Playful in every part is a company you can standby. They are always helpful, fun and entertaining. There are updates to this game almost every month. And not just patches to fix bugs. I mean real updates with new game items and features. Yes, there is some DLC and store packs and Items. However, what game doesn't have them these days. The best part about the DLC or the store items is you do not have to buy them to play the game what so ever. They are just really cool extras. Plus Playful is always generous with free stuff. From free store items, item packs, blocks, and even coins. Need help or want to give feedback. The support team is right there. Think something should be added or changed? BAM the developers are on it. And don't get me started with the community. From Youtube, Twitch, Forms, Groups, FB and Twitter you will always find wonderful people to help, play with or just have a nice chat.\nhands down a wonderful game and company.\n\nCatSmiles\nHappy Gaming", "timestamp_created": 1499531040, "timestamp_updated": 1499531040, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.539791703224182129", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40276556": {"recommendationid": "40276556", "author": {"steamid": "76561198285209190", "num_games_owned": 123, "num_reviews": 2, "playtime_forever": 21302, "playtime_last_two_weeks": 0, "last_played": 1549818930}, "language": "english", "review": "So after 350 hrs I finally take my time to review this game. \nSo here we go...\nAs far as I think about it, the game doesn't really have a story and does rather focus on the \"build and explore\" part, which is fine in my opinion. It's a fun crafting game if you have someone to play with, alone it's alright, but not the greatest of all games. For the small price of free you get your own world and a bunch of entirely different blocks, as well as a ingame shop (that sadly uses coins bought with real money)  to further expand your collection of blocks, giving you the possibility to add a costum to your character or sword or  to buy useful items. \nCreativerse had multiple updates since I started playing and I enjoyed most of them. Yet, there are still things to fix. For some reasons it's possible to get hit by a enemy and your character gets pushed into the sky or maybe even into the sky through a layer of dirt and stone blocks. \nI feel like creativerse wouldn't suffer from adding stronger and rare enemies, that drop special items or maybe even some boss fights to get some focus on the fighting part. In my opinion a \"creative mode\" wouldn't hurt. Offline support would be great too. \nI hope one day it'll be supporting mods. \nSo if you're looking for a game that will keep you busy for a bit, check it out.", "timestamp_created": 1519221262, "timestamp_updated": 1541192388, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.632011115550994873", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36329303": {"recommendationid": "36329303", "author": {"steamid": "76561198275745866", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 14153, "playtime_last_two_weeks": 0, "last_played": 1545518553}, "language": "english", "review": "I love this game. It is like Minecraft but free.It requires creativity and you can join public servers and get ideas and now it has a workshop so if you like someones idea you dont have to try to guess you just get the blueprint and start building. I aslo love this game becuase its not a game where you have to pay for stuff they give you some free blueprints and blocks you can claim and no one can build in your area unless you let them in claim settings.The worlds are so big and you just cant explore the whole world unless you have a years worth of time on your hands. The world is compleatly Destructible Meaning you can destroy the whole thing its awsome. There are hundreads or creafting recepies its just Insane.\n\n\nThere's the game in a nut shell", "timestamp_created": 1509999838, "timestamp_updated": 1509999838, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.648423075675964355", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22946606": {"recommendationid": "22946606", "author": {"steamid": "76561198263301302", "num_games_owned": 150, "num_reviews": 2, "playtime_forever": 4833, "playtime_last_two_weeks": 0, "last_played": 1513399804}, "language": "english", "review": "It's a fun Minecraft clone, what was supposed to be a quick hour or two look turned into 12 hrs. It's a very forgiving game also, death most of your items goes into a tomestone pot. Also has a built in compase with markers. Very addicting to play with others. Taming the wild life gets a bit boring when after it's tamed. All the creature does is follow/wander/stay. Feeding it, the pet will give you an item to harvest from it. Would be interesting if some could be tankers or support fighters.", "timestamp_created": 1463103924, "timestamp_updated": 1463103924, "voted_up": true, "votes_up": 23, "votes_funny": 4, "weighted_vote_score": "0.698394954204559326", "comment_count": 3, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "15581362": {"recommendationid": "15581362", "author": {"steamid": "76561198010734079", "num_games_owned": 191, "num_reviews": 32, "playtime_forever": 11559, "playtime_last_two_weeks": 0, "last_played": 1535490802}, "language": "english", "review": "      Gotta say, upon first looking through the reviews, I WAS NOT going to pay for this sucker right now. There was a decent spread between positive and negative, but most of the positives were pretty non-specific (\" Oh boy! What an AWESOME game, blah blah blah\")  while most of the negatives were QUITE specific and QUITE negative. A lot of talk about it basically being \"pay to ACTUALLY play\", terrible people online, no dev support, no single player (despite it being a listed feature), etcetera etcetera.\n\n           Now maybe I shouldn't say TOO much, considering I've only played single player thus far (yes, it DOES exist), but I actually like the game a lot. I haven't encountered any of the negative stuff I read about and it's actually pretty darn good. The crafting feels a lot more intuitive and straight-forward than minecraft, plus you actually get RECIPES to work from (novel concept, right?), the graphics are a touch cartoony, but great looking nonetheless, and the way things like crafting machines and some textures look lend an almost steampunk-y/ torchlight-y feeling, which I really dig. Also, there is ONE thing you need to craft for ALL your mining/digging/chopping needs! Not a shovel...AND a pickaxe... AAAANND an axe AAAAAANND a hoe.... AAAAAAAANNNNDD shears.... aaanndd you get the idea.\n\n          I have encountered a few goofy bugs, which, as annoying as they may be at times, are TO BE EXPECTED in an alpha. I haven't come across anything that either stopped gameplay or was a personal deal-breaker yet though. I also can't really give input on dev. involvement since I haven't had reason to try to reach them (yet, I'll remember to update this if I DO). \n\n           COMBAT! Now maybe it's only because I've been doing a lot of building and exploring rather than dedicated mining or spelunking, but it does KINDA feel similar to minecraft in that they've added some combat reliant things to a game that isn't really combat based. Let me try to explain that: monsters are scattered throughout the world, right? well some of them drop things you MUST HAVE for certain recipes. Fine. Great. The only hitch is that all you've got is a sword and whatever level armor you've managed to craft. Now, like I said, I haven't been super focused on rare resource gathering so maybe this is just my personal failing, but with 2nd tier armor (obsidian) and a 2nd tier sword (more of a stone club) I still have a good bit of trouble with even NORMAL daytime mobs, nevermind the psycho critters in the caves. Additionally, that sword and armor you burned resources to make is durability based, and each progressive tier seems to require a lot of the same materials as the prior tier, which culminates in a problem trying to move to the next tier because you keep having to use the same stuff you want to use to move up on replacements of the lower tier armor & sword just so you can keep going outdoors!! The only real plus I've come across in that respect is how they've managed deaths and respawns. If/WHEN you die, an urn with ALL your stuff in it appears at your spot 'o' death and, as far as I can tell, stays there indefinitely. This urn is marked on your compass and has a light beacon sort of deal shining up from it, which makes it pretty easy to find once you've respawned at your little spawn setting tile (which is move-able).\n\n            Sorry, little ranty, I know. That's just one of those things I've always found a little annoying in minecraft and was disappointed to find it here too, although Creativerse is not AS BAD as minecraft about it.\n\n             SO, long story short? Good game. Single player anyway. Multi might just be hell, I don't know, but single player is pretty great. Good crafting, good atmosphere, good graphics, easy to learn, and FUN.", "timestamp_created": 1430145258, "timestamp_updated": 1430145258, "voted_up": true, "votes_up": 56, "votes_funny": 5, "weighted_vote_score": "0.79756540060043335", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "15475555": {"recommendationid": "15475555", "author": {"steamid": "76561198042012052", "num_games_owned": 69, "num_reviews": 1, "playtime_forever": 51709, "playtime_last_two_weeks": 46, "last_played": 1551475816}, "language": "english", "review": "This game has been a godsend for my wife and her son. We are stationed overseas and couldn't bring Mattie (my 5 year old stepson) with us. He was really big into Minecraft but setting up a personal server and playing without lag was a huge issue. Creativerse makes it so easy for my wife and Mattie to play together on their Skype dates :)\n\nI personally play this game almost every day. I've been so impressed at how \"polished\" this game is and it's only in Alpha! The visuals are easy on the eyes and the gameplay is satisfying. The Devs are fairly active in the forums and come out with new releases every 3-4 weeks. \n\nThis game opens it's doors to many different play styles ie. builder, designer, crafter, organizer, miner, gatherer, hunter, explorer, etc... \n\nSome gamers think Creativerse is a Minecraft clone, well... That is far from the truth! Just check out the various forum posts that help explain the difference. \n\nI highly recomend this game for anyone who enjoys this genre, but you don't have to take my word for it... ;)", "timestamp_created": 1429618545, "timestamp_updated": 1429618545, "voted_up": true, "votes_up": 131, "votes_funny": 9, "weighted_vote_score": "0.764308571815490723", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31884545": {"recommendationid": "31884545", "author": {"steamid": "76561198148121306", "num_games_owned": 24, "num_reviews": 9, "playtime_forever": 2445, "playtime_last_two_weeks": 0, "last_played": 1505096282}, "language": "english", "review": "Creativerse pulls itself above the crowded genre of games that re-engineer a Minecraft-styled game by making a smart move by having it Free to Play. This isn't going to replace the game I've played for years, but it is a nice breath of fresh air. Worth downloading not just because it's free but because Creativerse offers everything you'd expect, and more, all with a different flavor worth savoring. The best feature comes down to the online sessions easily available to anyone, even without the main host needing to be logged on.\n\n14 hours clocked in on this game and I can easily triple that in the upcoming days. Give this game a shot, and you won't regret it. Even if you do, it's Free!!!!", "timestamp_created": 1495378503, "timestamp_updated": 1495378503, "voted_up": true, "votes_up": 40, "votes_funny": 2, "weighted_vote_score": "0.697628498077392578", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31660676": {"recommendationid": "31660676", "author": {"steamid": "76561198006605505", "num_games_owned": 737, "num_reviews": 43, "playtime_forever": 5884, "playtime_last_two_weeks": 0, "last_played": 1510796552}, "language": "english", "review": "Gotta say its refreshing to find a game that actually gives back more than it tries to take.\n\nThe game is basically Landmark.. done right, if you know what happened to that game you'll know why it is now mostly dead, this game however is amazing, its a fun PvE experience and a better crafting experience, it runs far better and the community is great.\n\nGives bundle codes to new customers, very much helped my getting started\nhttp://steamcommunity.com/app/280790/discussions/0/1318836262665615633/\n\nOther than a cosmetic cash shop which sells mostly items you don't need but make building better, the DLC package of $20 is a score imo.\n\nSome positives of this game.\n\nIts endless fun if you like exploring or building with voxels.\nGives customers a great Free to play experience\nGives free players a lot of freebies\nGreat child friendly experience.\nDevs and mods here are cool as..\nMake your own story\nGet awesome blueprints from other players\nCoop experience or Solo.\nPvP servers if thats your thing.\n\nNegatives.\nPvP is on if your free to play, But just lock your server and stay away from PvP servers.\nQuite tough monsters early on\nLearning curve might be hard on customers new to Voxel games.\n\nGotta say this is the best free game i've enjoyed for ages.\n\nNot really like Minecraft more like Large Voxel Landmark .", "timestamp_created": 1494400970, "timestamp_updated": 1494401093, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.546781182289123535", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39965017": {"recommendationid": "39965017", "author": {"steamid": "76561198421311175", "num_games_owned": 2, "num_reviews": 7, "playtime_forever": 127685, "playtime_last_two_weeks": 1032, "last_played": 1551849723}, "language": "english", "review": "While quite time consuming, I found this game to be great for building just about anything you can dream up. A workshop offers free blueprints making building something pre-fabricated very easy plus if you don't have the blocks necessary you can substitute them for ones you have or prefer.\nI bought the PRO version to have a flashlight on at all times because the underground areas are very dark and easy to get lost in unless you'd rather place hundreds of torches.\nYou can own claims of territory that no matter what you build, no one can wander in and destroy it.\nGrow crops to feed your pets that you can tame from any world monster that exists.\nThere are hundreds of blocks to choose from but if you like shiny and sparkly ones those are bought with coins and you begin with 500. Additional coins can be purchased with real money if you decide this game is for you.\nI currently have 12 claims on one world (Everyone Welcome) and 7 on another (The Inside of Outsanity) plus my own private world (4LCH3M1STS's DOMAIN) as a creator with slightly over 1000 hours invested over a 6 month span.\nBest advice for finding a great world is to look for a world that has people on it and I've found people are really helpful and kind.\nI hope this review is helpful, stack with ya later!", "timestamp_created": 1518221331, "timestamp_updated": 1518221331, "voted_up": true, "votes_up": 20, "votes_funny": 4, "weighted_vote_score": "0.654880940914154053", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35246848": {"recommendationid": "35246848", "author": {"steamid": "76561197969950752", "num_games_owned": 131, "num_reviews": 3, "playtime_forever": 108641, "playtime_last_two_weeks": 0, "last_played": 1541133214}, "language": "english", "review": "Dispite a few (game breaking?) bugs, this game scores high marks with me. It is one of the most addictave games I've played. I've had the Game since mid 2015. I logged a little over 400 hours back then. I just got back into it a couple of months ago and have now logged well over 1700 hours.\nI've probably pumped too much money into this game. But it's well worth every penny of it, entertainment wise.\nI'm impressed with Playful Corp.'s attitude and wish the Company well.\nIt's Free to Play Guys... And flying alone, well worth the $20 to go Pro.\nI highly reccomend this game.", "timestamp_created": 1506536290, "timestamp_updated": 1506536393, "voted_up": true, "votes_up": 22, "votes_funny": 3, "weighted_vote_score": "0.658892631530761719", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31729388": {"recommendationid": "31729388", "author": {"steamid": "76561198046440983", "num_games_owned": 114, "num_reviews": 8, "playtime_forever": 607, "playtime_last_two_weeks": 0, "last_played": 1495379283}, "language": "english", "review": "I tried playing Minecraft (the inevitable comparison) but couldn't get into it, mainly because of a lack of guidance at the beginning and a quick death in a cave... \n\nI wasn't sure if my laptop could run Creativerse, so I downloaded and installed to try it. 2 hours later my wife is yelling at me to stop and take a shower. \n\n10/10 would get yelled at again.", "timestamp_created": 1494696762, "timestamp_updated": 1494696921, "voted_up": true, "votes_up": 66, "votes_funny": 106, "weighted_vote_score": "0.722639977931976318", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22249781": {"recommendationid": "22249781", "author": {"steamid": "76561198070110158", "num_games_owned": 77, "num_reviews": 18, "playtime_forever": 712, "playtime_last_two_weeks": 0, "last_played": 1463261484}, "language": "english", "review": "Me: Lol, another free Minecraft copy, I guess I'll fuck around with my friends for a while\n* 10 straight hours later*\nMe: Cool, achieved the best gear in the game.\n\n11/10", "timestamp_created": 1459849260, "timestamp_updated": 1459849260, "voted_up": true, "votes_up": 17, "votes_funny": 8, "weighted_vote_score": "0.686315536499023438", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "29789265": {"recommendationid": "29789265", "author": {"steamid": "76561198052665540", "num_games_owned": 87, "num_reviews": 33, "playtime_forever": 1858, "playtime_last_two_weeks": 0, "last_played": 1512083536}, "language": "english", "review": "[h1] First off I would like to say that this game has among the best community of players I have ever encountered online. Everyone is super helpful and nice, very collaborative and community oriented. Let's keep this trend going![/h1]\n\nNow [i]this[/i] is a sandbox game!\n\nI am absolutely loving this game, it's addicing and rewarding, everything about this game is fun to do.\n\nA breif overview of the game.\n\nYou start off in a random location on the world map, which currently there are only 4 variants off which is unfortunate, but hopefully soon they will be procedurally generated. You have a Twig with which to hit things to kill them and harvest their loot, and a basic Mining Core/Gauntlet. \n\nYou go kill Piglets, Boars, Leafis, things of that nature to collect Hide, Tusks, Sinew, Bone, etc. As you travel you can collect the trees, dirt, water, honey, etc in order to upgrade your Mining Core. Build up your core, mine around, explore, fight things, collect flowers/mushrooms. Make a Forge and Processor, create armor and weapons, other neat things. Furniture, what have you.\n\nMining Ore in this game is different. Instead of Clicking on it and standing there until you Pop it, you place an Extractor on the Ore Node which will harvest it for you, giving you time to go and look around for more ore while it processes. Come back and poof, there's 12 Coal Ore, or Obsidian or what ever it might be. It's a very interesting take on it and it's a lot of fun. \n\nWell anyway I'm rambling on about nothing, but it's a LOT of fun and it's still in early access. Tons of fun, and immense potentil. \n\n[h1] Overall Rating [/h1]\n[b] 8/10 [/b]\n\nOh, also, if you are crying about the game having a price tag now, get over it. Grow up, get a job. It's 20 bucks. That's like, what, less than 2 hours of work? I see so many people complaining about how they \"ruined\" the game and made it \"pay to win\" - it isn't. You can either A) Pay nothing and expierence 100% of the game, or B) Pay the nominal one time fee of 20 bucks, and get a bunch of goodies, and be able to create multiple worlds, and also help fund  the dev team for more updates in the future.\n\nStop being so entitled to free stuff. This real life. Money doesn't grow on trees. Nothings ever free.", "timestamp_created": 1486587120, "timestamp_updated": 1486587120, "voted_up": true, "votes_up": 46, "votes_funny": 2, "weighted_vote_score": "0.721146762371063232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "43328803": {"recommendationid": "43328803", "author": {"steamid": "76561198197663687", "num_games_owned": 243, "num_reviews": 185, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1515017386}, "language": "english", "review": "Player Bases.\n☐ Kids.\n☑ Everyone.\n☐ Mature.\n☐ Casual Players.\n☐ Pro players.\n\nGraphics.\n☐ Potato.\n☐ Really Bad.\n☐ Bad.\n☐ OK.\n☑ Good.\n☐ Beautiful.\n☐ Masterpiece.\n\nPrice.\n☐ Full Price.\n☐ Wait For Sale.\n☐ Refund It If You Can.\n☐ Don't Buy It.\n☑ Free.\n\nRequirements.\n☐ Minimum.\n☑ Medium.\n☐ Fast.\n☐ High End.\n☐ Super Computer.\n\nDifficulty.\n☑ Easy.\n☐ Medium.\n☐ Hard.\n☐ Very Hard.\n☐ Death March.\n☐ Dark Souls.\n\nGame length.\n☐ Really Short. ( 0 - 2 hours)\n☐ Short. ( 2 - 8 hours)\n☐ Medium. ( 8 - 16 hours)\n☐ Long. ( 16+ hours)\n☑ Endless.\n\nStory.\n☑ It Doesn't Have One.\n☐ Horrible.\n☐ Ok.\n☐ Average.\n☐ Good.\n☐ Fantastic.\n\nCinematic/Art.\n☑ It Doesn't Have.\n☐ Horrible.\n☐ Ok.\n☐ Average.\n☐ Good.\n☐ Like Watching A Movie.\n\nMusic/Sound.\n☐ Horrible.\n☐ Decent.\n☑ Average.\n☐ Good.\n☐ Amazing.\n\nGameplay.\n☐ Terrible. \n☐ Ok.\n☑ Average.\n☐ Good.\n☐ Fantastic.\n\nBugs.\n☐ Game Itself Is One Big BUG.\n☐ Game Breaking Bugs.\n☐ Lots of bugs.\n☑ Few Bugs.\n☐ Nothing.\n\nOthers.\nMultiplayer: ☑\nSingleplayer: ☑\n\nFinal Score:\n5/10\n\nRecommended!", "timestamp_created": 1530808428, "timestamp_updated": 1537463174, "voted_up": true, "votes_up": 41, "votes_funny": 14, "weighted_vote_score": "0.689783036708831787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 38, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 8197, "total_negative": 2571, "total_reviews": 10768}}
