{"reviews": {"48834379": {"recommendationid": "48834379", "author": {"steamid": "76561198060066891", "num_games_owned": 82, "num_reviews": 3, "playtime_forever": 131908, "playtime_last_two_weeks": 118, "last_played": 1551872463}, "language": "english", "review": "I've played a little bit and you know what?\n\nWho cares if its F2P or not.\n\nIt is obviously the best mmofps out there. None of those AAA titled billion making companies can compare their game with this masterpiece. You have actual chaos not faked by any trailers or anything. \n\nThanks.", "timestamp_created": 1549582309, "timestamp_updated": 1549582309, "voted_up": true, "votes_up": 41, "votes_funny": 1, "weighted_vote_score": "0.744693458080291748", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48999074": {"recommendationid": "48999074", "author": {"steamid": "76561197996768021", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 138182, "playtime_last_two_weeks": 3177, "last_played": 1551847309}, "language": "english", "review": "While I am a fan of the game and desperately want it to succeed, but I have noticed a strong decline in quality of gameplay (from inconsistent servers to lots of nerfs in a short period of time.) If you last played this game in 2016 and come back now, it is a completely different game. Armor vs Armor got significantly nerfed with the Combined Arms Initiative Update and the Unstable Warpgates Update which force people to fight at poorly designed bases on the middle of the map on 3 of the 4 continents. Now it seems like the development team for this game has lost it's way and has been making updates and balance changes that people complain and post about on the Planetside subreddit the most. Sadly enough, the only redeeming factor left in this game are the large scale fights and those are starting to decline significantly as of recent. \n\n3 years ago I would have strongly recommended this game, but due to poor balancing choices in 2017 and onward which have lead to a significant decline of the games population. The redeemable factors left in this game are running out to a point where i cannot recommend this to anyone unless servers are fixed and the player base grows back to 2017 levels.", "timestamp_created": 1550201613, "timestamp_updated": 1550201613, "voted_up": false, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.666054368019104004", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49018132": {"recommendationid": "49018132", "author": {"steamid": "76561198068677342", "num_games_owned": 37, "num_reviews": 5, "playtime_forever": 12098, "playtime_last_two_weeks": 90, "last_played": 1551480836}, "language": "english", "review": "This game is incredibly underrated and actually a lot of fun. It takes some time to get good at it and understand how everything works, but once you do, it's incredible.", "timestamp_created": 1550273673, "timestamp_updated": 1550273673, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.512195110321044922", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49198674": {"recommendationid": "49198674", "author": {"steamid": "76561198085358020", "num_games_owned": 105, "num_reviews": 20, "playtime_forever": 10385, "playtime_last_two_weeks": 0, "last_played": 1550271091}, "language": "english", "review": "War game? Tell that to the Vanu soldiers who cornered me.", "timestamp_created": 1550965783, "timestamp_updated": 1550965783, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.503239750862121582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49235581": {"recommendationid": "49235581", "author": {"steamid": "76561198038838510", "num_games_owned": 47, "num_reviews": 20, "playtime_forever": 2155, "playtime_last_two_weeks": 765, "last_played": 1551828708}, "language": "english", "review": "Pros\n+F2P\n+A community that still alive\n+P2L and not P2W\n+Help Level up fast with all XP buffs everyday\nCon\n-Unbalance Perks\n-Unbalance Armor tanks who ever to easy destroy or to easy keep alive\n-Requires 3-5 friends if you don't want someone rage quit (happen to my party 3 times)\n-Unbalance Max suits way to easy kill for it be over price to build\n\n(8.5/10) it flaws can be ignored easy", "timestamp_created": 1551125765, "timestamp_updated": 1551125765, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503239750862121582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49022847": {"recommendationid": "49022847", "author": {"steamid": "76561198826710752", "num_games_owned": 5, "num_reviews": 6, "playtime_forever": 1619, "playtime_last_two_weeks": 0, "last_played": 1528628546}, "language": "english", "review": "Vanu's female infilitrators are hot smh", "timestamp_created": 1550296725, "timestamp_updated": 1550296725, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.540636062622070313", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49275737": {"recommendationid": "49275737", "author": {"steamid": "76561198002506240", "num_games_owned": 200, "num_reviews": 2, "playtime_forever": 40737, "playtime_last_two_weeks": 0, "last_played": 1514276206}, "language": "english", "review": "I have probably around 3k hours (a lot not on steam since I used the launcher directly) and I can say with confidence that this game is fantastic. Many players express frustration when it comes to how the game is balanced, or the technical design choices the devs make, but ultimately the core gameplay is fantastic. Its a blast to play with friends and can give such an incredible sense of scale that it will give you goosebumps. \n\nEach of the three factions have unique traits and offer slightly differing play styles. All the vehicles are unique and powerful in their own ways. Some require teamwork while others just individual skill. Each of the 4 Continents offers varying terrain making fighting on the unique to their own environment. Joining outfits (clans) in game is great way to make friends and gives players a chance to try and play as a team. The devs are also fantastic, bringing new and interesting updates and communicating with the playerbase on changes. \n\nHowever there are some issues with the game that people should know. The learning curve is brutal. For many new players this is the hardest thing to overcome. There is no \"matchmaking\" so players have to learn to find their own fights. Often times new player will spend the first hour or so (depending on skill) just dying over and over and this can make the game feel very P2W and overall uninviting. Additionally being stuck with default equipment can make it feel like everyone is way ahead of you. However its important to know that often times the default guns given to each class is usually one of the more versatile and powerful guns for those classes (Think of T9 Carv, Orion, Gauss saw, Trac-9, T1 cycler.) The game is not P2W. Getting a membership will decrease the grind, but paying money can only get you cosmetics and guns (which again, are mostly sidegrades.) \n\nVehicles are one aspect where the grind is real and the default loadouts are often lackluster. New players are excited to jump into tanks only to realize how difficult it can be to use and how easy it is to die. This is something that every player learns to get better at overtime. Vehicles are also not always essential to the gameplay as many fights focus on infantry combat, which gives new players a more even playing field.\n\nThe game can also be difficult to run on many computers. For a long time I ran the settings on bare minimum just to consistently get over 20 fps (back in 2016 on a laptop.) Many veteran players are also concerned about the shrinking playerbase, which is very real. The game is not as big as it used to be and there's no denying it. Despite this, there are still many hundreds of people online on each server for mos the day and the game is very much still alive, except at early morning hours.\n\nOverall, PS2 gives a very unique fps experience with the freedom of an open world game where many battles consist of hundred of players. If you are looking for a shooter that is different from the norm, even if just for a few hours, definitely check this one out. See you on Auraxis.", "timestamp_created": 1551347727, "timestamp_updated": 1551349235, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528611063957214355", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48991004": {"recommendationid": "48991004", "author": {"steamid": "76561198309540033", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 24631, "playtime_last_two_weeks": 9, "last_played": 1551588564}, "language": "english", "review": "This game may seem very hard at first, and it is, but if you play it enough and join a squad it becomes VERY fun.", "timestamp_created": 1550165259, "timestamp_updated": 1550165259, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.49253728985786438", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49363302": {"recommendationid": "49363302", "author": {"steamid": "76561198124049359", "num_games_owned": 11, "num_reviews": 3, "playtime_forever": 262426, "playtime_last_two_weeks": 2733, "last_played": 1551828709}, "language": "english", "review": "After a \"couple\" of hours I must now come to the conclusion that I cannot recommend this game anymore. It has been on a downward slope for a good time now, and it's arrived at a point where if you asked me whether to pick it up or not and I honestly answered, I'd say \"don't!\"\n\nTL;DR: Vehicles are overpowered against infantry, a lot of vets cheat legally, stupid designs decisions and horrible performance will work together to make the new player experience absolutely attrocious.\n\n[b]1) Unbalanced interaction between vehicles and infantry.[/b] This has always been a major issue, now it's come to the point where the interaction of infantry with vehicles is just tedious. I am an average vehicle player, but every time I play in vehicles I absolutely eclipse the very top 0.1% of infantry players in terms of KDR. Vehicles are so stupendously overpowered against infantry, and infantry has so little to attack vehicles (not to mention infantry will almost always play reactionary anyway) that you're better off just trying to ignore the enemy vehicles and avoid the battles they're in.\n\n[b]2) \"Cheating\" but legally.[/b] This is probably thrown into 50% of all reviews. But after playing for a couple of thousand hours I think I know what I'm talking about. No, it's not aimbots or wallhacks (although the last one does happen). It's lag. This game has no limit on ping, people from the other side of the world can play on the same server you are. People can also use 3rd party programs to induce lag. The way this game works is such that if you have lag and you know how to exploit it, your opponent is at a massive disadvantage. A laggy player like that can easily kill you before they've even shown up on your screen  at all. And, it's perfectly fine by DBG's rhetoric. Needless to say, especially newer players are easy prey, en masse, to these kind of players.\n\n[b]3) Useless mechanics which promote zerging.[/b] They wanted to solve zerging but everything they did up to this point has done the opposite. When a map starts, its boundaries are severely restricted. This means everyone (if its 100 people or 1000 people on the server) is forced to go to 1 base and fight there. Herd instinct makes it that even if the map opens up to other locations, the only fight you will get is at that location for at least the coming hour. It's a hopeless fight where (especially new players) will get farmed by cheese, like aforementioned vehicles, and orbital strikes (nukes).\n\n[b]4) Horrible optimization.[/b] It's a DX9 game and as such, lower graphics will only make performance worse on most PC's (your graphics card is not optimized for DX9 anymore). Unless you know how to tweak your INI file (which new players generally won't) you'll be running around with sub-par frames. One moment you may have an acceptable, fluid game and the next things just stutter around. The bigger the battle, the worse this problem. Due to the nature of this game, new players will get farmed simply because they cannot respond effectively, even if they would.\n\nAll in all, I cannot but conclude that this game will not be an enjoyable experience for new players.", "timestamp_created": 1551744229, "timestamp_updated": 1551744515, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.541666686534881592", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49041452": {"recommendationid": "49041452", "author": {"steamid": "76561198091834539", "num_games_owned": 54, "num_reviews": 3, "playtime_forever": 6823, "playtime_last_two_weeks": 592, "last_played": 1551825629}, "language": "english", "review": "Im' back to this game after 4 years. For me its charming as it was, but community shrinked and game got pretty old. Still it is worth to give it a try.", "timestamp_created": 1550361541, "timestamp_updated": 1550361541, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.560341715812683105", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48807802": {"recommendationid": "48807802", "author": {"steamid": "76561198272879395", "num_games_owned": 5, "num_reviews": 2, "playtime_forever": 133, "playtime_last_two_weeks": 107, "last_played": 1550808703}, "language": "english", "review": "I have over 900 hours on the game itself, not on steam but its AWESOME, sure it gets boring, but if you find it after a while and play it, You get right back up and start playing daily", "timestamp_created": 1549485388, "timestamp_updated": 1549485388, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48933948": {"recommendationid": "48933948", "author": {"steamid": "76561198190592470", "num_games_owned": 18, "num_reviews": 4, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1549213486}, "language": "english", "review": "Fun game, \nfeels like battlefield 4 and some 90's Sci-Fi movie had an autistic kid that overdosed on map size.\n\nIf your pc can run it on high at 60fps+, you'll have fun. Otherwise i wouldnt recommend it.", "timestamp_created": 1549914510, "timestamp_updated": 1549914510, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49195039": {"recommendationid": "49195039", "author": {"steamid": "76561198045829372", "num_games_owned": 117, "num_reviews": 4, "playtime_forever": 535, "playtime_last_two_weeks": 152, "last_played": 1551472479}, "language": "english", "review": "Word to the wise: If you intend to play this, expect to have a bad time for, like, the first few months until you start getting better spec'd gear. Unsurprisingly, having a shooter that encompasses more square footage than a modern Battle Royale title results in a lot of people spending a lot of time getting to be VERY good at the game.\n\nThat said, the gameplay is timelessly solid, particularly considering the game's 7-year age and its nearly rabid fanbase of active players. Pick it up if you're down for a challenge, leave it if you don't wanna spend the first few months as a bullet sponge.", "timestamp_created": 1550950880, "timestamp_updated": 1550950880, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504950463771820068", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49197347": {"recommendationid": "49197347", "author": {"steamid": "76561198077881145", "num_games_owned": 98, "num_reviews": 12, "playtime_forever": 4778, "playtime_last_two_weeks": 503, "last_played": 1551054081}, "language": "english", "review": "Frankly put this game can be a great amount of fun, or it can be an utter disaster of a time. It all depends on 3 things. Who you choose as your faction... sometimes you will find your faction being completely overwhelmed no matter what you do, 99% of the time you will be winning battles based on sheer numbers. The second thing it depends on is if your playing alone or with others. This does not mean you need to be playing with someone you know, but it is a far more rewarding experience when you join a platoon or a squad. Lastly and possibly the most important thing is are you willing to communicate with your team members. It is not difficult at all to use the voice chat options, but for some reason no one seems to care. Using the voice chat to communicate with your surrounding team mates is basically a necessity for winning large scale battles. All in all Planetside 2 is a solid game that offers strangely repetitive yet addicting game play that will make you want to keep playing so that you can unlock more abilities, guns, etc.", "timestamp_created": 1550959513, "timestamp_updated": 1550959513, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503239750862121582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49221135": {"recommendationid": "49221135", "author": {"steamid": "76561198315942738", "num_games_owned": 33, "num_reviews": 4, "playtime_forever": 575, "playtime_last_two_weeks": 153, "last_played": 1551568485}, "language": "english", "review": "Pretty cool. Although this game is not very suitable for low end PC's, this game will run okay on most gaming PC's. The fights are absolutely amazingly awesome. They are so intense. Overall, I'd give this game a solid 7/10.\n", "timestamp_created": 1551052194, "timestamp_updated": 1551052194, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503239750862121582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48811676": {"recommendationid": "48811676", "author": {"steamid": "76561197995070619", "num_games_owned": 307, "num_reviews": 4, "playtime_forever": 36319, "playtime_last_two_weeks": 0, "last_played": 1548386990}, "language": "english", "review": "Autistic masochism simulator 20-whatever-fucking-year-it-is", "timestamp_created": 1549501899, "timestamp_updated": 1549501899, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48843210": {"recommendationid": "48843210", "author": {"steamid": "76561198034181264", "num_games_owned": 98, "num_reviews": 4, "playtime_forever": 26878, "playtime_last_two_weeks": 1726, "last_played": 1551261113}, "language": "english", "review": "still a great game", "timestamp_created": 1549621952, "timestamp_updated": 1549621952, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48861771": {"recommendationid": "48861771", "author": {"steamid": "76561198378064753", "num_games_owned": 12, "num_reviews": 6, "playtime_forever": 116534, "playtime_last_two_weeks": 85, "last_played": 1550728161}, "language": "english", "review": "Still the best f2P shooter on steam...or anywhere. Strong community, dedicated dev team, and NOT pay to win. Show them that good business practices still pays off, consider buying some skins. \n\n9/10....i need room so that PS3 can be that perfect 10 someday.", "timestamp_created": 1549685458, "timestamp_updated": 1549685458, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48820970": {"recommendationid": "48820970", "author": {"steamid": "76561198372977318", "num_games_owned": 61, "num_reviews": 15, "playtime_forever": 1204, "playtime_last_two_weeks": 0, "last_played": 1536890761}, "language": "english", "review": "great game", "timestamp_created": 1549540541, "timestamp_updated": 1549540541, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48858311": {"recommendationid": "48858311", "author": {"steamid": "76561198158707815", "num_games_owned": 118, "num_reviews": 12, "playtime_forever": 5366, "playtime_last_two_weeks": 0, "last_played": 1549703206}, "language": "english", "review": "A great game, its a shame that I suck at it.", "timestamp_created": 1549669402, "timestamp_updated": 1549669402, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48840753": {"recommendationid": "48840753", "author": {"steamid": "76561198078823850", "num_games_owned": 104, "num_reviews": 8, "playtime_forever": 10366, "playtime_last_two_weeks": 0, "last_played": 1548374890}, "language": "english", "review": "Still one of the best MMOFPS... No IMHO the best, because there's not many out there.\nThe small team of devs that's left working on it, bless their hearts. Are trying.  They fumble and they make some very clumsy  mistakes, but for keeping the game F2P and working with what they have, they've done pretty well.\nEver seen massive battles like from the trailers or CoD or Battlefield, and get disappointed that, it's nearly never like that in actual gameplay?  This game has those battles, and every actor is a real player! Massive, chaotic battles.\nBest of all, it's actually a F2P game.  The basic weapons are often times better, as all arounders, than the ones you get with Certs, which you can either earn (very... very easily I might add) or buy if you want.  Generally though you'll want to buy skins or memberships if anything to set yourself apart, because there's no need to buy weapons, so there's no P2W. \nThe game's playerbase has dived recently, with the Daybreak anouncing a Battle Royale based on the game's IP, and a few patches worth of fixing the servers while trying to add new things that caused problems for people to stay in the servers, which they should've just rolled back imho, but now that I think about it, due to the Dev team's very small size for a game this big, I wonder if they have the ability to test the patches and fix them to have been able to afford to roll them back and lose the feedback?\nEither way, a very fun game, that's even better when you work as a team.", "timestamp_created": 1549612410, "timestamp_updated": 1549612410, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48833930": {"recommendationid": "48833930", "author": {"steamid": "76561197960372540", "num_games_owned": 153, "num_reviews": 5, "playtime_forever": 1677, "playtime_last_two_weeks": 0, "last_played": 1550285972}, "language": "english", "review": "Don't take it too serious.", "timestamp_created": 1549580337, "timestamp_updated": 1549580337, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48843981": {"recommendationid": "48843981", "author": {"steamid": "76561198430210748", "num_games_owned": 3, "num_reviews": 3, "playtime_forever": 490, "playtime_last_two_weeks": 64, "last_played": 1551609511}, "language": "english", "review": "We need chinese!over!-----A player of China", "timestamp_created": 1549624730, "timestamp_updated": 1549624730, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503311276435852051", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49301184": {"recommendationid": "49301184", "author": {"steamid": "76561198055236517", "num_games_owned": 64, "num_reviews": 2, "playtime_forever": 43601, "playtime_last_two_weeks": 4114, "last_played": 1551558322}, "language": "english", "review": "<Server: Miller | Faction: TR> \n\nGood MMOFPS even in these days. \nThe game in a nutshell: Three factions, the mighty terrans (TR),  the gone mad terrans (NC) and an overpowered drunk alien sect (VS), fight on atm four continents for the reign of empty facilities - yay!\n\n+ coordinated teamplay pays off\n+ friendly and helpful community \n+ small battles can escalate quickly in a huge battle with 200+ players involved\n+ three factions with their own style in vehicles, weapons and abilities \n+ six classes to choose from\n+ four big continents with different environment themes\n+ a lot of grinding aka hundreds of hours gameplay\n+ no p2w, just skins or time saver (seriously if you think buying something which you can get anyway after a couple hours is p2w, feel free to f*ck off)\n\n- client sided gameplay can be annoying sometimes\n- if you don't play with a coordinated squad you will sometimes find yourself in situations in which you feel like you are the only one around who actually uses his brain (e.g. medics just run pass your corpse, other engineers place their turret right in front of yours, ...)\n\nOverall 9/10\n\nPS: [BHO] and [DIG] you guys suck.", "timestamp_created": 1551468835, "timestamp_updated": 1551485849, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.527559041976928711", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49367087": {"recommendationid": "49367087", "author": {"steamid": "76561198145571338", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 15480, "playtime_last_two_weeks": 352, "last_played": 1551485911}, "language": "english", "review": "Best game ever", "timestamp_created": 1551767827, "timestamp_updated": 1551767827, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49203766": {"recommendationid": "49203766", "author": {"steamid": "76561198076540057", "num_games_owned": 23, "num_reviews": 3, "playtime_forever": 18079, "playtime_last_two_weeks": 181, "last_played": 1551508960}, "language": "english", "review": "good game", "timestamp_created": 1550989909, "timestamp_updated": 1550989909, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.47745281457901001", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49294097": {"recommendationid": "49294097", "author": {"steamid": "76561198387503606", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 118185, "playtime_last_two_weeks": 90, "last_played": 1551436314}, "language": "english", "review": "Great game", "timestamp_created": 1551442228, "timestamp_updated": 1551442228, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48906375": {"recommendationid": "48906375", "author": {"steamid": "76561198087001887", "num_games_owned": 100, "num_reviews": 7, "playtime_forever": 52544, "playtime_last_two_weeks": 26, "last_played": 1551605777}, "language": "english", "review": "This game is a extraterrestrial battlefield which has multiple continents. There are three factions. They have common weapons and vehicles however they also have different weapons and vehicles. Here, I will leave some descriptions of these factions so newcomers can enjoy the game without any massive disturbance.\n\nTR: Space Nazi. They came to Auraxis from the Moon, which was their evacuation site of the war. Most of their specific guns have high rates of rounds per minute, due to their earlier situation which needed methods to remove debris and asteroids from the outer space. Since the earlier guns are not precise guns they wanted, they simply increased the amount of rounds. As time goes by, they improved the accuracy of their guns and thanks to the Nanite Systems, troops of the Terran Republic can enjoy well-oiled machine guns.\n\nNC: Space Patriots. They've been loving freedom so much so they became the freedom. By the way they usually love to oppose something. The TR used the fast weapons so they decided to use slower weapons. Since they don't have much productions than the TR, They decided to make more durable weapons and armours. And they struggled to find the perfect weapon which has fewer RPM but can do massive damage. Oh boy, they found shotgun. The TR also used it however not like the NC. They placed shotgun at the turret and the aircraft. Also they found out the Gundams are cool and awesome and they applied them to the NC MAX. You will think the TR MAX is round and THICK after you see the NC MAX.\n\nVS: Space Scaley. If you think the VS is more like the space furry, You're wrong. I haven't seen any headgear that represents  the furry emojis in the game yet. Scaley is non-fur and has scales or nothing but looks like it has scales such as lizard, dragon, etc. They always wear skinny spandex and as the result the men's butt are double of the women's butt. This made gays and the gays made the traps. Henry Briggs saw the future and the technologies which will let the humanity flourish but the technologies use the spandex. I think he committed suicide because he died of shame. But why these technologies need spandex? I guess the progress of the technology was so fast that they skipped some important points which fu'r'fil (haha funny) unknown human desires (such as the advanced Pornhub). Anyway these are why the VS is being called gay. They usually don't have such nice weapons even though they are developing themselves into the Vanu (maybe they don't have decent weapons but decent vehicles). They usually do medium damage, have medium velocity, etc. compared with the TR's and the NC's.\n\nI recommend VS for the beginners because its infantry system is easy to understand and easy to use. Try NC if you are bad at aiming.\n\nThanks for reading and goodbye", "timestamp_created": 1549818106, "timestamp_updated": 1549818106, "voted_up": true, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.575718104839324951", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49184716": {"recommendationid": "49184716", "author": {"steamid": "76561198042140506", "num_games_owned": 129, "num_reviews": 4, "playtime_forever": 12696, "playtime_last_two_weeks": 20, "last_played": 1551122839}, "language": "english", "review": "This game suks lmao", "timestamp_created": 1550924040, "timestamp_updated": 1550924040, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497942358255386353", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48876842": {"recommendationid": "48876842", "author": {"steamid": "76561198139655064", "num_games_owned": 147, "num_reviews": 2, "playtime_forever": 472, "playtime_last_two_weeks": 0, "last_played": 1545159258}, "language": "english", "review": "good game\n", "timestamp_created": 1549729106, "timestamp_updated": 1549729106, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514356017112731934", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49221707": {"recommendationid": "49221707", "author": {"steamid": "76561198889079182", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 2998, "playtime_last_two_weeks": 356, "last_played": 1551222479}, "language": "english", "review": "a good game needs to be on xbox one", "timestamp_created": 1551055576, "timestamp_updated": 1551055576, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.472577482461929321", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49181961": {"recommendationid": "49181961", "author": {"steamid": "76561198248337018", "num_games_owned": 66, "num_reviews": 32, "playtime_forever": 137, "playtime_last_two_weeks": 0, "last_played": 1524375476}, "language": "english", "review": "Only got this game because some one sucked my left nut to hard", "timestamp_created": 1550916756, "timestamp_updated": 1550916756, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.493975907564163208", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49097101": {"recommendationid": "49097101", "author": {"steamid": "76561198143886853", "num_games_owned": 10, "num_reviews": 4, "playtime_forever": 210, "playtime_last_two_weeks": 24, "last_played": 1550690949}, "language": "english", "review": "first time i tried a game whit this genre of massive scale warfare.... and now i feel like i never really lived my life :(", "timestamp_created": 1550566439, "timestamp_updated": 1550566439, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48936620": {"recommendationid": "48936620", "author": {"steamid": "76561198272192835", "num_games_owned": 75, "num_reviews": 9, "playtime_forever": 4469, "playtime_last_two_weeks": 170, "last_played": 1551116623}, "language": "english", "review": "I do enjoy playing this game in small bite size pieces even without having unlocked any primary weapons for any class (yes I just like spending my in-game credits on small upgrades), here's my basic overview of the game's pros and cons.\n\nPros:\n> The game is free\n\n> The developers put a lot of time seriously balancing the game, all three factions in the game are based on preferred playstyle rather than one simply being more powerful\n\n> You meet some real nice people (shoutout to TATF of the NC faction)\n\n> The graphics are nice, if you're bored engaging in large scale firefights why not build a base and enjoy the scenery?\n\nCons:\n> You may not enjoy the gameplay at low fps, as infantry, most situations include fast reactions if you wish to use your gun\n\n> The game is really grindy, even with the grind there are many items you can't unlock for free\n\n> Though it is very well balanced, each gun has to be used situationally, if you don't have a good gun for that specific situation or you lack in aiming skill you will die a very large number of times\n\n> For wannabe flyers or pilots, the mouse control features roll and pitch rather than the widely used pitch and yaw. This may not be a problem due to the yaw speed of most flying vehicles is rather slow, the main problem lies that you cannot change it and you are stuck with it\n\n> I swear to god stop driving your C4 packed scooters into my tank", "timestamp_created": 1549923937, "timestamp_updated": 1549923937, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490463227033615112", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49300721": {"recommendationid": "49300721", "author": {"steamid": "76561198040464395", "num_games_owned": 111, "num_reviews": 1, "playtime_forever": 7211, "playtime_last_two_weeks": 51, "last_played": 1551416043}, "language": "english", "review": "This is the best F2P game out right now, DOTA/LoL don't count because they're gay", "timestamp_created": 1551466903, "timestamp_updated": 1551466903, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.469556242227554321", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49157461": {"recommendationid": "49157461", "author": {"steamid": "76561198864815783", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 13, "playtime_last_two_weeks": 13, "last_played": 1550850643}, "language": "english", "review": "I can't enter the game, always that I try to log in it tells me to change my pasword for security reasons.\nPlease fix this.", "timestamp_created": 1550850447, "timestamp_updated": 1550850447, "voted_up": false, "votes_up": 5, "votes_funny": 4, "weighted_vote_score": "0.486036866903305054", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49124867": {"recommendationid": "49124867", "author": {"steamid": "76561198287854108", "num_games_owned": 44, "num_reviews": 4, "playtime_forever": 4670, "playtime_last_two_weeks": 0, "last_played": 1550348755}, "language": "english", "review": "More cheaters now then in 2013...game is a piece of dodoːsteamfacepalmː fps in this day an age are loaded with haxers. DayBreak,Orgin EA,Activision all Devs an publishers dont care about cheaters in their games,LMAO Battleeye Easycheat an Valve all worked around by haxers. Look at BFV...outta control..Ea doesnt gave a♥♥♥♥♥♥I will never buy another FPS shooter ...Cheaters ruin all the fun an challange   Planetside Arena will fail an PS2 will die.Its slowly been dying for yearsNothing left but Ranked up fanboys an cheaters fron some third world♥♥♥♥♥♥holes ♥♥♥♥ all you azzhats   Have a nice day maggotsːsteammockingː", "timestamp_created": 1550686461, "timestamp_updated": 1550686461, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.454545468091964722", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49304584": {"recommendationid": "49304584", "author": {"steamid": "76561198092988060", "num_games_owned": 28, "num_reviews": 18, "playtime_forever": 8597, "playtime_last_two_weeks": 21, "last_played": 1551485049}, "language": "english", "review": "I'm sure it's a fun game but with the low population I'm sure only the best of the best are playing now. You stand no chance as a new player and you will get killed over and over again and it's not worth the grind.", "timestamp_created": 1551485174, "timestamp_updated": 1551485174, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.478419452905654907", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48972490": {"recommendationid": "48972490", "author": {"steamid": "76561198030339641", "num_games_owned": 190, "num_reviews": 18, "playtime_forever": 29989, "playtime_last_two_weeks": 0, "last_played": 1508279140}, "language": "english", "review": "Love the game...hate the nerfs for being a non-paying player.  If you're paying to play, your characters and weapons are so much OP than the non payers.  How do I know? ... I played both.   Definitely not worth the grind and frustration of shooting peanuts at paying players with real weapons and ammo at the same level while hoping to get enough xp to move up the ladder.  Video game with mathematical algorithms based on a human's need to succeed...gotta love em.", "timestamp_created": 1550078004, "timestamp_updated": 1550078004, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.438768178224563599", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49104217": {"recommendationid": "49104217", "author": {"steamid": "76561198016804736", "num_games_owned": 309, "num_reviews": 50, "playtime_forever": 15670, "playtime_last_two_weeks": 479, "last_played": 1551552506}, "language": "english", "review": "No not in a million years", "timestamp_created": 1550594952, "timestamp_updated": 1550594952, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.416543155908584595", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48981778": {"recommendationid": "48981778", "author": {"steamid": "76561198022588153", "num_games_owned": 131, "num_reviews": 7, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1420817869}, "language": "english", "review": "I had previously given H1Z1/Just Survive a good review; however since the Dev team decided to remove the version of the game I bought, and wanted to play; I am going to change my review until the problem is fixed. Additionally, since Daybreak seems to only want peoples money, I would suggest stearing clear of any of Daybreak's games until theyt change their policies.", "timestamp_created": 1550125226, "timestamp_updated": 1550125226, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.459410220384597778", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48914879": {"recommendationid": "48914879", "author": {"steamid": "76561198066883999", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 1430, "playtime_last_two_weeks": 0, "last_played": 1549843429}, "language": "english", "review": "Despite this being a possibly good game, I wouldn't recommend it.\n\nYou first have to deal with a lot of long established players, the guides on the internet (Iridar . net , Cyrious Gaming YouTube) teaches you to fight on their level. You still can't compete due to internet speeds, you move slow on their screen and they move fast on your screen. Their \"Time to Kill\" will always be better than yours due to not having a better connection then they do. Not sure if it be fair for me to blame the Game Servers or if it comes down to my side, I've had better success with Warthunder in terms of this sort of issue.\nThe game shows a lot of customization, but you REALLY have to grind plenty of in-game hours to unlock a new weapon, or buff other utilities. There's LOTS of Micro-transactions if your into that sort of thing, cosmetics and non-cosmetics. You should expect that from a free to play. All the fun stuff is locked from the start.\nThere's plenty of people to play with, the game is well populated for it's age. Game looks cool. There's a variety of ways to play the game, but playing the objective is always cqc and you're not very useful doing anything else most of the time.\nI think I'm going to try Squad next, it might scratch the itch I'm looking for.\n*\n*You simply can't have fun as a casual gamer with Planetside 2, for more reasons than those stated above.\n*", "timestamp_created": 1549845241, "timestamp_updated": 1549845296, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.444129317998886108", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48952462": {"recommendationid": "48952462", "author": {"steamid": "76561198015410745", "num_games_owned": 192, "num_reviews": 3, "playtime_forever": 63947, "playtime_last_two_weeks": 0, "last_played": 1549990969}, "language": "english", "review": "pretty dead game, choosing a faction is pointless with ne NS-Weapons. The Community is a mixed bag of sweet and helpfull vets and braging douchebags. Fantastic Game but at this point i cant recomend it to anybody\n", "timestamp_created": 1549991351, "timestamp_updated": 1549991351, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.417625844478607178", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48885090": {"recommendationid": "48885090", "author": {"steamid": "76561198103808115", "num_games_owned": 76, "num_reviews": 6, "playtime_forever": 48191, "playtime_last_two_weeks": 0, "last_played": 1549751460}, "language": "english", "review": "Takes years to fix the most gamebreaking shit.  Not worth playing.", "timestamp_created": 1549751551, "timestamp_updated": 1549751551, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.462166905403137207", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48888995": {"recommendationid": "48888995", "author": {"steamid": "76561198803724654", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 1376, "playtime_last_two_weeks": 0, "last_played": 1533168694}, "language": "english", "review": "add more lore and do a overhaul please", "timestamp_created": 1549766202, "timestamp_updated": 1549766202, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.411764681339263916", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48911278": {"recommendationid": "48911278", "author": {"steamid": "76561198862638861", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1548616900}, "language": "english", "review": "very big map with long tutorial and it is still confusing", "timestamp_created": 1549831447, "timestamp_updated": 1549831447, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.441304475069046021", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49128834": {"recommendationid": "49128834", "author": {"steamid": "76561198408153143", "num_games_owned": 11, "num_reviews": 4, "playtime_forever": 441, "playtime_last_two_weeks": 86, "last_played": 1550705671}, "language": "english", "review": "good idea, good graphics, and the game play? terrible. the max cost's too much for how bad it is,the weapons prices are ridiculous, the purple faction is over powered, and the game is just bad, thought i would like it but i guess not.", "timestamp_created": 1550705988, "timestamp_updated": 1550705988, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.448148965835571289", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49062789": {"recommendationid": "49062789", "author": {"steamid": "76561198126215464", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 755, "playtime_last_two_weeks": 13, "last_played": 1551618020}, "language": "english", "review": "Runs like shit. completely pay to win, shot a dude in the face with a full mag then got one shot by his pistol", "timestamp_created": 1550445118, "timestamp_updated": 1550445118, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.445739924907684326", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49055480": {"recommendationid": "49055480", "author": {"steamid": "76561198825295633", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1996, "playtime_last_two_weeks": 0, "last_played": 1550407691}, "language": "english", "review": "Bad, just bad. \nAfter  so many years playing it i can say it has become a bad game.\nUnstable,game freezes for seconds, hudge lag spikes, when changing continents 8/10 you spawn underground and die flying to the center of the planet, makes sense right?\nGun performance is lame. Most weapons are the same. NS weapons are superior though.\nYou need a 10.000 euro computer to run this game.\nMany players do edit game directory files so they have a hudge advantage against others, dbg allows it though. So totally legit to be able to boost your in game performance against others who do not even know what ini. files are...\nGame balance is strange, three different factions with no difference at all except main battle tanks.\nNot to mention the great \"advantage\" some players have due to high ping... Lag dodge kill situation. \nIf you are looking for a game to have fun, then try not planetside.\nDid I mention I was playing since beta? And yes planetside 2 was at its best at launch. \nReally dissapointed and will never ever play this game.", "timestamp_created": 1550418295, "timestamp_updated": 1550418295, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.448197722434997559", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48855043": {"recommendationid": "48855043", "author": {"steamid": "76561198127752008", "num_games_owned": 207, "num_reviews": 3, "playtime_forever": 3797, "playtime_last_two_weeks": 0, "last_played": 1550451084}, "language": "english", "review": "Hackers haven.", "timestamp_created": 1549657531, "timestamp_updated": 1549657531, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.43640899658203125", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48995737": {"recommendationid": "48995737", "author": {"steamid": "76561197968308155", "num_games_owned": 72, "num_reviews": 9, "playtime_forever": 13288, "playtime_last_two_weeks": 0, "last_played": 1550184239}, "language": "english", "review": "Trash", "timestamp_created": 1550184280, "timestamp_updated": 1550184280, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.414092659950256348", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49095238": {"recommendationid": "49095238", "author": {"steamid": "76561198104199385", "num_games_owned": 10, "num_reviews": 8, "playtime_forever": 291, "playtime_last_two_weeks": 0, "last_played": 1550630099}, "language": "english", "review": "i died to someone in power armor named \"minecraftsteve21\"\n\n\n\n\n\nok\n", "timestamp_created": 1550555998, "timestamp_updated": 1550555998, "voted_up": false, "votes_up": 1, "votes_funny": 9, "weighted_vote_score": "0.438161581754684448", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49204789": {"recommendationid": "49204789", "author": {"steamid": "76561198097384861", "num_games_owned": 3, "num_reviews": 3, "playtime_forever": 3935, "playtime_last_two_weeks": 3937, "last_played": 1551816157}, "language": "english", "review": "Too punishing to new players.", "timestamp_created": 1550994182, "timestamp_updated": 1550994182, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.447607129812240601", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49342047": {"recommendationid": "49342047", "author": {"steamid": "76561198278425974", "num_games_owned": 28, "num_reviews": 6, "playtime_forever": 839, "playtime_last_two_weeks": 0, "last_played": 1500144047}, "language": "english", "review": "If you're new, you're screwed lmao good luck trying to kill someone with your starter weapon.", "timestamp_created": 1551639853, "timestamp_updated": 1551639853, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.414327859878540039", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49201659": {"recommendationid": "49201659", "author": {"steamid": "76561198169754078", "num_games_owned": 93, "num_reviews": 28, "playtime_forever": 102, "playtime_last_two_weeks": 102, "last_played": 1550978708}, "language": "english", "review": "I hav 20 fps on all low, I cri at night becaus elow fps... I juz wan play, plz fix man. i selled my wife for computer and game no work. I want my wife back. My computer is good, Ryzen 2700x (8 cores , 4ghz) GTX 1080 and it has 3 fan on it for extra gamer performance.", "timestamp_created": 1550980208, "timestamp_updated": 1550980208, "voted_up": false, "votes_up": 1, "votes_funny": 10, "weighted_vote_score": "0.318655014038085938", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49230327": {"recommendationid": "49230327", "author": {"steamid": "76561198071627966", "num_games_owned": 92, "num_reviews": 20, "playtime_forever": 7, "playtime_last_two_weeks": 7, "last_played": 1551103852}, "language": "english", "review": "Tried registering. Password length limited to 15 characters, and most special characters are disallowed. Yay for having to think of a new password.\n\nOn top of that, you need to be unable to sort things to register. \"Month/day/year\".\n\nNot going to bother seeing if this game is any good if the first impression is this abysmal.", "timestamp_created": 1551103880, "timestamp_updated": 1551103880, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.289590656757354736", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18833584": {"recommendationid": "18833584", "author": {"steamid": "76561198024520507", "num_games_owned": 534, "num_reviews": 1, "playtime_forever": 27197, "playtime_last_two_weeks": 0, "last_played": 1527226060}, "language": "english", "review": "EDIT: Construction update is out now, if you've ever wanted to try this game out for the first time, or ever thought about trying it out again after burning out, NOW IS THE TIME TO PICK IT UP. Granted, It's a brand new system so it's a bit janky, but there's already been a huge influx of people so the fights have been amazing. I would put more into this review here, but [url=https://youtu.be/wlNDXI6wUGA]Joshino has just made a great video that explains the new situation better than I can[/url]. TL:DR is this: If you've ever wanted to try out the game, now is the time.\n\n\nRecently got back into playing this game, and have been having a blast. Here's some things I've noticed:\n\n* The new tutorial continent is exactly what they needed for the game, it's a small scale version of the actual continents that mostly keeps the newer players \"safe\" from veterans, excluding Smurfs, since you must be under BR15 to be able to spawn there. It's still not a full tutorial, but at least it's a controlled environment to learn the ropes.\n* The cert grind is also much easier than before, with ribbon bonuses (first 5 of which are doubled), weapon medals, directives etc.\n* Alerts are no longer the deciding factor for locking a continent with the new Victory Point system. Never did like basically getting the boot every time an alert ended, whether you won or not.\n\nWhen it comes to FPS, nothing comes even close to what this game comes to offer when it comes to the sheer scale of battles, and the only other thing that I can think of that comes close to the sense of scale that Planetside 2 offers would be Guild Wars 2's World V World. It's free to try out, so the only thing you lose is time. \n\nSome tips for new players:\n* Stick to the beginner continent until you hit BR15. You can always leave and come back before then if you want to test the deeper waters, but once you're past that you cannot go back. Take advantage of the smaller scale zones to familiarize yourself with the mechanics before diving headfirst into the zergs.\n* Try out *everything* before you buy it. There are two ways of doing this, VR training and Trials. VR training lets you use any combination of gear and attachments for no cost, but only in VR training (unless you unlock the stuff with certs/DBC while in there) They have target ranges for vehicles, infantry, air, complete with range markings for infantry. Take advantage of this. See how each gun works, how it kicks from recoil, cone of fire, and try out how each attachment effects how it fires. Only problem with VR training is that none of the targets move, they're just static and don't truly show how they work in a real fight. That's why Trials exist, so you can use a weapon, albiet just base without attachments, in a real fight for a few hours before spending those hard earned certs on them.\n* Lastly, Planetside 2 is a game about numbers more than it is a shooter, so go in with friends and find a good outfit. Best way to find an outfit is to join an alert platoon, usually run by an outfit, and essentially trial running them. Most outfits recruit this way, so don't be afraid to ask about them while running with them. You'll find the game much more enjoyable while in an outfit, if only to have people to talk to while running with randoms or while participating in organized operations.\n\nHope this helps at least some people with starting out.", "timestamp_created": 1446453990, "timestamp_updated": 1461868842, "voted_up": true, "votes_up": 451, "votes_funny": 17, "weighted_vote_score": "0.9579886794090271", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12471532": {"recommendationid": "12471532", "author": {"steamid": "76561198043563556", "num_games_owned": 49, "num_reviews": 1, "playtime_forever": 2324, "playtime_last_two_weeks": 0, "last_played": 1460344072}, "language": "english", "review": "(Pre-Construction Update)\n\nWar in PlanetSide 2 isn't exactly hell, though your very first experience of it might be. You create your sexy character and pick a neat faction. Then you're unceremoniously dropped, literally from space, right into the biggest battle the game can find, surrounded by enemies and tanks and pew pews and anything else that happens to be around, with a life expectancy measured in milliseconds.\n\nSomehow beat the odds and things don't get better. You stagger from death upon death in a haze of confusion and unexplained icons, not as some ultimate soldier, but simply one more fleck of a gristle in a planet-sized meat grinder that never-ever stops churning. At some point in time, you will even be run over by a tank.. probably driven by someone on your team.. named Kevin.. *scoff*\n\nIt's nothing personal, though. PS2 is far too busy for that. First off, In most shooters, 16 players counts as a party; more advanced ones might push the limit to 32, or 64. In Sony's epic F2P, you're dealing with at the most 2000 players per continent! Thankfully not all on screen at once, but locked in a three-way tug of war that doesn't simply take cues from the likes of Call of Duty and Battlefield, but has a pretty damn good way of stealing their thunder. Those games ultimately win out in terms of feel, but PlanetSide 2, even though being comparable is a stunning achievement when compared to the standards of your average action MMO, is easily one of the most ambitious online games ever - and setting aside some launch issues, one that lives up to its impossible promises.\n\nFighting in an open world does feels strange - not as intimidating as you'd expect, but far more than just a salesman gimmick. For the most part, standard first-person shooter rules apply. Shooting is skill-based rather than reliant on arbitrary levels. If you don't want to be shot, you get behind cover. Returning fire can be done easily from hip-fire, but you generally want to take advantage of weapon sights and sniper scopes to deal out more accurate shots and hit distant enemies. It's the basic rules of a shooter. The twist here is that, instead of existing as isolated maps, battlegrounds emerge organically as boundaries shift. Today, that bridge over a canyon is simply a handy route between outposts. Tomorrow, it might be a vast ocean of tanks, with infantry crawling all over the scenery like ants. Being in an open world, anyone who wants to take part can do exactly that. There is a loading screen, but no queues, no arbitrary restrictions on numbers or how much you're allowed to bring into battle - not overt ones, anyway.. An Instant Action button will spirit over anyone who requests a teleport, but you can just as easily spot something happening and head over under your own will.\nThe longer fights go on, the more people will be drawn to them. Sunderers are brought in as mobile respawn points, fighters strafe the ground and battle for air superiority, tanks take up positions and all hell breaks loose until one side seizes victory. If you're outnumbered, too bad. Reinforcements may arrive, or not. War isn't always played fair man.\n\nThe sheer scale of the battles is stunning - to the point that, while it makes sense for PlanetSide to be a F2P game, it takes longer for that to fully sink in. Sony hasn't so much embraced the model as given it a back-breaking bear-hug, almost to the point of creating a hidden mini-game called \"What's the Catch?\" Without paying a single penny, you get *shocker* all five soldier classes and access to mech suits, full access to all continents, all of the vehicles, no equipment restrictions, as many pew pews as you want and the ability to join and start your own guilds (Outfits). Never are you made to feel like less of a player for not paying a subscription fee or for earning any equipment you need by saving up in-game currency. It's a similar system to League of Legends or Tribes Ascend, just on an MMO-base with (thank god) less sexualizing of the females/overpowered-jetpacks.\n\nThe most important purchases are, as ever, boosts that speed up your team's in-game resource generation and cooler-looking guns which are used to shoot people in the head for the crime of wearing the wrong colour armour in a shnazzy style. These are slightly expensive tho, with newer guns costing around £4/$5 each (500-700 Sony Points I think on PS4).\nYour starting load-out IS respectable though - and while I'm sure it's not deliberate, any temptation to spend a fortune in the store is swiftly dampened by most of its gear being bland variations on stock themes like 'AR' and 'Pistol'. There's nothing as iconic as the Tribes spinfusor, and nothing particularly sexy if you're not into efficiency. In a nice touch, you're allowed to borrow any weapon for a half-hour field test before investing your cash/points (which I find rather neat). In a straight fight between two players of equal skill and time played, it's true that the one who's paid will usually come out on top - if only because upgrades can only be bought with in-game credits, and outright buying a gun leaves many more of them to spend there. The sheer scale of PlanetSide 2's battles does a lot to prevent any slide into \"P2W territory\" though. Whatever your gear and however many upgrades you have, you're only one soldier in a rock-paper-scissors showdown - where paper and scissors are represented by the sniper over on that hill and his tank friend.\n\nAnywho, whatever role you're playing, the action is very solid; a little stop-start by the way PlanetSide 2's body armour usually makes tissue paper look like a trimmed mithril armor set selling for 40k on the GE, but more than adequate. The only significant failings are in accessibility and readability. There's a simple tutorial, an Interface that comes across as an alien control panel and hundreds of excessive blinking lights and labels apparently harbouring an active grudge against the poor colorblind. It's a rather challenging newbie experience for a game that does have a tricky learning curve, but whose raw basics really aren't that complicated. \n\nOh, similar confusion ALSO sneaks into the graphics! Textures are busy, combined with the oddly muted faction colours, which can make it hard to spot enemies at even close-range, or to react fast enough to anything. The Vanu are particular offenders here, with their purple colours blending into much of the scenery, though the Terran Republic's combination of powerful red with murky grey comes a close second. (If you play Terran, they also earn bonus confusion points for internally using red to flag up enemies. Cognitive dissonance can kill!) I'd like to have seen PlanetSide 2 take a few more cues from the likes of Tribes Ascend and even Team Fortress 2 in terms of its general readability, colour choice and silhouettes. Back to war itself. Out in the field, combat unsurprisingly varies dramatically depending on your class - which you can change at will. Either at reload stations or between lives, if you get bored or your team needs something, be it. A Heavy Assault soldier's life is one of explosives and endless streams of hot lead. Infiltrators work under shadows and use sniper rifles. Light Assault troopers bop around on jetpacks going pew pew. The more points you put into a class and its gear, the more efficient you get with it, so it pays to focus. Do it for the pew pews man. \n\nAt last, lone wolf players are likely out of luck; well, not entirely. It's possible to play solo. You can join groups as you travel, be added to squads at the touch of a key, and contribute to raids and defence alongside everyone else. PS2's gigantically-scaled firefights put rather tight limitations on what any individual can accomplish alone, and being a cog in the silent machine is rarely a rewarding career. To make the most of PlanetSide 2, you just gotta gather some friends on a Friday night and set your own goals for the battlefield. I salute you!", "timestamp_created": 1413158412, "timestamp_updated": 1509073478, "voted_up": true, "votes_up": 1917, "votes_funny": 245, "weighted_vote_score": "0.957158386707305908", "comment_count": 64, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24699706": {"recommendationid": "24699706", "author": {"steamid": "76561198023351144", "num_games_owned": 69, "num_reviews": 1, "playtime_forever": 169305, "playtime_last_two_weeks": 606, "last_played": 1551594895}, "language": "english", "review": "After about 1500 hours across all characters, I am still learning this game. I am good, but by no means great at it. That being said, welcome to the Dark Souls of FPS games. The learning curve is brutal, the new player experience is rough, and there are a fuckton of players like me and better shooting at you from all angles. There is no matchmaking and there is no MMR or Elo to pander to your skill level.\n\nHowever, I can help make your new player experience a little better.\n\nStep 1. Unfuck your settings. I wont go in depth, but there are a few things you can do right off the bat to make your performance better. Turn flora and shadows off, and turn render distance down to 1500 meters. \n\nStep 2. Join an outfit. Soloing as a new player is the fastest way to get turned off to this game. Find a group you like and get to know them. Teamspeak 3 or mumble is also immensely helpful for this. They will speed your learning exponentially\n\nStep 3. use starter weapons. with the exception of a few outliers, all the starter weapons are really good. Save your certs for suit upgrades and attachments/utility slots. Weapons are mostly sidegrades for different situations/playstyles\n\nStep 4. Start out playing medic. It gains you a lot of easy XP through healing and revives and does not require you to kill get certs. It also teaches you to be a better player by not relying on the heavy assault class' shield.\n\nStep 5. Accept that you will die. A lot. And there is little you can do to avoid it until you learn this game. You will imrpove with time, but it will be frustrating .\n\nStep 6. The game is not p2w. Everything that affects gameplay can be earned for free. Only comsmetic things cost real monies.\n\nStep 7. Koltyr, the new player continent, will probably be mostly empty. You will find better fights (and more people) on Amerish, Indar, Hossin, or Esamir.\n\nThis list is by no means comprehensive, but it entails a lot that I wish I had known as a new player, 4 years ago. Of all of these, most critical is finding a good outfit. The rest will likely follow if you have a good group to play with. \n\nGLHF", "timestamp_created": 1470271294, "timestamp_updated": 1470271483, "voted_up": true, "votes_up": 164, "votes_funny": 8, "weighted_vote_score": "0.923622488975524902", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "46078249": {"recommendationid": "46078249", "author": {"steamid": "76561197974908399", "num_games_owned": 308, "num_reviews": 11, "playtime_forever": 85424, "playtime_last_two_weeks": 3038, "last_played": 1551870881}, "language": "english", "review": "I got this game years ago but never played it...\nLast year I got into Planetside2 and haven't really played anything else!\n\nIt has a little something for everyone:\n\nPlay it solo? You can!\nWant squad play? They got it!\nWant to command a platoon? You bet your ass!\nArmor? Damn right!\nAirforce? You can become a force to be feared!\nTactical play? You can totally immerse yourself and get right into it right down to sharing those master plans in your squads!\nTons of weapons and armor loadouts and combinations to suit your playstyle. There's even a charater cosmetics so you can tailor your online presence.\n\nThere's 3 main factions to choose from and a 4th is coming in December!\nThis game has special events throughout the year and special events every day! there's so much to do... You will find yourself playing and losing hours time and time again. It's the most engaging and immersive game I have ever played.\n\nPlanetside2 is a pay not to grind so much. You can earn pretty much anything in the game just by playing it.\n\nI joined an outfit called The Wild Cards and made a ton for friends within that game. We are over 1000 active players daily!\nAnd The Wildcards don't just play Planetside but it is one of our main games; but that's for another article...\n\nI would say this is a MUST HAVE GAME for the avid FPS player.\nYou can't beat the price {Free} but is totally worth a subscription as well.\nJust remember you get out of a game what you put into it be it time or money. Planetside2 will leave you satisfied regardless!\n\nDon't pass up this gem. What do you have to lose?\nI'll be waiting for you Planetside!", "timestamp_created": 1542842474, "timestamp_updated": 1542842474, "voted_up": true, "votes_up": 133, "votes_funny": 10, "weighted_vote_score": "0.886212408542633057", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44377437": {"recommendationid": "44377437", "author": {"steamid": "76561198082629280", "num_games_owned": 81, "num_reviews": 19, "playtime_forever": 29586, "playtime_last_two_weeks": 50, "last_played": 1550867868}, "language": "english", "review": "Rewriting my review, as there are very different experiences to be had with this game that can make you forget other parts of it. Negative things in our lives always stand out much more than positive things. \n\nI wrote a review giving negative feedback to Planetside 2 because of my recent experiences with the game since coming back. Every fight was the same. I would try to be useful, helpful to others, only to be instantly deleted in 2-3 hits by some rank 5000+ player while I'm rank 154. New players are thrown in with the best of the best who play this game every day. And I've even seen videos talking about how this just isn't fair, that no other PvP only game puts players into PvP scenarios without some kind of rating system to ensure you are being put with, and against players of similar skill.\n\nHowever, here is something to keep in mind. Planetside 2 is not a game about you versus them. It is not, and never was intended to be a game where your personal skill is supposed to shine against everyone else. Yes, you as a new player are very likely to be farmed by players on the opposing factions who have much more time played, much higher skill, and a small chance of potential hackers perhaps (But don't go around assuming everyone is a hacker.)\n\nNo, Planetside 2 is a game where you, as a player, are a boots on the ground, frontline soldier. You're not a hero, you're not the Master Chief, you're not Doomguy or the magical soldier who can take on an army by yourself. Sure, if you get really, really good at this game, master your aim, master your positioning, then yes you can go on farm killing dozens of enemies as an infiltrator with a sniper rifle, or a light assault with a few very well placed C4. \n\nBut as a new player, and for a long long time... here's what you are actually supposed to do, to enjoy this game.\n\nJoin a platoon. Follow orders, follow the team, and be a part of something bigger. Stop trying to be the hero, stop trying to 1v1 everyone you see like it's a contest of skill. You will have so much more fun being a part of those massive pushes of infantry or armor or aircraft that help take a base and break a stalemate. Constantly redeploying with your squad to drop from galaxies, defend bases, or whatever else your platoon has you doing. You may just be one soldier on the frontline. You may just be one guy with a gun against hundreds of enemies that you stand no chance of taking out. But it's not you against them. It's all of you, against all of them.\n\nPlanetside 2 isn't you as a player, against all the enemies you see. Try and keep that in mind. Look at the poster for the game. It's a group of soldiers, one wounded, two helping him up while they fire back at the enemy. That's what Planetside is.\n\nIt's not Bell against the New Conglomerate. It's not Bell against the Vanu Soveriegnty. \n\nIt's the Terran Republic against the Vanu and NC. And when you run through a battle, shooting who you can, repairing and healing who you can, and charging into a battle with dozens of players with rockets flying overhead, bullets and lasers flying every which way, vehicles exploding and platoon/squad leaders barking orders?\n\nThat's Planetside 2. Not being a Hero. Being a Soldier. And living through those massive battles where you can't keep track of everything going on around you. And you're not supposed to. Just have fun, and fight for your faction.\n\nTL;DR\n\nDon't base the game's worth over personal experiences of you against the world. This game isn't meant to test your personal skill. It's meant to allow yout o be part of a faction and just be a soldier fighting alongside other people, not fighting 'ahead of them' and being 'better than everyone else'. Fight for your faction to be best, don't try to be a hero.", "timestamp_created": 1535234500, "timestamp_updated": 1535275314, "voted_up": true, "votes_up": 139, "votes_funny": 1, "weighted_vote_score": "0.911854326725006104", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47575581": {"recommendationid": "47575581", "author": {"steamid": "76561198079732662", "num_games_owned": 101, "num_reviews": 2, "playtime_forever": 108765, "playtime_last_two_weeks": 0, "last_played": 1550540002}, "language": "english", "review": "Before you Install, keep in mind that a majority of the players you'll encounter are veterans and have been playing for at least a year. Be prepared to die a bit, but don't fret! I started the same way as a 0.2 KDR medic who just revived people. Now I've \"gotten gud\" and have a 3.4 Infantry KDR as a non-heavy! \n\nThis game will chew you up and spit you out multiple times, you have to put in the determination and keep playing to rise above the average player who gets turned into mulch!\n\nAlso, for those who complain about P2W, weapons are sidegrades. \nA good example of this are the Terran Republic's Assault Rifles\n-SABR 13, Long range, 2 round burst marksman rifle, can be deadly in CQC with aim\n-TAR, high RoF, lethal in CQC, OKish at mid range\n-T1 Cycler (starter rifle) - good at every range, especially short and mid, with controlable recoil and rewarding headshot aiming with fast time-to-kills\n\nThere is a reason that the glowly weapons that veterans use (directive rewards, long-term achievements) are actually just the starter weapons with attachments already equipped, they have their own little special traits, but aren't better than the starter ones. Actually, if we're talking what weapons are meta, more than half of the directive reward weapons are terrible.\n\nTLDR: Excellent Game, bigger than Battlefield and harder than CSGO, not P2Win, just put in the time to \"git gud\"", "timestamp_created": 1544987665, "timestamp_updated": 1544987665, "voted_up": true, "votes_up": 84, "votes_funny": 1, "weighted_vote_score": "0.855994462966918945", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31294463": {"recommendationid": "31294463", "author": {"steamid": "76561198278465113", "num_games_owned": 40, "num_reviews": 2, "playtime_forever": 14405, "playtime_last_two_weeks": 0, "last_played": 1520926286}, "language": "english", "review": "My first experience after the tutorial, I got dropped into the middle of a huge 200+ person battle, ran around like a chicken with it's head cut off and got killed not knowing where I was getting shot from.  Decided to respawn as a medic and stuck with large groups of friendlies, using my necromancer powers to bring them back from the dead.  A few minutes later we repelled the invaders and charged towards the next base.\n\nIt was at this moment- while zerging towards the next base with the other infantry guys, dozens of tanks and armor around us, with our air forces buzzing overhead, that I stopped just to take in this breath taking spectacle and thought to myself \"Damn, this is epic\".  And then I was roadkilled by a friendly tank.  Don't just stop in the middle of the road folks.  \n", "timestamp_created": 1492859528, "timestamp_updated": 1492859528, "voted_up": true, "votes_up": 157, "votes_funny": 176, "weighted_vote_score": "0.920789420604705811", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24434192": {"recommendationid": "24434192", "author": {"steamid": "76561198048559240", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 104683, "playtime_last_two_weeks": 0, "last_played": 1548011278}, "language": "english", "review": "This game isn't for everyone.\nIf you have the Call of Duty run and gun mindset...You will die. A lot. \nHowever, if you have the ability to be patient, asses the situation, and have a good situation awareness. Then you will be good at this game. \n\nStarting off, it is a bit of a grind, however, the starting guns are the best in the game and you only have to cert into equipment. \n\nThe feeling of fighting in a 200 person battle over a base is incredible, and you need to play until this happens or you have missed out on one of the coolest gaming phenomons out there.\n\nLast thing. JOIN an outfit. Having a group of players to run with helps out a lot. Makes the game more enjoyable. I suggest AOD for TR, PHX for NC, and DAPP for VS. These are know as \"zergfits\" and they are a wonderful starting point for new players. I started with AOD and learned from there, as i got better in the game, i moved on to other oufits that have a more specific goal. Bottom line, they help new players out a lot. (mainly with logistics getting to fights, etc) \n\nhave fun and beware this game is addicting.", "timestamp_created": 1469061150, "timestamp_updated": 1469061150, "voted_up": true, "votes_up": 137, "votes_funny": 11, "weighted_vote_score": "0.889365553855895996", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42128831": {"recommendationid": "42128831", "author": {"steamid": "76561198010371788", "num_games_owned": 425, "num_reviews": 113, "playtime_forever": 5200, "playtime_last_two_weeks": 0, "last_played": 1526861300}, "language": "english", "review": "I remember fighting the wars back in 2013. They were intense, and soldiers on each side were numerous. I fought for the Vanu (praise be their name) and killed countless Terran soldiers. There were explosions everywhere and there was nowhere to hide. Bullets flew in all directions and the fact that you were in the battle almost sealed your fate: you were going to die. Yes, I remember those days well.\n\nIt is 2018 and I have returned. However, I found that my allies had died. The intense, raging war had died down to a tactical battle that involved only a handful of survivors. It is just as fun today as I remember it but the playstyle has changed a little. There are less people involved in the battle which makes finding and killing someone even more rewarding. It is almost as if we're fighting in the rubble left behind by the thousands of players in 2013.\n\nDo I recommend this game? Heck yes. It's free-to-play and plays identically to the Battlefield games. The shooting mechanics feel nice (there is bullet drop) and conquering territory feels progressive.\n\nThe game is a persistent world FPS MMO. This means that after you log off, the war still rages. Territories are conquered and lost: logging back on, you may 'wake' up to a different in-game world. I remember completely dominating the entire planet as Vanu, logging off and coming back to find out that we had lost half of it overnight. Your actions in this game carry more weight than, say, in a game like Rainbow Six Siege. Nobody will hear of the time you shot the dude who almost kidnapped the hostage. In Planetside, everyone knows what you have done because the evidence is on the map. It certainly is a unique war simulation.\n\nIt gets a 10/10 - there are NO other shooters like it on the market. I guarantee that.", "timestamp_created": 1526767380, "timestamp_updated": 1526767380, "voted_up": true, "votes_up": 113, "votes_funny": 8, "weighted_vote_score": "0.889906227588653564", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40888155": {"recommendationid": "40888155", "author": {"steamid": "76561198061851546", "num_games_owned": 189, "num_reviews": 2, "playtime_forever": 1607, "playtime_last_two_weeks": 0, "last_played": 1543976463}, "language": "english", "review": "Ignore the 13 hours played, I bought, (edit: was free, my bad.) picked up this game just post beta, have probably played over 1000 hours at this point. I got it on steam recently to help promote it and keep it growing. With that out of the way, here is my review.\n\nNew player experience:\nWhat the game hands you: You get the game, load it up, the first thing it drops you into is a little tutorial zone that does the VERY bare bones of explaining how to move, shoot, and drive a vehicle. After this, you get hot dropped into a combat zone of 48+ fighters on both sides with absolutely no specific direction of what you are supposed to do. Explosions all over the place, people shooting from every direction, and you die within 10 to 30 seconds of landing... If you got a kill, I am impressed. Don't give up, it gets better from here.\nA few do's and don't's for completely new players: DO NOT BUY WEAPONS WITH CERTS!! Really you shouldn't buy any alternate infantry or vehicle weapons at all until you've made it to around BR20 or 30. The reason, your standard class weapons are all perfectly competitive. The standard vehicle weapons are also very competitive, basilisks are AWESOME. The purchasable weapons are side-grades that alter bullet drop, accuracy, fire rate, bullet damage, etc...\n\nAnd thats before you even get into the attachments and all the other stuff you get into with them. So the best thing to do is get decent with the standard weapons, learn how all the mechanics work on the free stuff, even hoarding a lot of your certs until you have a solid idea of how you want to play. Sure, you won't be as competitive as the guy who's certed out his LA with multiple C4 bricks and drifter jets... But until you've played enough, you probably won't even know what any of that is good for. \n\nDon't Solo. This game is fun as a shooter, its fun as a vehicle combat simulator, but it is AWSOME as a squad or platoon level tactical and strategic game. Add in the Platoon Leaders, and Squad Leaders who only want to have fun and things get REALLY interesting when you squad up. So just get in a pick up squad, and see if they are talking, or at least laying down waypoints. if they aren't switch to another squad till you find one that is. You should WANT coms in this game.\n\nLast few things... Learn the maps. Learn outfit tags you see when fighting, on all factions. you'll start to recognize them.\n\nSo you've figured things out:\nOkay, you've played to BR20 or 30, which if you play casually will be within a month of owning the game. You are comfortable with your infantry weapons, you know what the different classes are for, you know the ground and air vehicles and which ones you like and don't like, and you have a building friends list with various squad and platoon leaders you like joining, and other random pubbies you like squading with. This is when you start kitting out your preferred classes and vehicles, spending those hard earned certs up to this point. Congrats, you're no longer a complete noob.\n\nSquads and Platoons:\nI said it above, but this deserves its own spot. Squads and Platoons are what make this game great vs all the other shooters out there. From running Sunderer balls, to tank columns, or gal dropping a full platoon into a hot fight... Or getting 48 people to each pull a gal and ram any enemy vehicle they can spot in a zone just for the heck of it... Just pure fun.\n\nOutfits:\nFinal note before I break all this down. Outfits are incredibly important if you want a consistent experience in the game. Squads, platoons and friends will get you part way there, but having a solid, active, and fun outfit that you fit with is vital to keeping this game fresh for you. You get that, and you will keep coming back to this game for years.\n\nSo, the breakdown.\nPros:\nIt's free, you seriously not going to give it a try?\nAwesomely huge fights.\nGreat squad and platoon, 12 and 48 player, level gameplay.\nFun community, with the random bad actors mixed in occasionally, just mute em and ignore.\nGood combat mechanics for the most part.\nFinally pretty well optimised.\nGood in game voice coms.\nGreat variety of weapons, vehicles, attachments, etc. (Again, wait to expand till you know what you're doing.)\n\nCons:\nSome old reviews from years ago give it a bad rap.\nDeclined but rebuilding population.\nSome seriously salty vets that can get irritating.\nSlow development of new content, though seems to be picking up pace.\n\nDownload it and try it yourself. ;)", "timestamp_created": 1521342418, "timestamp_updated": 1524417159, "voted_up": true, "votes_up": 101, "votes_funny": 5, "weighted_vote_score": "0.906259417533874512", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47160110": {"recommendationid": "47160110", "author": {"steamid": "76561198082930044", "num_games_owned": 138, "num_reviews": 21, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1543446371}, "language": "english", "review": "PlanetSide 2 is a hard game. I can't recommend it either way to anyone.\n\nI died, a lot, but that is to be expected. If you drop into this game now, you're gonna die a lot. Don't get mad, just get a couple friends to play with and pick a class that you enjoy. Every contribution you make is important to the team effort. You dying could expose an enemy sniper to your team's sniper. Your tank being destroyed by a level 100 guy's tank could put it into a position where it can be destroyed by your team. \n\nIn this game, it's not about K/D. It's about how you contribute to the effort. Think of yourself as a 40k guardsman. You're cannon fodder, but even holding out against one charge can give opportunity to a squad of space marines to drop in and decimate the heretics.", "timestamp_created": 1543385578, "timestamp_updated": 1543385578, "voted_up": true, "votes_up": 89, "votes_funny": 20, "weighted_vote_score": "0.86431962251663208", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20805862": {"recommendationid": "20805862", "author": {"steamid": "76561197968393921", "num_games_owned": 412, "num_reviews": 1, "playtime_forever": 172625, "playtime_last_two_weeks": 0, "last_played": 1490971859}, "language": "english", "review": "I have been playing for over 3 years now, created YouTube content for 2 of them and I am still in love with this game. Planetside 2 brings unprecedented size of fights to the FPS front, in a format that challenges battlefields joint combat arms set up. You might see hundreds of tanks come over a hill whilst infantry spill through a valley as bombers and fighters weave through flak in the air. Which all happens on a huge continent sized map with no transitional borders. This just isn't possible in any other games to date. But it is not just that Planetside 2 is a one of a kind game that makes it good. The tank gameplay, FPS mechanics and flying are all enjoyable in their own right. And the variation in each loadout can give birth to a wide style of play that can keep you playing for a long time.Oh and did I mention it was free? The weapons are all side grades and almost everything you can buy with money you can also grind as a new player, so forget calling pay to win. It is a little rough around the edges, with patches occasionally breaking the game, but that seems thematic with most MMO games. But a big plus of being an MMO is the outfits and faction chatter that can also immerse you not just in the battlefield but the community, which other shooters don't have. So if you want to play a game that actually feels like a battlefield, then I would 100% recommend Planetside 2 to you.", "timestamp_created": 1453993349, "timestamp_updated": 1453993349, "voted_up": true, "votes_up": 191, "votes_funny": 3, "weighted_vote_score": "0.904024600982666016", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48620169": {"recommendationid": "48620169", "author": {"steamid": "76561197991309614", "num_games_owned": 380, "num_reviews": 15, "playtime_forever": 88182, "playtime_last_two_weeks": 0, "last_played": 1549215063}, "language": "english", "review": "I've played it a little bit, it's ok.\n\n[b]The Good[/b]\n[list]\n[*] F2P\n[*] Not P2W\n[*] Massive battles\n[*] Plenty of ways to play. Tired of sniping? Drive a tank, fire some rockets, be a medic, etc...\n[/list]\n\n\n[b]The Bad[/b]\n[list]\n[*] Community is a mix of helpful vets, and salty shatbags who think it's cute to troll\n[*] Microtransactions, while not required, can lean on the more expensive side for some items\n[*] Game is best played in squads/platoons, but it can be hard to find the right one for you\n[*] There is no matchmaking meaning you can be a timid newbie getting mauled on by a max ranked played with 50,000 hours played\n[*] Only a small dev team left. They work hard with what they got, but don't expect monthly content\n[*] Game is large scale and can be overwhelming until you learn it\n[/list]\n\n\n[b]The Ugly[/b]\n[list]\n[*] Fights can boil down to mindless zergs that cannot be stopped (stop fighting them and they'll disperse)\n[*] Tutorial is garbage and will throw you to the wolves like lambs to the slaughter (I suggest Cyrious Gaming on YouTube for proper tutorials and great guides)\n[*] Some bugs and exploits that the devs don't know how to, or don't care to, fix\n[/list]\n\n\n[h1]Common things you probably heard that people are wrong about[/h1]\n\n\"It's p2w\"\nNo it's not, it's pay to look awesome. If you consider awesome cosmetics a requirement to win, then yes it would be p2w. This game is skill, your wallet can't buy that.\n\n>\"But you can buy gunz!!!\"\nYeah, they are sidegrades. The are better at certain niches. For example you could buy a $10 SMG and have an advanage over people in CQB, but someone with better aim is still going to own you, or take that pretty SMG out doors and watch how fast your eating dirt because this guy brought a gun better suited for it. \n\n\"It's so grindy!\"\nEven without membership or boosts you can still unlock things pretty quickly. Play a support class and heal, repair, resupply, revive, etc... and watch the :Cert: roll in. \n\n\"It's so laggy\"\nTurn shadows and physics low/off. Your FPS will double. The performance isn't perfect (it's 6 years old), but it still runs fine on most systems if tweaked properly. \n\n\"It's dead\"\nNo, it's not. Plenty of battles especially during peak times. \n\n[h1]Biggest mistakes new players make[/h1]\n\nDon't buy guns with your certs, just don't. Spend your early level certs on upgrading your preferred class of choice. This will increase your performance and survivability in battles. \n\nThey can't shoot. This isn't CoD or Battlefield, you can't just lay on the trigger and hip fire everything. Aim for the head and body. Guns can be hard to control, go to the VR training and practice your weapon skills if you are having trouble.\n\nThey try to lonewolf. Planetside 2 is best played with your faction. When you learn the game better you can lonewolf, but early on you should work with your team, trust me your experience will be a hundred times better if you stick with your allies. They can heal you, give you ammo, revive you, etc... You also earn experience for working with allies and supporting them.\n\nDon't worry about your KDR, really just don't. You're going to die, a lot. This game doesn't hold your hand and there isn't matchmaking. You may spawn in a fight where there is a group of max rank players who have 5000 hours under their belt. If you got a frustrating fight just redeploy to somewhere else. Kick some butt and have fun, and worry about your KDR later if you want to.\n\nJust ask. There may be a few trolls (there is in every game), but you'll find someone who can help you if you are new. I'll leave the comments open and you can ask me too. \n\n[h1]Conclusion[/h1]\n\nIt's free to play and you have nothing to lose but some time trying it. If you are on the fence I suggest just giving it a go. It's not a massive download and getting in game is quick. If you put time into the game and learn it you'll find one of the most rewarding and underrated FPS experiences on the market.", "timestamp_created": 1548732704, "timestamp_updated": 1548743002, "voted_up": true, "votes_up": 155, "votes_funny": 10, "weighted_vote_score": "0.903153657913208008", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12685529": {"recommendationid": "12685529", "author": {"steamid": "76561198121046649", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 57005, "playtime_last_two_weeks": 0, "last_played": 1477876409}, "language": "english", "review": "Looking to try out this game? It is free to play, so you should definitely give it a shot. Now here's what you'll need to know:\n\nAre you good at battlefield, call of duty, counterstrike, or other first person shooters? If so, good for you, unfortunately that doesn't neccesarily translate into this game that well. I actually started this game being not very good at any FPS's and have gotten considerably better, to where i can comfortably say i am a decent player in this game. The game is so NOT user friendly, that it's learning curve has been called a \"learning cliff\" by the game's own producer, David Carey. It is something that is always being worked on however. Now, a little about the actual gameplay\n\nI have never ever played a game that offered me this type, this range, this level of gameplay. You have the option to pick from different classes, and choose different guns for those classes. With some effort, you can be the driver or even pilot of one of many different vehicles in the game. As stated before, the game is free to play, and does a good job of doing so. All of the weapons in the game can be bought with the in game currency you build up as you play. Real money can be used to buy these guns, as well as cosmetics such as helmets for your character or different camo's. I personally feel like there is something for everyone in the game; if you like to snipe, you can snipe! You can jetpack around as a light assault, or go gung-ho as a heavy assault! There are so many different things to do. \n\nThe game takes a decent chunk of time to get into and get better at playing, but in just a few months it became my favorite game. I found a super fun group of people who invited me right in and now i play with as much as i can. There are always periods of time where the game has many (and i mean many) issues that make it difficult to play. And although the community is quick to blame SOE (Sony Online Entertainment) and demand fixes, SOE has truly created a masterpiece with this game. As long as there are servers, as long as i am a gamer, as long as i can, i will continue to play planetside, and would more than reccomend it to anybody reading this review.", "timestamp_created": 1414610058, "timestamp_updated": 1414610058, "voted_up": true, "votes_up": 576, "votes_funny": 39, "weighted_vote_score": "0.944265365600585938", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33692647": {"recommendationid": "33692647", "author": {"steamid": "76561198333798149", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 72179, "playtime_last_two_weeks": 181, "last_played": 1551610871}, "language": "english", "review": "Over 600 hours in... how did that happen?\n\n\n\nThe only thing that I can say for certain is that this game is interesting. It suffers from a unique situation that makes life in-game interesting. When you start this game, you will die. A lot. No sugarcoating it, this game is hard at first, and it helps to look at some player guides before you jump online, hell, maybe play for an hour and then go through it. Skill is a big variable here, don't expect to walk in with 5+ years of CS:GO or 15+ years of COD or 10+ years of Halo to save your ass. This game will put you through the ringer and spit you back out.\n\nThe best advice I can give you is to visit the following links:\nhttps://www.youtube.com/channel/UCvzBzD-LygiE8RLLcxZCpoQ\n\nhttps://www.youtube.com/playlist?list=PLmAK2VrS4DVYUSbCt4LKDrLKAYFDzHB2g\n\nhttps://www.youtube.com/channel/UCiC8NDxIxHVcxBx29RLAr-g/videos\n\nhttps://www.youtube.com/channel/UCwRWWtt4gEjPHoejFQx-3yA\n\nhttps://www.youtube.com/channel/UCSTeUw9Rt7GQqMaFKDxwglA\n\nhttp://www.instantactionpodcast.com/\n\nhttp://wiki.planetside-universe.com/ps/Slash_Commands\n\nhttps://www.reddit.com/r/Planetside/\n\n\nAll of those links will show are guides, tutorials, and most importantly: our community. Small, but tight-knit. Plenty of people with experience willing to help you because no lie, the tutorial is utter garbage. Learn your keybindings in order to get around, be ready to read the map, and most importantly: you need to find a place in Planetside. Like I mentioned before, our community is our defining factor. One thing that you need to realize before playing this game is that the dev team is very small, have a lack of resources (due to other games within the company utilizing them), and that there are many bugs with this game. The best way to play is with others, that's the way the game is designed. You can push yourself to become better, but ultimately, the best way to become better is to learn how to work with othes, get your microphone ready, ask any questions, and get ready for the roller coaster known as Planetside 2.", "timestamp_created": 1500630516, "timestamp_updated": 1500630516, "voted_up": true, "votes_up": 123, "votes_funny": 7, "weighted_vote_score": "0.872235119342803955", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29655427": {"recommendationid": "29655427", "author": {"steamid": "76561198052776236", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 54382, "playtime_last_two_weeks": 1, "last_played": 1550782379}, "language": "english", "review": "Really love this game! Its fun and entertaining... ESPECIALLY when you have a fun outfit who loves to pull jokes and pranks on eachother and enemys alike! \n\nTips to new players:\n1: Keep calm and respawn.\n2: You WILL die ALOT!\n3: Practice your aim, it gets better with time/experience.\n4: Work Together! Its a TEAM game!\n5: No weapon is the same as the other, they each have their own Strength's!\n6: Black and gold weapons are EXACTLY the same as their standard variant! They also cost real money.\n7: Learn your Keybindings! It Helps Alot!\n8: Pick smaller fights untill your used to the game mechanics!\n9: If you can see them you can kill them!\n10: Be RESPECTFUL!!! If you are, others will be more willing to help you! Dont be afraid to ask for help, EVERYONE needs help!\n\nThese are the general tips/tricks/rules I live by! In any game! \nIf your on faction VS (vanu) on server Emerald, My name is DrunkenVS\nPlease, Have a good day and Have fun!\n\n\n2/18/2017 Edit: Some of my outfit/platoon mates gave me some ideas as to what to put for the 10 things as I could only think of about 4 on my own :P \nSo thanks to them to make this review entirely possible!\n\n3/1/2017 Edit 2: a few more tips for you are   \n1) dont run infront of your allies that are shooting, go behind them so you stay out of their line of fire.   \n2) use the terain around you for cover.  \n3) if your a Heavy Assault turn you shield on when entering cover, even if your not being shot at. reason is this is a CLIENT side game if you can see them, you can shoot them. so if your in cover they may still see you out of cover for a short time after because they havent recieved the info from you yet. so use the addage of \"I can see you, I can shoot you\" the same goes for the other players aswell   \n4) Don't go straight for the enemy UNLESS you have several teamates with you. Try your BEST to FLANK the enemy. don't attack them head on. come at them from the sides, above, or even behind them, if one tactic dosen't work... Try something else. the fight is dynamic, just like you!  5) Finally, LEARN the strengths and weaknesses of your weapons, it WILL take time.\n\n\nP.S. Feel free to add my on steam or PS2 (ingame) the name i listed is my primary although if you want i can tell you the others via PM or steam chat.\n\nP.P.S. I added some tips my teamates and friends gave me. some others on Youtube, like Wrel (Dev) Nico101, Joshino, and others have also said some of these tips. If you want to know more about the game look them up on youtube Especially Wrel, as he's a developer. Nico101 I'd recoment to Older audiences, as there is some \"Humor\" that younger audiences may find offensive or dont understand. (he and his team swear a bit aswell) i do squad ops with them and its mostly moments of WTF?! and general fun. Joshino and Wrel are a great choice to see if you want to Learn more about the game, its mechanics and also for general info/guides for weapons or tactics. \n\nNow all this is simply my PERSONAL opinion, while i agree that some others may not agree with me, i hold my opinions of the game and the players in fair judgment. \n\nAlso, if you have any ideas for tips/tricks/unspoken rules/etc. post them in the comments. I will add them to the list and give you credit. feel free do discuss this game in comments below. Happy Gaming everyone!", "timestamp_created": 1486064797, "timestamp_updated": 1524600864, "voted_up": true, "votes_up": 89, "votes_funny": 3, "weighted_vote_score": "0.863734841346740723", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "45352937": {"recommendationid": "45352937", "author": {"steamid": "76561197993771932", "num_games_owned": 129, "num_reviews": 5, "playtime_forever": 283286, "playtime_last_two_weeks": 0, "last_played": 1485382371}, "language": "english", "review": "I've played this game on and off for the past 6 years. Steam time counter is over 4k hours, but it's probably twice as much since I haven't used Steam to launch it in years. Lol.\n\nThere's something magic about this game. You'll love it or you'll hate and you'll end up doing both in the end. \n\nOn the plus side, it's absurdly unique: you always dreamed about massive battleflied with litterally HUNDREDS of players shooting at each other at the same time (not those puny games with 64 players max). Check. \n\nYou always dreamed of a massive scale unique hand-crafted theater of war, a true Sandbox environment with no loading screens and seamless transition where what you see you can get on top of? Check. \n\nYou always dreamed about shotting lazers, flying in jetpacks, piloting tanks, aircrafts, bombers, and murdering dozens with weapons of mass destruction? Check.\n\nYou always dreamed of being in a massive open battle at night on an alien planet, hiding behind a rock while plasma beams fly over your heads, artillery strikes goes off around you and your friendly comrades get murdered left an right in a crazy infantry push? Check.\n\nYou always dreamed about doing it without spending a single cent of your work money and still ending up in a NON P2W environment with a fair in-game shop where you CANNOT buy power? Check. \n\nPlanteside 2 is all this.\n\nIf you are the kind of player that can deal with the fact that you can't ever make a real difference in a game with a thousand people shooting at the same time and you NEED other people to achieve anything relevant, then you'll love it.\n\nIf you are a CoD drone that likes small maps and the chance of gunning everything down ad win all alone and feel much strong... then you'll hate it.\n\n\nOn the down side: performance is crap and you'll need a super fast CPU to run with at least 60fps stable, even after 6 years. Servers have to handle a thousands players shooting at any time so the client-side hit detection will make you suffer. Sometimes it will take 3 headhshots to down an enemy in 0.3 seconds, sometimes you dump half your magazine into somebody and most hits won't register because the server hamster is acting up. \n\n\nMy only gripe with this game is that it could have been much, much more than what it is. \n\nIs it still fun? Yes. Is it worth a download after 6 years? Damn right. Pop is still healthy for thousands of hour of gameplay. You'll get bored of it before this game dies on its own.\n\nA thousand hours is what you'll need to actually be decent at the game though, the learning curve is more like a learning wall ramping up, bending backwards, going full circle and hitting you in your back cavity. This game is not for the faint of hearth. You'll die. A lot. People can murder you at any time, any place, with any thing. \n\nBefore you jump in be sure to read guides online and as soon as you are in jump into a squad/platoon and stick with friendlies. You'll have a much better time than going full CoD rambo thinking this game is like any other shooter and getting your butt serverd to you before you ragequit and uninstall.", "timestamp_created": 1540026512, "timestamp_updated": 1540026849, "voted_up": true, "votes_up": 78, "votes_funny": 5, "weighted_vote_score": "0.882287740707397461", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39227405": {"recommendationid": "39227405", "author": {"steamid": "76561198102465029", "num_games_owned": 354, "num_reviews": 10, "playtime_forever": 21320, "playtime_last_two_weeks": 144, "last_played": 1551419981}, "language": "english", "review": "3 simple rules to enjoy the game:\n\n1. This is not COD, you will die a lot, thats ok, K/D is a bad way of judging how well you do in this game.\n2. Its fun solo, but get a squad of guys together and you will love it.\n3. New guns are side-grades, not upgrades. The starter guns are just as good (and sometimes even better) than ones you can unlock.\n3.5. EVERYTHING can be unlocked through gameplay.", "timestamp_created": 1515577296, "timestamp_updated": 1515577296, "voted_up": true, "votes_up": 116, "votes_funny": 4, "weighted_vote_score": "0.863240242004394531", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41606110": {"recommendationid": "41606110", "author": {"steamid": "76561198178531033", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 51184, "playtime_last_two_weeks": 0, "last_played": 1526854445}, "language": "english", "review": "It says here I have 773 hours in this game. I often play through the client directly, so I have more like 1500-1700 hours total. I have not played a single PC game more than Planetside 2 in my lifetime, and I absolutely love the game. Allow me to go over the pros and cons, because there are some things you should know if and when you get started.\n\nPros:\n+ One of a kind, true real-time MMOFPS. Cannot reallistically be compared to other games. Battlefield has some similarities but is not a true competitor.\n+ Not pay to win. Really, it isn't. Anyone who says otherwise probably takes too much for granted. Only one relatively minor aspect of gameplay (the implant system) is affected by lootboxes. You invest in what you want otherwise.\n+ Satisfying gunplay overall. The mechanics strike a good balance between firing penalties (recoil/cone of fire) and ease of use. Sights and scopes do not feel cramped for screenspace, and are actually quite generous in what they offer the player. Hitreg is meh but better than the average FPS.\n+ A ton of valid playstyles. It's not even my place to define what they all are. Do not feel pressured to conform to a meta. You get to define your niches, goals, and success in this game.\n+ Subcommunities galore! Play with friends and outfits in squads and platoons and have a jolly good time. There's a subcommunity for every kind of player. This isn't me advertising, even though it sounds like it. It's the truth.\n\nCons:\n- High skill floor as well as skill cap. You'll start out in this game by dying, a lot (and especially to people who look like they are cheating but really are just super skilled). It doesn't help that the tutorial sucks. Until they revamp the new player experience later this year, I recommend consulting the PS2 subreddit for their FAQ and helpful links. \n- Not optimized. It is very difficult for the average gaming PC to get above 100 frames during gameplay, especially in large fights.\n- Cheese mechanics. There are some OP mechanics like shotgun mech suits and air-to-ground machineguns that can be frustrating when you die to them.\n- Bugs galore! This game is both entertaining and frustrating because of countless bugs -- some of which have been around for 6 years.\n- It ain't what it used to be. After the developers made a series of poor decisions from 2014-2015, the game's population declined significantly. The fights on most servers (with the exception of Briggs) are still big and juicy though, just waiting for new players to come and take a bite. \n\nIf you ask me, the pros outweigh the cons, hence why I still play. I definitely recommend this game.\n", "timestamp_created": 1524320471, "timestamp_updated": 1524320471, "voted_up": true, "votes_up": 69, "votes_funny": 1, "weighted_vote_score": "0.848799228668212891", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42592791": {"recommendationid": "42592791", "author": {"steamid": "76561198242724544", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 4061, "playtime_last_two_weeks": 97, "last_played": 1551566194}, "language": "english", "review": "Before playing this game: Take a deep breath. You are going to die a lot and get absolutely destroyed by people who have been playing this game for years. It will happen. The good thing is that those type of people are on your team too. Let them do the heavy lifting and find where you fit. Seriously, don't spend your time bouncing between classes. This game is designed for people to specialize and play with a class that fits your playstyle. I have wasted most of my 50 hours so far bouncing between classes. Find one, stick with it, and enjoy the game. The game has so much to offer it's insane. After 50 hours I am just learning what class fits me best and branching out to other playstyles. I have barely scratched the surface.\n\nPros:\n-Endless playability\n-Vehicles\n-Massive maps\n-A class or vehicle for every person's playstyle\n-Good cooperative team play\n-Fast paced action\n-Diverse playing enviroment\n-No pay to win (people complain out not being able to get guns and items but YOU DO NOT need the items to actually play with the best of them. It is largely based on skill.)\n-Veteran Players (Makes you better and kills are rewarding)\n\nCons:\n-Eats GPUs (terribly optimized... but still playable)\n-Really good players (Sometimes you just die... alot...)\n-Fighting for a strategic point that you simply don't have the numbers to win (you know you are going to lose  it 30 minutes before it happens)\n\nConclusion:\nDon't play this game if you want to relax... In fact, don't play any strategic FPS if you want to relax. Do play this if you like the challenge and satisfaction of earning your kills, XP, and mastery of a game that is very open-ended. Also, always bring air support.... Just please.... Bring air support it just makes life easier. 10/10 reccomend", "timestamp_created": 1528518715, "timestamp_updated": 1528519274, "voted_up": true, "votes_up": 84, "votes_funny": 6, "weighted_vote_score": "0.849893867969512939", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48134752": {"recommendationid": "48134752", "author": {"steamid": "76561198093579056", "num_games_owned": 48, "num_reviews": 3, "playtime_forever": 63554, "playtime_last_two_weeks": 1925, "last_played": 1551826403}, "language": "english", "review": "I've played since 2013. I've been here a long time. I've seen the ups, and the downs. I've been a faithful supporter to this [b] EPIC [/b] massive shooter for years. But today I sadly write this review. \n\nFirstly, there are no equivalent to planetside. When I first started playing, I got sucked into this unique universe and otherworldly athmosphere. It was amazing. It had a bright future. It was a rising star. It was something special to see and participate in HUGE and I really mean [b] SUPER HUGE [/b]battles raging all over the place for hours. But the problems soon started to show up. \n\nOne after one they showed up, ruining the gameplay for many players. The Devs tried but they didn't manage to correct what once was this marble. Lots of players left the game. The average population started to sink, month after month. Planetside had problems making newcommers stay faithfull to just this game. After 5 years the average population is nowhere near of how it used to be, the battles aren't SUPER HUGE anymore, maybe not even HUGE. The veterans are the only ones left, faithful to the game. \n\nSecondly, over the last couple of months something happend to this game. After years of decline in population, the devs finally promised us something good. An upgrade from the current Dx9 to Dx11, a new continent named Oshur. This seemed good, with some ads and promotion Planetside could get a more stable player base and maybe even attract more players due to more and better content. I was hopefull untill some weeks ago, when Daybreak Games said they would release Planetside Arena. \n\nIt turned out, to us players that the Devs had been working on a new game. Not saying a word to their community, taking our money and put it into this new game. That [b] MONEY  were meant to support DBG to keep Planetside 2 alive [/b]. Atleast you could've asked us, your community, what we thought was the right move for Planetside 2. \n\nI have low hopes for Planetside Arena. It has a scheduled release as of now, January 29th. It's supposed to be an arena game featuring Battle Royale in the planetside universe. Like, what the actually fu... What happend to the fantastic universe, the one that was special and sucked ME into this otherworldy world of Auraxis? You just took that away, without even hinting it, but worst of all. You DGB took our money that were MEANT to keep planetside 2 unique and alive, and made another Battle Royal spinoff. I'm afraid this will split the small community you have left and it maybe even will be the end of Planetside. \n\nAnd ohh, I almost forgot. As of now - the servers specially mine, [b] Miller is unplayable [/b]. We have server latency drops every 10-15 seconds. And ohh. We, the players also manage to restart the whole server after placing lots of tank mines in a small area. It literally crashed the whole server. So bad are your servers. It shouldn't even be legal to run a server as bad as Miller is at the moment I'm writing this.", "timestamp_created": 1546733719, "timestamp_updated": 1546733901, "voted_up": false, "votes_up": 306, "votes_funny": 21, "weighted_vote_score": "0.906466424465179443", "comment_count": 23, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17072355": {"recommendationid": "17072355", "author": {"steamid": "76561197965979433", "num_games_owned": 213, "num_reviews": 58, "playtime_forever": 11416, "playtime_last_two_weeks": 0, "last_played": 1483763864}, "language": "english", "review": "Alright, i think the game has been out long enough and panned out enough to write a propper review of it.\n\nPlanetside 2 like the original is a First Person Shooter MMO. It is set on a world known as Axuraxis and battles are fought across 4 very very large continents. It has three factions, The Terran Republic which is the \"Government\" for say, loyalists and a professional army. Their guns and technology are all centered on speed over heavy damage and versitility. They possess the fastest Aircraft, Tanks, and guns in the game.\n\nThe Second faction, The New Conglomerate, are a band of Rebels or so called Freedom Fighters. Their theme is that of a rebel band who used to be miners and workers who have repurposed their tools for weapons to fight the power. Their technology is focesed on Defense and Damage. They possess the Hardest hitting weapons and vehicles in the game at the cost of a considerable slower Rate of fire for their weapons and Slow movement for their vehicles  compared to the other 2 factions.\n\nThe Third faction is The Vanu Soveirnty, Like the New conglomerate this faction is also a rebel faction that split off from the Terran republic. However, they do not fight for an idea of \"freedom\" like the NC does. These rebels have found left over alien technology on Auraxis and have converted them into their own use. They are much like a Cult, trying to spread \"Truth and Enlightenment\" to the other factions. Their faction is focused on Alien weaponry and Versitility. They do not do  quite as much damage as the NC nor are they as fast as the TR, but for that sacrifice they possess extremely versitile weapons and vehicles. Their Main Battle Tank the \"Magrider\" is a hover tank with the ability to strafe and scale mountains that the NC and TR's treaded counter parts simply can not do. The weapons they use are unique in how they fire, suffering from very little bullet drop like traditional firearms but as the cost of much more horizontal recoil or \"Sway\".\n\nThe game is a never ending Ground and Air war that is persistant. Unlike modern Shooters such as Battlefield or Call of Duty, there are no \"Levels\". It is fought on a gigantic map, the battlefield changing each time you take a base and move to the next. It also offers the feeling of a \"real\" war. It is commonplace to find battles involving 200 or more people, hordes of infantry advancing across the landscape with Tanks behind them and Aircraft battleing above them.\n\nIt is the only game of its kind to offer this unique experience of being part of a war and it is glorious.\n\nAs for the bad parts of the game, It does unfortunately have a Cash shop and it does allow those who pay real money to unlock new weapons and abilities without earning the XP (or certs as they are called) to get them. However on a game with the scope of battles being on such a massive scale, you do not tend to notice this. There are no weapons that are \"overpowered\" and ruin the game because you dont want to spend real money. They are all rather suprisingly well balanced, each having their ups and downs.\n\nLuckily as well, unlike most Free to play games with a cash shop, it is very possible to progress and unlock items without spending a literal eternity to do it. Unlike other free to play games as well, it is by far one of the most beautiful and good looking shooters on the market. The Quality of its graphics and engine beg the question \"why is this not a 60 dollar game like BF or CoD\".\n\nIn all if you are looking to feel like you are part of a real war that actually matters and to experience what no other FPS to date has successfully captured, it is most certainly worth the download, if only to try it. Whether you like to be a shock trooper infantryman, a tanker, a dog fighter or even just a support role such as ferrying troops to the front line in a transport, this game has it for you.\n\nAs Unbiasedly as possible 10/10, may the war never end.", "timestamp_created": 1437029947, "timestamp_updated": 1437030213, "voted_up": true, "votes_up": 294, "votes_funny": 18, "weighted_vote_score": "0.936705291271209717", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38044721": {"recommendationid": "38044721", "author": {"steamid": "76561198115189178", "num_games_owned": 80, "num_reviews": 1, "playtime_forever": 5717, "playtime_last_two_weeks": 0, "last_played": 1543812774}, "language": "english", "review": "PlanetSide 2 is the game you keep coming back to. There is literally nothing else like this in the gaming market today. Massive, battles, surface to air combat, dogfights, infantry vs vehicles, large scale assaults on bases, stalwart defense against an overwhelming horde of enemies. Nothing comes close to it. When I say massive battles I'm not talking about the measely 64v64 battles that feel like you're primarily wandering about on a too large map while enemies in vehicles and planes get all the fun. I'm talking battles twice that size with spawns that put you right into the action. Without finding yourself being spawned camped for hours on end. \n\nI'm sorry what was that? Oh you wanted coordinated attacks with a large scale team. But you can't find anyone to play with you? Welcome to instant squad join. Instantly find a squad to join up on with, quite literally, the press of a button. Boom you've got at a minimum of eleven other people to coordinate with. Oh what's that? You want a more permanent group to find your friends easier? BAM! Join or create an outfit, with as little as two people. \n\nIf you're tired of the same old grind of one pointless round of mindless gunfighting over and over come to Auraxis and fight for something. Whether you fight for the steadfast Terran Republic, the courageous New Conglomerate or the ingenious Vanu Sovereignty you'll find insane engagements as you battle across four different continents for control of territories. \n\nBest thing of all the game is FREE to play! You literally have nothing to lose! Do yourself a huge favor and download this game. Why not give it a chance! If any of you decide to get this game add me if you're on the server known as emerald. I'll help you get started and hook you up with an amazing outfit! My in game name is iMadhatter and I fight for the Vanu Sovereignty. Join me in combat or fight for the other factions. Either way I'll help you out! Good luck Auraxian I'll see you PlanetSide.", "timestamp_created": 1512339580, "timestamp_updated": 1512339580, "voted_up": true, "votes_up": 86, "votes_funny": 0, "weighted_vote_score": "0.853299617767333984", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44816182": {"recommendationid": "44816182", "author": {"steamid": "76561198041048366", "num_games_owned": 244, "num_reviews": 27, "playtime_forever": 1298, "playtime_last_two_weeks": 0, "last_played": 1537825175}, "language": "english", "review": ">die\n>die\n>die\n>die\n>love it\n>die\n>cool drop pods\n>die\n>die\n>woah the map is huge\n>die", "timestamp_created": 1537390564, "timestamp_updated": 1537390564, "voted_up": true, "votes_up": 85, "votes_funny": 144, "weighted_vote_score": "0.834488093852996826", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32116534": {"recommendationid": "32116534", "author": {"steamid": "76561198011237320", "num_games_owned": 432, "num_reviews": 12, "playtime_forever": 38166, "playtime_last_two_weeks": 0, "last_played": 1543776732}, "language": "english", "review": "--- EDIT 11/2018\n\nWell... the devs are revitalizing the game, upgrading the engine and tweaking and refactoring a lot of stuff.\n\nSome of the new weapons seem to to be more oriented to the faction's original concept. \n\nThere is a new NS faction comming that will use NS only weaponry.\n\nThe squad system have been upgraded.\n\nCortium is more relevant.\n\nNew continent and Aerial Carriers.\n\nI'm still looking forward for more faction specific items and vehicles though.\n\n--- EDIT 11/2018 END\n\nHm it is hard to write a review about this game. \n\nI've spent almost 600h on it, and mostly I had an awesome time. But lately, it seems that the game direction has changed. \n\nWe used to have a class system (bear me for a moment) that did a fine job defining each player's role on the team and the necessity of team oriented gameplay, now the implant system allow us to have each other class' perks. Like a heavy assault with recon's camouflage for example. It is awful... an annoying.\n\nEach faction was supposed to have it's perks and flaws when it comes to how it's hardware design, like how weapons and vehicles, perform.  Now they just keep adding hardware (weapons/vehicles) that are exactly the same for every faction. \n\nAs mentioned before each faction used to have it's own design, more specifically it's own colors. The current camouflage system, can disrrupt this color balance causing a lot of confusion. Either you kill an ally trinking it was an enemy or an enemy with your colors is able to break havock and kill everyone. I'd say it's next to unfair. \n\nThe devs have not been doing a lot in terms of keeping the community together in my opinion, PS2 seems to be on it's last hopes. And a F2P game without an engaged community is bound to fall.", "timestamp_created": 1496355149, "timestamp_updated": 1542853644, "voted_up": true, "votes_up": 109, "votes_funny": 4, "weighted_vote_score": "0.859611332416534424", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40052774": {"recommendationid": "40052774", "author": {"steamid": "76561198070240359", "num_games_owned": 197, "num_reviews": 7, "playtime_forever": 8450, "playtime_last_two_weeks": 0, "last_played": 1519445008}, "language": "english", "review": "IT IS NOT PAY TO WIN! you crazys \n\nI have been playing Planetside 2 for a few years now off and on. When i first started i hated mainly because my computer couldn't run it. Every time i jumped into a battle my FPS would drop and i woun't be able to see what was really going on. Now it has been a few years and i keep coming back to this game.\n\nWhen i first upgraded my computer i finally was able to see what was going on and was able to fight back! although i still sucked at the game and had a KD of about .01. I went and watched a few youtube videos and got some tips on how to fight. Before i would just run around like a chicken with its head chopped off and die all the time. Now i take my time look around for a good spot to either hold up in, look around the corner, or just find a spot were people are dying and ill just be a medic and rack up the points. It took a long time before i was able to get atleast 1 kill before i died myself.\n\nWhen it comes to vehicles there are a nice amount to choose from and depending on your faction they will have differnt styles. From ground support: Tanks, Mobile Spawn points, Run and Gun, and quads. From Air Support: Transporters with heavy guns, Jets with rockets, and a helicopter type jet thing that no one really uses. People use there for many different things we even use them for racing just for fun if we know we are going to lose but have 4 min to kill.\n\nThe map is HUGE! and there are 5 of them! well....mainly 3 but still...the main 3 are forest, desert, and ice tundra. there is a swamp but no one really uses it but i like it, and there is a VR battle grounds were you can have everything maxed out and try any type of gameplay you like but doesnt count for anything. On one map there can be well over 3 differnt parts of it that have 100 vs 100 going on. The Dev's came up with an idea as player base started to go down a bit were they lock different maps and force you to play on others. it's good and bad. good becuase it makes anyone who wants to just play, there is always big battles going on. bad if you want to just go and explore for a bit (weird-o) you might have to wait 2 hours before it unlocks again. If you win a map and it gets locked down you get perks! such as lower cost on vehicle's.\n\nNow lets talk about new people going jumping in vs. old level 120 everything unlocked players.....THE GAME GIVE YOU THE BEST WEAPON AT THE START!....not to stay that other weapons arent better for your play style but as a whole, every class starts with one of the best weapons you can have. ask any vet level 120 and they will say to NOT BUY GUNS! they will tell you to invest in your armor, your abilitys, your atachments, ect. i made the mistake of doing just that. but you do not need to spend 1,000 DAMN CERTS on a weapon that you might not even like. (if you really want a new weapon go to the vr battle grounds and try it out before you buy)\n\nWhich brings me to the next topic CERTS! they suck to get as a new player. Once you are getting better(after level 15 normally) they also stop giving you bonus certs. from level 1-15 they give you an extra 100 certs after 15...well every 250 exp you get 1 cert. to get you an idea about how long it might take to get 1 cert ill tell you! 1 kill is about 130 exp, 1 revive is about 80 exp, 1 tank kill is about 300 exp, someone picks up ammo you dropped for them to use, thats 10 exp. as a new player you might not get many kills in the beginning. so this can take quite some time....Save your certs untill you know what you might want to play as and DO NOT BUY A GUN!!!!! JUST DONT DO IT! YOU GUN IS FINE! DONT DO IT!\n\nWhen it comes to classes there are 6. you can be a sniper with a cloak, gunner with a jetpack, an engineer with a portable turret, a healer with a revive gun, gunner with an extra shield, or a walking mini tank. if you are new and having truouble with getting kills, go with a support class like healer or engineer, they both still have a gun to kill people with but you can help out others and not have to get to in the way of gun fire.\n\nLets talk about guns for a sec. There is bullet drop and travel. i know this isn't anything super new for bullet drop but when this game came out it was pretty cool to me. shotting at an air ship you will need to lead your bullets to land the hit, some tanks need to aim higher for futher targets, and snipers need to accound for how far away their target is. if you are at a base and are fighting in a room(which is normal) you dont need to worry to much about these things.DONT BUY GUNS! (if you are new)\n\nOver all its'a free game, it's NOT pay to win and many people say it is, and if you find a good team you will have a lot of fun. I have now 140 hours into this game and i am only level 28 but i can go 1 on 1 with a level 120 with a decent chance of coming up a winner. hope this helps anyone looking for a new free game to play with friends or solo(you'll make friends)", "timestamp_created": 1518550233, "timestamp_updated": 1518550233, "voted_up": true, "votes_up": 99, "votes_funny": 8, "weighted_vote_score": "0.856744229793548584", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44973685": {"recommendationid": "44973685", "author": {"steamid": "76561198310477116", "num_games_owned": 22, "num_reviews": 4, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "last_played": 1538465871}, "language": "english", "review": "Better than Fortnite.", "timestamp_created": 1538089068, "timestamp_updated": 1538089068, "voted_up": true, "votes_up": 126, "votes_funny": 77, "weighted_vote_score": "0.82935631275177002", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29331060": {"recommendationid": "29331060", "author": {"steamid": "76561198044986076", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 2925, "playtime_last_two_weeks": 0, "last_played": 1488926572}, "language": "english", "review": "2000 players in a single map. Tell me another FPS that can do this WITH INFANTRY, ARMOR, AND AIR.\n\nI thought not.\n\nUnique experiences that you cannot find in another game. 2000/10", "timestamp_created": 1484718524, "timestamp_updated": 1484718524, "voted_up": true, "votes_up": 141, "votes_funny": 17, "weighted_vote_score": "0.855949938297271729", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15573915": {"recommendationid": "15573915", "author": {"steamid": "76561198106927174", "num_games_owned": 84, "num_reviews": 23, "playtime_forever": 105742, "playtime_last_two_weeks": 0, "last_played": 1529710416}, "language": "english", "review": "+ Free to play. \n+ NOT pay to win. (Don't believe me? Ask anyone else with actual experience in the game)\n+ Still having updates even after 2+ years\n+ Small and large battles everywhere\n+ Hundreds of bases on 4 different huge maps\n+ Very freindly and helpful community compared to most other fps\n+ Infinite gameplay opportunities\n+ Infinite loadouts on 5 different infantry classes\n+ Infinite loadouts on 7 different ground vehicles\n+ Infinite loadouts on 6 different air vehicles\n+ HUGE map and gameplay update [strike]coming soon in 2016[/strike] out!\n\n- Slightly buggy.\n- Steep learning curve (I suggest asking for help on reddit and finding noob freindly squads early on)\n\n= Once you get good at it it's the best fps ever made.\n10/10", "timestamp_created": 1430100598, "timestamp_updated": 1467566310, "voted_up": true, "votes_up": 523, "votes_funny": 48, "weighted_vote_score": "0.905447959899902344", "comment_count": 50, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32882025": {"recommendationid": "32882025", "author": {"steamid": "76561198032455391", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 146069, "playtime_last_two_weeks": 124, "last_played": 1551550645}, "language": "english", "review": "[h1][b]Most Important Edit:[/b] There is no difference in levels and don't let anyone tell you so. Here is why... There is no difference in BR120 and BR1 (which are basically levels). If I gave you my BR120 (maxed out) account and you gave me your BR1 (new) account, I would still kill you. Give me any gun in the game, I will kill you. Do not let salty reviews from 5 hour players change your mind. You get the basic equipment you need to suceed from starting the game.The same occurs in vehicles. If this doesnt change your mind, look at this. By BR 8, which is about an hour of playtime, you can get some nice guns on any vehicle or get some infantry guns of your choice. However, I will still kill you in a default vehicle if you have a maxed out one. Playing against higher levels does not matter. They are just more skilled and thats why they kill you.[/h1]\n\n[h1]Feel free to add me on steam to play with me on the US East Server[/h1]\n\n[h1][b]A note on the air in Planetside 2:[/b] To put it bluntly, air is super hard. You will get triggered by it. You will quit. You need several months of practice to be decent and there will still be players who will kill you with 90% health remaining after those months. I will not tell you not to try it, but keep that in mind.[/h1]\n\n[h1][b]edits:[/b][/h1] I made a meme review but people thought I was cool because I had so many hours so I made a better one.   \n\n[b]Factions:[/b] If I get any comments complaining about how factions are OP I will get triggered. For everyone who has heard this, I play all 3 factions and play what people call \"the weakest faction\". THEYRE ALL GOOD. \n\n\n If I was playing infantry only I would go Vanu Sovereignty but if I was playing combined arms I would definietely go New Conglomerate. Go Terran Republic if you want to find High accuracy/High Fire Rate//Medium Damage guns with better-than-average armor. Go Vanu Sovereignty if you want High Accuracy/Medium Damage/Medium Fire Rate guns and medicore armor but [b]godly[/b] aircraft. Go New Conglomerate for Low Accuracy/Low Fire Rate/High Damage guns with the best armor. \n\n[h1][b]Main Review:[/b][/h1]  \n\nI've played this game for 2000 hours and I'm still in love with it. I cannot just quantify its pro's and con's because its so much more than just a list.\n \nWhat I enjoy about this game is the fact that you can do anything and everything that you would ever want. If you get bored of playing infantry, hop in a tank. If you get bored of that, hop in a reaver (fighter). If you get bored of that, hop in a harasser (battlecar). Theres like 11 vehicles in the game for people to play with. On top of that, its infantry gameplay requires skill most of the time. There are some exceptions like shotguns and maxes. \n\nAnother strength of this game is the fact that it has these amazing communities. I've been in three of them over the course of a couple years and the friends you make are amazing. The Emerald (US East) server is absolutely fantastic and we all know each other and play with each other. Check out the reddit or various discords. \n\nThere are a few issues with the game as well. The largest one is probably performance. Another one is the simple fact that the Devs simply didn't do their jobs. Planetside 2 could have been the next Player Battlegrounds. It could have. At the beginning, they were doing MLG events and everything. Then it just stopped...This effects the current gamplay mainly by lack of players and balance issues. There used to be thousands upon thousands of players playing at once. You could get 2-5 platoons (groups of 48 people) under your control but now you'll be lucky to get one. The game population has dropped at a drastic rate due to the next issue mainly: Performance.\n \nTo go back to performance, this game does not perform well. I am not talking about a GPU or CPU, I have a 750 TI and a 2nd generation I7 (yes they still exist) and I can easily run 60-120 frames at any given moment in a 300 man battle. What I am talking about is the lag. There is lag compensation in this game and there are many players who play from many different countries. This means you will constantly die behind walls and glitch out in vehicles. It gets really triggering. \n\nThe last things I want to complain about today are the bugs. There are bugs that have been in the game for years and the devs haven't even achnowledged them. For example, every time you pull a vehicle remotely, you have an estimated (by me) 20-40% chance to die. Yes, you bug out that often. \n\nOverall, the great community and variety makes up for the game. I've spent over $200 on this game and over $50 on my friends in this game. 10/10 would do again. At one point, I was playing so much I spent 20% of my time THE ENTIRE YEAR playing Planetside alone.", "timestamp_created": 1498592799, "timestamp_updated": 1500174090, "voted_up": true, "votes_up": 257, "votes_funny": 15, "weighted_vote_score": "0.856634438037872314", "comment_count": 9, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34031790": {"recommendationid": "34031790", "author": {"steamid": "76561197999083453", "num_games_owned": 141, "num_reviews": 6, "playtime_forever": 348770, "playtime_last_two_weeks": 127, "last_played": 1550935684}, "language": "english", "review": "Still amazing and like no other game", "timestamp_created": 1501914926, "timestamp_updated": 1501914926, "voted_up": true, "votes_up": 67, "votes_funny": 6, "weighted_vote_score": "0.781749069690704346", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30694521": {"recommendationid": "30694521", "author": {"steamid": "76561197986686803", "num_games_owned": 105, "num_reviews": 4, "playtime_forever": 23493, "playtime_last_two_weeks": 0, "last_played": 1547307404}, "language": "english", "review": "Oooohh boy, where to start?\n\nYou know Battlefield? Of course you know Battlefield, but imagine Battlefield, but much more bigger and with space guns. Oh, and free.\n\nYou can choose to be one of the three factions:\n\nThe New Conglomerate (NC) which are basically rebels trying to fight for freedom n' stuff. They are one of the harder factions to learn since their guns have a lot of recoil. They got a medium sized mags, medium reload speeds and a lot of damage per bullet. Also, they specialize in big armour and shotguns. They are guided by American rock music with a sprinkle of cowboy. Shotgun free in the NC, my friends!\n\nThe Terran Republic (TR) are a bunch of people who will see to it that no rebels walk free (namely the NC). They got gigantic mags and the firerate to use it all. They got normal reload speed and don't have a lot of damage per shot, but at least their recoil is controllable. They boast their machine guns cause they can put a lot of fire downrange. Hope you never meet the barrel of a revved up chaingun, cause nobody surviving that.\n\nThe Vanu Sovereignty (VS) are basically people who thought touching weird alien technology is a good idea. Their accuracy is unmatched and they got extremely fast reload speeds. However, they do medium damage, have small mags and a normal fire rate. They got equipment that makes their accuracy even better. And do watch out for those floating tanks, they can still run you over.\n\nChoose a faction, choose a face, choose a gender and your good to go. Don't worry if you don't like the faction, you get 3 character slots, so you can play them all.\n\nAfter the tutorial (which honestly kinda sucks) the game drops you off in the middle of one of the four maps of the game, gives you a gun and tells you \"go shoot whatever isn't wearing your colour\". Needless, to say you will die. This game is hard. Better get used to it quick.\n\nThe game is gigantic in scale and finding a good squad is key in survival. Find a squad leader who communicates with his squad, those are the best. Nothing beats successfully capturing a base with your squad.\n\nTwo things are seriously holding tgus game back. The overpriced f2p model. You can use certs (in-game earnable money) to buy stuff, but it costs a lot. And for 20€ you can only get about one new gun. Kinda sucks.\n\nAnother thing is the optimization issues. I will be the first to admit that my PC is not the best, but 2 years ago when I played this game, I received no lag. Now with a smaller playerbase, i get more lag. In some areas i get about 25-30 fps. This needs to be fixed.\n\nWhen SOE (Sony Online Entertainment) owned the game, it was better. Currently Daybreaks owns it and it's a bit worse now.\n\nBut there is just so much in the game! 6 classes, a lot of weapons, land and air vehicles. We have not even scraped the bottom of the barrel.\n\nSo quick recap:\n\nPros:\n+ Amazing open world tactical combat.\n+ Excellent custimization options.\n+ Lots of room for various types of playstyles.\n+ Great teamplay capability with a good squad leader.\n+ It's freaking free. Can't beat that.\n\nCons:\n- Free to play model is overpriced.\n- Huge performace issues in big battles\n- Some of the community can be a bit... meaner than others.\n\nOverall, the game is fantastic. You should totally give it a go.", "timestamp_created": 1490310022, "timestamp_updated": 1510579621, "voted_up": true, "votes_up": 116, "votes_funny": 13, "weighted_vote_score": "0.869327425956726074", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42878592": {"recommendationid": "42878592", "author": {"steamid": "76561198009409694", "num_games_owned": 311, "num_reviews": 3, "playtime_forever": 179659, "playtime_last_two_weeks": 1611, "last_played": 1551848537}, "language": "english", "review": "Meh, played it a bit. It's ok.\n\n\nJoking aside, here is a review from someone who has taken part in basically all parts of the game (aside the more advanced air game as I can't fly for sh*t other than crashing into a tree) and tried to git gud at all of them. For further information, I have played this game ever since it got into beta in the end of 2012, with 1 larger break of 1-2 years inbetween. Most of the following is a subjective opinion with some facts thrown in there. Every player has a different perspective/opinion on the game, so please take that into account.\n\nFor new players, this game is extremely difficult to get into. For the people playing the game for 100-500 hours+, we go online, choose a fight of our liking and start fighting. Doesn't matter if we play for KD, fun or objective.\nFor new players, the amount of information you have to process, is *a lot*. It will take time. Something most players advice (for good reason), is to join an outfit.\nI have been in zergfits and midfits alike and from personal experience, you should look for people who understand the struggles of a new player. A lot of the good players help the midtier players get better, but I have personally felt that they struggle putting themselves into a position of not understanding what a sunderer is or how to capture a point.\nThus it is easier to ask around and potentially join a bigger outfit which teaches you the basics of the game at first. Please do not misunderstand -> Joining a big outfit is not the same as accepting invitations from spamfits (Outfits that spam invites to players without asking them). Take a look through the outfit browser and see what fits you or go to reddit or the PlanetSide 2 discord and poke some players about what outfits they think you should join.\n\nIn the end, you need to have an open mind. Every outfit is different and you should determine for yourself, what you want to do in this sandbox. I think every outfit offers some sort of gameplay variant, no matter if it is subjectively good or bad. Once you think you have found your personal playstyle, then you can always switch outfits to be around likeminded players.\n\n\nThe game itself has a lot of flaws which come from the concept of being a 3 way faction sandbox. The competition that some players are looking for is for the most part, extremely infuriating (especially to get into it). For me, the mindset made a huge difference. This isn't a game designed to be a competitive (talking about specific balance/server tick rate) game. You can have competition but you have to play by the games rules. Things such as lag etc. are sometimes more important than your skills in terms of aiming or positioning.\nFrom personal experience, it helps seeing the live play as what it is supposed to be: A sandbox where everyone can do whatever the game enables them to do. As infuriating as zerging (huge amount of players versus a small amount of players) is, the game enables it and you have to deal with it. Obviously there are ways to combat this and for the most part,  it is up to the player to use them (form a counter force, use choke points, etc..).\n\nThe game currently has 4 major and 1 minor playstyles as of now (in my opinion. This will most likely vary *A LOT*).\nInfantry, Ground Vehicles, Air Vehicles and Leading are the 4 major playstyles that you can choose to persue. Leading will 100% overlap as you need to learn how lead either combined arms (Infantry and vehicles combined) or one part specifically. You can choose whichever path you want, however the vehicle paths are rather expensive when it comes to unlocking the best weapons/abilities for specific scenarios.\nThe minor playstyle is building bases via construction. A lot of people are torn about this topic, yet I stand by the believe that it is a sand box and construction bases are fun to interact with. Just like with vehicle unlocks, it costs a lot and isn't 100% doable from the start.\n\nIn terms of activity, the game is (even if only slightly) growing again! New updates are fun (such as air anomalies, which reduce the cost for air vehicles to 0 and thus create huge air battles, with air aces and noobs such as myself alike) and the community is, while salty, a good one. I am happy to be a part of it.\n\nI also want to warn new players of something that a lot of people have stated over the years. If you get into the game and play it a lot, a lot of other games will feel... empty and hollow. Most interactions if not all of them in PlanetSide 2 are player made. Every person you are fighting is another player somewhere around the world. All the platoons, squads and friendly forces you will fight alongside (unless you are NC, then you will team kill them :D) are players. This constant interaction with other players, this sometimes \"random\" behavior makes (especially single player games) feel a bit empty after some time.\n\nLastly I want to say, there is too much to put into a few words/paragraphs here. There is talk about new player experience, Veteran interactions, base designs, how balanced Infantry vs Infantry is, interactions between infantry to ground vehicles to air vehicles, etc.. etc.. The game is massive. The best thing you can do is to find someone who can mentor you through this.\n\nWhile the beginning is definitely a bit hard, it is a lot of fun once you get into it.\n\nWould definitely recommend.", "timestamp_created": 1529510845, "timestamp_updated": 1529510845, "voted_up": true, "votes_up": 65, "votes_funny": 16, "weighted_vote_score": "0.831053614616394043", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34920428": {"recommendationid": "34920428", "author": {"steamid": "76561198030434850", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 131582, "playtime_last_two_weeks": 924, "last_played": 1551811566}, "language": "english", "review": "If somebody finds a true MMO shooter better than this let me know. Infantry, vehicles, aircraft, squad and platoon leaders with heavy tactical play, 3 factions, maps 64km2 big. There's plenty of things to sink your teeth into if you put some time in and respect the learning curve.", "timestamp_created": 1505312355, "timestamp_updated": 1505312355, "voted_up": true, "votes_up": 65, "votes_funny": 5, "weighted_vote_score": "0.804973423480987549", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27104409": {"recommendationid": "27104409", "author": {"steamid": "76561198094143338", "num_games_owned": 411, "num_reviews": 1, "playtime_forever": 94704, "playtime_last_two_weeks": 2, "last_played": 1551030919}, "language": "english", "review": "I am one of those guys who run Linux, and try to do everything using it. Yet this game is still a reason for me to dual boot Windows.\n\nHundreds of players, waging war on four giant open continents. Whether you want to play a sniper, an infantrymen rushing points, or want to jump into one of many different vehicles or planes, this game has got you covered. Planetside makes you feel small, just one soldier in a huge battle. You are not \"Hero X\" or \"The tank of the team\". You are just another guy with a gun, no super powers others do not have.\n\nThere are a few things to keep in mind though:\n\n1) Most important for new players: This game has a very long and steep learning curve. In your first hours, days, maybe even weeks in the game a lot of people will kill you, easily. This is not because the game is pay to win, as many reviews of people with less than 100 hours in suggest. This is because those players know where to take cover, how to approach and how to aim exactly the way to get all their bullets in your head, instead of spreading half their clip over the wall behind you. [b]Make friends, join an outfit[/b] - or if you are more the solitary type, watch videos by people like [i]Wrel[/i] that cover the basics of playing this game. You might not need it in other shooters, you will need it here.\n\n2) I said this shortly before already, but I'll say it again: This game is not pay to win. At all. Everything except for some purely cosmetic items can be unlocked through [i]cert points[/i], which you earn by doing useful stuff (repairing, kills, spotting, basically everything). All weapons can be unlocked through these points. And these points are easy, really easy to get. A focused new engineer can make 1000 cert points in the first 1-3 days of playing. That gets you any gun or upgrade you want. [b]Watch a tutorial, on farming certs.[/b] You want to be engineer or medic for this, usually.\n\n3) Got some certs? Don't just drop them all on a new gun at first, because: Almost all weapons are sidegrades, either all purpose or excelling in a specific situation. New players should upgrade their armor first, and maybe cert into a vehicle after that. Vehicles are fun.\n\nI have currently almost 500 hours in, but am by no measure a pro yet. I'll leave further recommendations to others. My advice is give it a try, watch some tutorials, and maybe I'll run you over on my [i]Flash[/i] someday. Just keep in mind that everything you see a 'pro' do, is something you can do as well. No pay to win, no barriers. Just raw experience.\n\n[spoiler]Also join vanu, purple spandex = best[/spoiler]", "timestamp_created": 1479983120, "timestamp_updated": 1479983120, "voted_up": true, "votes_up": 71, "votes_funny": 3, "weighted_vote_score": "0.82203221321105957", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42027573": {"recommendationid": "42027573", "author": {"steamid": "76561198011604313", "num_games_owned": 136, "num_reviews": 30, "playtime_forever": 7327, "playtime_last_two_weeks": 0, "last_played": 1520820573}, "language": "english", "review": "8/10  Cretification Points.\n===[Audience]===\n\n[ ] Kids\n[X] Casual players    (These are good for cannon fodder.)\n[X] Pro players\n[ ] Everyone\n\n===[Graphics]===\n\n[ ] Potato\n[ ] Really bad\n[ ] Bad \n[X] Ok \n[ ] Good \n[ ] Beautiful  \n[ ] Masterpiece\n\n===[Price/quality]===\n[X] F2P      (in game microtransactions)\n[ ] Full price    \n[ ] Wait for sale\n[ ] Average\n[ ] Refund it if you can\n[ ] Don't do it\n\n===[Requirments]===\n\n[ ] 90' PC\n[ ] Minimum\n[X] Medium \n[ ] Fast\n[ ] High end \n[ ] NASA computer\n\n===[Difficult]===\n\n[ ] You just need 2 arms \n[ ] Ez\n[ ] Normal\n[ ] Easy to learn / Hard to master \n[X] Hard (first few hours)\n[ ] Dark Souls  \n\n===[Game time/length]===\n\n[ ] Really short ( 0 - 2 hours)\n[ ] Short ( 2 - 8 hours)\n[ ] Few hours ( 8 - 12 hours)\n[ ] Long ( 12+ hours)\n[X] Endless\n\n===[Story] ===\n\n[X] It doesn't have         \n[ ] Average\n[ ] Good    \n[ ] Fantastic\n\n===[Bugs]===\n\n[ ] Game itself is one big BUG\n[ ] Bugs destroying the game\n[ ] Lot of bugs\n[X] Few Bugs\n[ ] You can use them for speedrun\n[ ] Nothing\n", "timestamp_created": 1526258596, "timestamp_updated": 1526258596, "voted_up": true, "votes_up": 160, "votes_funny": 34, "weighted_vote_score": "0.864056587219238281", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22481419": {"recommendationid": "22481419", "author": {"steamid": "76561198118948372", "num_games_owned": 73, "num_reviews": 13, "playtime_forever": 3084, "playtime_last_two_weeks": 0, "last_played": 1484972464}, "language": "english", "review": "At first, I though \"ehh. another FPS that I suck at and is mildly frustrating. Also, I can't fly or drive\"\nI had fun running around getting shot alot, occasionally getting kills. Then me and my friend joined a squad, and that was undoubtebly one of the most fun I have ever had in a game. We got in these massive cargo ships, or \"galaxies\" and all 12 of us (sometimes there were multiple galaxies) would await the drop call from our leader. It came and we would all at once drop onto a roof, enter it shouting commands, and then once we tactically took it we would defend it from the immediate counterattack. I've done this tons now, and it never gets old, the rush and the tacticalness. Besides the waning community and the slight P2W bits (it's free, what do you excpect), its perfect.\n\n9/10 with friends", "timestamp_created": 1460910447, "timestamp_updated": 1460910447, "voted_up": true, "votes_up": 77, "votes_funny": 9, "weighted_vote_score": "0.823215603828430176", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12727362": {"recommendationid": "12727362", "author": {"steamid": "76561198075421493", "num_games_owned": 53, "num_reviews": 2, "playtime_forever": 66257, "playtime_last_two_weeks": 0, "last_played": 1477257759}, "language": "english", "review": "Planetside 2 is awesome. A little difficult to get into, but once you're there, awesome.\nI definitely recommend this game! Every minute of my (dare i say extensive) game time has been enjoyable, and I'm still enjoying it today.\n\nGet this game now!!", "timestamp_created": 1414860897, "timestamp_updated": 1414860897, "voted_up": true, "votes_up": 395, "votes_funny": 35, "weighted_vote_score": "0.900603413581848145", "comment_count": 25, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28499014": {"recommendationid": "28499014", "author": {"steamid": "76561198148422439", "num_games_owned": 190, "num_reviews": 33, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1482381345}, "language": "english", "review": "This is what Star Wars Battlefront (2015)should be", "timestamp_created": 1482289964, "timestamp_updated": 1507961075, "voted_up": true, "votes_up": 171, "votes_funny": 37, "weighted_vote_score": "0.818680226802825928", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40354846": {"recommendationid": "40354846", "author": {"steamid": "76561198047812294", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 89946, "playtime_last_two_weeks": 62, "last_played": 1550967000}, "language": "english", "review": "Played this game for over 1000 hours a few years back. Kept me going through tougher times in life. Came back for some nostalgia and I'm hooked again. To me, it's the only game that really nails the expansiveness of battles. Everything else I have played feels really quite \"contained\".\n\nPlay this with some mates and you'll have a blast. Really is a bit of an unsung hero.", "timestamp_created": 1519473930, "timestamp_updated": 1519473930, "voted_up": true, "votes_up": 42, "votes_funny": 1, "weighted_vote_score": "0.771778345108032227", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45233825": {"recommendationid": "45233825", "author": {"steamid": "76561198121642254", "num_games_owned": 111, "num_reviews": 2, "playtime_forever": 24008, "playtime_last_two_weeks": 0, "last_played": 1547930862}, "language": "english", "review": "Best tip for new players. Dont spend your certification points on new weapons! this game starts you off with the best primary weapons right from the get go, all the others are side grades that offer slight differences in play styles, none of them are direct upgrades. focus on the things that Are direct upgrades first, like your suit armor variations, class tool slot like the medic healing tool and engineer rep tool, or maybe some certs into some fun vehicle upgrades. theres little to gain from bying a new primary for most any class, save those for later ones you finish the weapon directive for the default weapon. heck i still use my default Pulsar VS1 most of the time, easy to handle and i dont have to worry about engagement range much. the weapons in this game are not a progression, they are side paths and are a HUGE undertaking to learn how to use them properly. dont do what i did and buy five assult rifles with my first few thousand certs....", "timestamp_created": 1539360816, "timestamp_updated": 1539360816, "voted_up": true, "votes_up": 74, "votes_funny": 3, "weighted_vote_score": "0.843800365924835205", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24430412": {"recommendationid": "24430412", "author": {"steamid": "76561197993693447", "num_games_owned": 337, "num_reviews": 1, "playtime_forever": 107917, "playtime_last_two_weeks": 0, "last_played": 1511573411}, "language": "english", "review": "I have started playing on Nov 25, 2012. Since then over the 1333 days I have played 1667 hours, which is about 1 hour 15 minutes a day, or 8 hours 45 minutes a week, a day's worth of work including commute. (As of July 20, 2016)\n\nStill no sign of stopping any time soon. And I am neither a hardcore player nor am I good at the game.\n\nEverything else was said in other reviews. Despite all the issues the game may have, this is definitively one of the best games ever made. You can play 100% free, no pay2win, only things that are money only are cosmetics and boosts.\n\nThe game actually keeps getting better even if it may be two steps forward one step back from time to time.\n\n10/10, I have spent more time in war than some real life soldiers. Would start playing the game that took more of my time than a part-time job again if I was given the choice.", "timestamp_created": 1469043763, "timestamp_updated": 1469043763, "voted_up": true, "votes_up": 53, "votes_funny": 6, "weighted_vote_score": "0.775472283363342285", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23656617": {"recommendationid": "23656617", "author": {"steamid": "76561198080245486", "num_games_owned": 108, "num_reviews": 2, "playtime_forever": 320797, "playtime_last_two_weeks": 3381, "last_played": 1551827654}, "language": "english", "review": "+One of the best and helpful online communities\n+Sandbox style of game, that lets you play your own way in the given framework of an MMO-FPS-RTS game.\n+Combined arms with infantry, vehicles and air\n+Organized platoons of up to 48 players, or you can play solo\n+4 Maps which can hold above 1000 players each, with small and big fights on different locations.\n+Many outfits that run either big platoons or smaller tactical squads\n+Build your own bases which different constructions or attack an enemy selfbuild bases\n\n-Very hard to learn, expect to put north of 100 hours into the game until you see the light.\n-Expect to die fast when you start the game, over and over until you gain situational awarness\n-If you dont join an outfit that teaches the game or you dont join open platoons it will be hard to learn the trade of the game in the beginning. (No tutorial missions or ingame learning missions)\n\n-> If you bite through the first 100 hours and/or find an outfit that fits to you, expect to play one of the best games of your life for a very long time.\n\n-> GET HELP here and ask the community anything you want to know:\n\nhttps://www.reddit.com/r/Planetside/\n\nTips for the start: \n\n1. In the beginning you need \"certs\" the most to upgrade you infantry classes, vehicles and air. You earn \"certs\" for doing anything in the game. One of the fastest ways to gain \"certs\" is playing medic. Start with upgrading your medic to max level in the following order:\n-revive grenades\n-medical applicator (heal with left mouse button, revive with right mouse button)\n-grenade bandolier\n-regeneration field (place down near choke points)\nJoin big fights with that medic and heal and revive your teammates. This will give you a lot of \"certs\". When you feel you slowly get an idea how this game works, tip your toe into the other classes to figure out their traits.\n\n2. If you dont mind spending money on the game, buy your weapons with cash. You can also use \"certs\" for that, but if you buy with cash, you can use the weapons on all other alternate characters you might create later on. This saves you a lot of time in case you move to a different server or faction at a later point.\nBefore you buy a gun, you should know, you can actually try every gun in the real game for 30 minutes for free. I recommend that, because some guns are easier to use for beginners or for your type of play and you want to find the best gun in the beginning to get you going...\n\nSee you ingame.", "timestamp_created": 1466361994, "timestamp_updated": 1466375622, "voted_up": true, "votes_up": 91, "votes_funny": 4, "weighted_vote_score": "0.828665077686309814", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40621342": {"recommendationid": "40621342", "author": {"steamid": "76561198133159405", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 289590, "playtime_last_two_weeks": 3481, "last_played": 1551846644}, "language": "english", "review": "Being playing for 2 years, good game", "timestamp_created": 1520391660, "timestamp_updated": 1520391660, "voted_up": true, "votes_up": 46, "votes_funny": 10, "weighted_vote_score": "0.757914245128631592", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9684197": {"recommendationid": "9684197", "author": {"steamid": "76561197995365630", "num_games_owned": 278, "num_reviews": 2, "playtime_forever": 108515, "playtime_last_two_weeks": 0, "last_played": 1463263385}, "language": "english", "review": "Edit: The Planetside 2 Elite Soldier Bundle is sweet!\n\nYou spawn as an infiltrator.  You steath into the enemy base, pull off some solid snake bs, nobody sees you.  Exposions all around panic everywhere.  You hack the enemy base turret and start blowing up the enemy with thier own defences.  Suddenly! You explode! \n\nAhhh darn they got you! but wait! You were teamkilled by a rank 1 NC Heavy on Connery named asdfghjkl.\n\nAt first your mad, but then it dawns on you that he is actually... A tactical genius!  He knew that you were gonna die anyways, so he denied the enemy points.  By shooting his rocket at the stationary base defense, instead of those small hard to hit infintry scattered around the ground.  He insured something was getting done while denying an extreme menace kill to the enemy.\n\nOn NC Connery every teamkill has a tactical significance no matter how big or how small.  They had your best intrest in mind when they shot you in the face.", "timestamp_created": 1396260193, "timestamp_updated": 1403797206, "voted_up": true, "votes_up": 1102, "votes_funny": 22, "weighted_vote_score": "0.886280477046966553", "comment_count": 40, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44666096": {"recommendationid": "44666096", "author": {"steamid": "76561197991408800", "num_games_owned": 409, "num_reviews": 31, "playtime_forever": 8106, "playtime_last_two_weeks": 9, "last_played": 1551621193}, "language": "english", "review": "This game deserves more players.", "timestamp_created": 1536575986, "timestamp_updated": 1536575986, "voted_up": true, "votes_up": 64, "votes_funny": 6, "weighted_vote_score": "0.806457638740539551", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44324054": {"recommendationid": "44324054", "author": {"steamid": "76561198207378780", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 21475, "playtime_last_two_weeks": 0, "last_played": 1535028408}, "language": "english", "review": "If you play it right, you will never be bored. Until you are. And then you wont play it for a year. BUT THEN you will play it everytime you have free time. And never be bored. Until you are again. Then rinse and repeat.", "timestamp_created": 1534995764, "timestamp_updated": 1534995764, "voted_up": true, "votes_up": 75, "votes_funny": 38, "weighted_vote_score": "0.825181245803833008", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22902692": {"recommendationid": "22902692", "author": {"steamid": "76561197972344155", "num_games_owned": 38, "num_reviews": 2, "playtime_forever": 244090, "playtime_last_two_weeks": 0, "last_played": 1547316188}, "language": "english", "review": "PREFACE: This game is NOT pay to win! Don't believe the lies! More on this below.\n\nPlanetside 2 is unlike any other gaming experience you've ever had.\nThere's a reason why so many people say that Planetside 2 ruined every other online FPS game for them. Nothing comes even close to the scale this game provides and to the many playstyles it has to offer. \nImagine your favourite Battlefield title, only with incomparably larger maps (we call them continents) and up to 1000 players wreaking havoc across them in more ways than you can count. \nYou can try and capture enemy bases in an organized attack with dozens of your friends while preventing the enemies from snatching your own territory in return. You can harvest resources and build outposts. You can even just have some casual fun blowing stuff up. But however you choose to play the game, you will be having the most epic fights of any FPS game out there.\nWhether you want to focus on infantry or vehicular combat, the game has you covered.\nYou can be a dedicated sniper/recon, a medic, an engineer, a sturdy heavy assault or a jetpack-toting light assault that can ignore many obstacles and surprise enemies with their pants down. You can even climb into a MAX, an exo suit designed to absorb lots of damage and break a stalemate. The infantry play greatly rewards skill and accuracy, with a big emphasis on burst firing, headshots, positioning and awareness. \nAre you a tank buff? Look no further: depending on your choice of faction you gain access to 3 unique two-man tanks, each with its own strengths and weaknesses, all featuring projectile drop and giving you much room to grow in skill. A good tank crew can have a massive impact on the battlefield.\nAre you a fan of aircraft? Planetside provides several, from the light empire specific fighters, which work like a cross between a jet and a helicopter, allowing for every manoeuvre you can think of, to the powerful 3-man liberators and larger 6 and 12 man transport ships. Whether you're looking to provide air support to your faction, or simply scour the skies looking for enemy air to engage, you're sure to have fun, epic battles.\nThere are also lighter, one-man tanks, 3-man buggies and an ATV, which can be equipped with an invisibility cloak for surprise attacks and stealthy passage through enemy territory.\nThere is so much depth to this videogame that you can literally play it for thousands of hours without ever getting bored of it, since you can keep rotating through the many different playstyles available in order to keep it fresh. Really, Planetside 2 is like several solid games packaged into one, and all of it FOR FREE. \nThere are some who will argue that the game is P2W but if you pay attention you'll notice that most of them have barely played the game for any substantial length of time. What they are experiencing is simply the learning curve of the game, which is admittedly a bit tough at first, but rather than allowing time for their skill to mature they chalk it up to premium items/features. THIS IS FALSE. The only payed-for exclusives are purely cosmetic. Everything else, you can obtain at a reasonable pace through playing the game. I should know. I never spent any money on it.\n\nDo yourself a favour and try this game out. Have patience, look for tutorials, ask for tips whenever you get the chance. Once you're through the baptism by fire that all of us have gone through you'll start having crazy amounts of fun!", "timestamp_created": 1462918450, "timestamp_updated": 1462918633, "voted_up": true, "votes_up": 189, "votes_funny": 10, "weighted_vote_score": "0.862783491611480713", "comment_count": 28, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "7741745": {"recommendationid": "7741745", "author": {"steamid": "76561198040910226", "num_games_owned": 263, "num_reviews": 8, "playtime_forever": 3043, "playtime_last_two_weeks": 0, "last_played": 1399505053}, "language": "english", "review": "This game is everything I could've wanted from a MMOFPS, and for good reason.  Battles are massive, epic, and get the blood pumping like no other FPS I have played before.  The sheer beauty of battle is unmatched by any other shooter I've experienced.  Combat mechanics, customization, and leveling are all done very well, as the advantages they give are not game changing, and they can all be unlocked without purchase.  (Excluding purely cosmetic items, they are for purchase only)  Squad mechanics are extremely deep, and are the most polished I've seen out of any game; it allows for levels of strategy I've never before seen in a shooter, and is all too fun creating a warpath with your buddies.  Planetside 2 used to be extremely unoptimized, and was the bane of all but high end cards; however, thanks to some recent optimizations, I am easily running a solid 60 frames on ultra settings with a single GTX 660.  As for the negatives, this game is very heavily reliant on team work.  If your faction, squad, and individual soldiers are not all on the same page, it can quite easily ruin battles.  My suggestion: form squads with your buddies, whip out your headset, and take command.  Overall, Planetside 2 is quite easily the most polished F2P shooter available on steam, perhaps even surpassing TF2.  If you have a computer that can handle it, definitely give PS2 a shot, it is worth it.", "timestamp_created": 1385406147, "timestamp_updated": 1385406147, "voted_up": true, "votes_up": 697, "votes_funny": 0, "weighted_vote_score": "0.889846146106719971", "comment_count": 26, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40179186": {"recommendationid": "40179186", "author": {"steamid": "76561198097334877", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 3354, "playtime_last_two_weeks": 3, "last_played": 1550786781}, "language": "english", "review": "This game is about six years old.\n\nThis game is about six years old, and I firmly believe it is the best modern shooter game created, or at least the best modern MMO FPS created.\n\nIn Planetside 2, you don't just get a modern infantry shooter, complete with squad combat on a tactical level. You get a tank simulator, a base-building game (though it could use some work), a dogfighting simulator, a stealth game (Infil is best class), and most importantly; a good mmo that relies on skill above purchasing \"better\" weapons to mow down foes. \n\nYes, there are microtransactions...but nothing you actually need to buy. Microtransactions here are for vanity's sake, or to support the dev team and the people who keep this awesome title running. You can get as good as any pro player, without spending a dime, and you can die to Battle Rank 1's as a Battle Rank 120 (highest rank in the game), because this is a game of skill, teamwork, and tactics on a truly unmatched scale in modern gaming.\n\nThe community is small, but getting into any active group with time to help you learn and grow as a player is well worth it and will be rewarding in the long run. Any problems with weapons, kills, or such can be solved by perusing the community's wealth of Youtube videos, and putting in practice ingame.\n\nIn short, this game is amazing, and you should play it.\n\nWhat, you still reading the review? Go play it, it's free.\n", "timestamp_created": 1518927746, "timestamp_updated": 1518927746, "voted_up": true, "votes_up": 49, "votes_funny": 4, "weighted_vote_score": "0.762288689613342285", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26307852": {"recommendationid": "26307852", "author": {"steamid": "76561198053228141", "num_games_owned": 62, "num_reviews": 5, "playtime_forever": 125340, "playtime_last_two_weeks": 0, "last_played": 1543056776}, "language": "english", "review": "Awesome game, steep learning curve but very rewarding. Real F2P model. After 2 years of mismanagement, the game is now into good hands.", "timestamp_created": 1477805797, "timestamp_updated": 1477805797, "voted_up": true, "votes_up": 55, "votes_funny": 0, "weighted_vote_score": "0.725432634353637695", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38767797": {"recommendationid": "38767797", "author": {"steamid": "76561198066090000", "num_games_owned": 273, "num_reviews": 19, "playtime_forever": 8370, "playtime_last_two_weeks": 0, "last_played": 1546749948}, "language": "english", "review": "TO ANYONE NEW WHO IS INTERESTED IN PLAYING PS2:\n\nI've been playing for some time so I'll give you  a quick rundown.\n(TL;DR at bottom)\n\nPlanetside 2 is an mmofps where three factions are at a constant conflict with eachother. The game features battles on an incredibly large scale and the battlefield is super dynamic. The main objective is to attack and defend numerous bases on the map to increase the chance of victory for your faction. The battlefield is always changing and communication is important. There are both ground vehicles and air vehicles, countless weapons to choose from (though you may have to work for some) and a large variety of appearance changes through micro-transactions.\n\nThe game itself has been around since 2012 but has aged beautifully. I'm a standing veteran of PlanetSide 1 and although I miss some aspects the first had that the second hasn't offered, this still doesn't change my opinion on the game.\n\nThe Factions:\n\nTerran Republic(TR) are pretty much space commies as far as politics but are my preferred faction to play. Their colors are Red and Black\n\nNew Conglomerate(NC) are more like Freedom Fighters who scream Guerrilla Warfare. Their colors are Blue and Yellow\n\nVanu Sovereignty(VS) are the religious nutbags who prefer alien tech rather then human tech. They have laser guns and stuff and love to wear spandex. Their colors are Purple and Black.\n\nBelow are the official propaganda videos by the devs to get a better understanding of the factions.\n\n\nTR: https://www.youtube.com/watch?v=CHN9CdBqSYM\n\nNC: https://www.youtube.com/watch?v=ErA4jNfVSIM\n\nVS: https://www.youtube.com/watch?v=JkTnvST9Teg\n\nIf at all this game interests you then please give it a go! It's totally free to play and a blast. The battles are hectic, there are different continents to fight on and the maps are colossal.\n\nTL;DR:\n\nPlanetside 2 is a massive mmofps featuring a large ever-lasting conquest between 3 factions (Terran Republic, New Conglomerate, and Vanu Sovereignty). Your objective in the game is to take and hold command bases from enemy factions in a dynamic battlefield which is always changing. Partake or command squads and fight for your army. (See videos for more info on factions)", "timestamp_created": 1514438860, "timestamp_updated": 1546382750, "voted_up": true, "votes_up": 72, "votes_funny": 2, "weighted_vote_score": "0.809232175350189209", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25094018": {"recommendationid": "25094018", "author": {"steamid": "76561198043711449", "num_games_owned": 197, "num_reviews": 4, "playtime_forever": 26558, "playtime_last_two_weeks": 18, "last_played": 1551173769}, "language": "english", "review": "This is the only game that lets you be:\n- a jetpacked commando dropping from an airship, causing mayhem behind enemy lines \n- a cloaked predator-style hunter with a crossbow, an unseen menace thinning enemy reinforments.\n- a defiant squad captain, quietly leading a ragtag team to glory as the higher-ups squabble.\n- a sadistic bomber gunner, looking down on the insects below, laughing maniacally while liberating dozens from the shackles of their puny lives.\n- a grizzled war vet forced out of retirement to support the war effort as an engineer/miner/truck driver, dodging enemy tank fire, designing bases and meeting supply deadlines.\n\nNothing so far in the FPS genre is close to matching Planetside 2's sense of scale. All out infantry, tank and aircraft combat with thousands of other players in a seamless large map. Every so often you'll get that epic 2-hour, 300 man-fight. There's something unique about the feeling of fighting hordes of tanks and endless swarms of infantry, knowing behind each unit is a person controlling, thinking and adapting.  With comms blaring with callouts for aerial bombardment and coordinated pushes into crucial control points, the immersion you get from this game is pretty intense. \n\nThe rest of the time, you find yourself looking for ways to be entertained, and still, the game isn't bad at doing so. Each infantry class and vehicle offers a unique playstyle and allows for quite a bit of role play and experimentation. \n\nI've logged around a thousand hours in this game. Sure, the experience has been a bit uneven, and it's definitely not for everyone. Maybe 1/5th of that time was wasted on capping almost empty bases, or mindlessly spawn camping with a zerg that could care less about strategy. Still, this game definitely has its moments, and offers just enough unique thrills to keep coming back.\n\n\nPros:\n+ One of the few MMOFPS, now with player construction.\n+ Game on high graphics is pretty epic. Vast landscapes with all the players make for some cool screenshots.\n+ Outfit camaraderie and shenanigans.\n+ Solid FPS mechanics, vechicle controls and gunplay with dozens of weapons for every playstyle. \n+ Devs are pretty decent communicating and responding to community feedback.\n+ Riding the first time with a competent air squad playing flight of the valkyries, raining down sweet justice.\n+ Netcode is pretty impressive considering how many things are on screen at once\n\nCons:\n- Hearing flight of the valkyries too much, dying 5 seconds after taking off due to AA fire.\n- Hiding like a rat in spawn room due to PTSD from to too much air/tank bombardment.\n- The DOTA of FPS. You'll need several dozen hours just to learn the game\n- Some dull moments just moving around or waiting for capture timers", "timestamp_created": 1471970160, "timestamp_updated": 1471970421, "voted_up": true, "votes_up": 66, "votes_funny": 21, "weighted_vote_score": "0.800354897975921631", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28538951": {"recommendationid": "28538951", "author": {"steamid": "76561198129520214", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 20004, "playtime_last_two_weeks": 0, "last_played": 1545248566}, "language": "english", "review": "This is the best free to play fps game out there, it is not pay to win, its pay to look better than everyone else, only con with this game is that it is poorly optimized, its running on an old engine, the best computers will suffer in a large battle. The maps are huge, graphics arent amazing, but arent bad, this game cant have battlefield style graphics becuase the lag would be out of this world. i played this game *without steam* (you can download the launcher from daybreak) for a long time, i have around 1500 hours, and i have spent 1000$ to look badass on all my characters, this game is worth a shot, but it isnt for everyone... it is hard to get used to... hope this is helpful.", "timestamp_created": 1482443802, "timestamp_updated": 1482796144, "voted_up": true, "votes_up": 66, "votes_funny": 4, "weighted_vote_score": "0.779731631278991699", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47793080": {"recommendationid": "47793080", "author": {"steamid": "76561198128292214", "num_games_owned": 91, "num_reviews": 5, "playtime_forever": 32132, "playtime_last_two_weeks": 676, "last_played": 1551826200}, "language": "english", "review": "Always find myself coming back to this game.  Nothing else is quite like it.", "timestamp_created": 1545699422, "timestamp_updated": 1545699422, "voted_up": true, "votes_up": 36, "votes_funny": 1, "weighted_vote_score": "0.754399240016937256", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35653998": {"recommendationid": "35653998", "author": {"steamid": "76561197977647297", "num_games_owned": 669, "num_reviews": 20, "playtime_forever": 10127, "playtime_last_two_weeks": 0, "last_played": 1545121008}, "language": "english", "review": "[h1]Full Scale War: The Game[/h1]\n\nPlanetside 2 is a gigantic multiplayer FPS featuring warfare that ranges in scale. From small skirmishes between 10-20 players, to massive conflicts with hundreds fighting over single bases, this is the game that materializes a dream for the FPS gamer.\n\n[h1]Fight Smarter, Not Harder[/h1]\n\nRewarding quick thinking and superior positioning is a tough order when some battles feature players in every possible position. Planetside 2 accomplishes this by encouraging support play in conjunction with the all out assault. Spending your early certs (the basic currency, gained with XP) on support gadgets and improving survivability with shields, sprint speed, or defensive tools is generally more valuable than acquiring a single expensive gun.\n\n[h1]Tons of Unlockables, At a Cost[/h1]\n\nPlanning out how to advance your character is a necessary task with so many unlockable items. Tons of guns, support items, and implants await. That said, past level 15, when a new characters stops getting 100 certs per level, the players performance is directly tied to how many certs they can gain. For support players or less skilled combatants, this can significantly increase the grind time. \n\nThis game is pay-to-advance, not pay-to-win. The first weapons the player gets are effective enough that intelligent usage and accuracy will trump just having different guns bought with the premium currency. Niche weapons excel at certain areas, but I have found in my play time (much greater than displayed) that the starter guns are fine.\n\n[h1]Bad Drivers, Oblivious Medics[/h1]\n\nSo many items, and such large scale conflicts, are a source of great and ever-changing fun. That said, its still competitive/cooperative multiplayer. Hinted at in the title, the player will be faced with many situations where team mates kill them on accident or on purpose. They'll ignore the best course of action in winning a territory in favor of farming kills. Bad tank drivers squish engineers. \n\nThese things happen. It's okay. Most of the time its a genuine accident, and the player will even sometimes nab a few TKs of their own for various reasons. Use the times your allies are incompetent to encourage you to not follow their example.\n\n[h1]Heavy Learning Curve[/h1]\n\nI have yet to lay eyes on someone who just walked into Planetside and immediately started laying waste. This is a tough game, and it requires (for most people) some time and practice to get the pattern of combat down. Take the time to pay attention to where a player dies, where they were shot from, and the weapons used for both of them. Observe as often as you fight.\n\n[h1]Conclusion[/h1]\n\nNo game is without fault, but most people don't look for flawless games, they look for games that puts them somewhere, and sometime, they want to be. \n\nIf where you want to be is in the middle of an 8x8 kilometer map, where single bases are bigger than some other FPSs entire multiplayer maps, this is it. If you want to witness a screaming dogfight over an onslaught of two opposing tank lines, welcome. If you want to witness the majesty of hundreds of tracers drawing neon patterns across the desert sky, you're in the right place. \n\nLike any game, enjoy it for what it is.\n\nAnd what this is, is war.", "timestamp_created": 1507791855, "timestamp_updated": 1507791855, "voted_up": true, "votes_up": 63, "votes_funny": 3, "weighted_vote_score": "0.841264426708221436", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26294608": {"recommendationid": "26294608", "author": {"steamid": "76561197988830520", "num_games_owned": 152, "num_reviews": 5, "playtime_forever": 17599, "playtime_last_two_weeks": 0, "last_played": 1520993871}, "language": "english", "review": "I've spent so many hours on this game... and I still feel like I'm learning and getting better. \n\nDo you want to fly close air support? GREAT!\nDo you want infantry slug fests where things can go back and forth in a pitched fight? GREAT!\nDo you want to feel like a hell-jumper, being hot-dropped into a combat zone? GREAT!\nDo you want small fights in restricted tiny maps, and be harrassed by 12 year olds? NOPE!\nDo you want massive tank battles that span kilometers? YUP YUP YUP!\n\nThis game is massive in scale, if you want tiny, crappy COD style firefights then this isn't for you. If you want to be screamed at by squeekers, then this ALSO isn't the game for you. The community tends to be more mature, which is rare for a Free to Play. It has a steep learning curve, but they've recently made huge strides towards making a great New Player Experience. It is a beautiful game for what it is, but you'll need a powerful PC to handle it. Keep in mind, that there could be 1000 people on the same continent as you. There could be 200 people or more fighting over the same base as you. There is not other game out there that can even APPROACH this scale. Even Mound & Blade with 200 person sieges doesn't come close to feeling as epic.", "timestamp_created": 1477757021, "timestamp_updated": 1477757021, "voted_up": true, "votes_up": 62, "votes_funny": 8, "weighted_vote_score": "0.757348060607910156", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41197287": {"recommendationid": "41197287", "author": {"steamid": "76561198122726848", "num_games_owned": 181, "num_reviews": 14, "playtime_forever": 49564, "playtime_last_two_weeks": 16, "last_played": 1551689649}, "language": "english", "review": "===[ ❤ Audience: ]=== \n☑ Kids\n☑ Everyone\n☑ Casual players\n☑ Pro players\n\n===[ ☼ Graphics: ]=== \n☐ Potato\n☐ Really bad\n☐ Bad\n☐ OK\n☐ Good \n☑ Beautiful \n☐ Masterpiece\n\n===[ $ Price/quality: ]=== \n☐ Full price\n☐ Wait for sale\n☐ Average\n☐ Refund it if you can\n☑ Don't buy it, it is free for pete`s sake\n\n===[ ☣ Requirments: ]=== \n☐ 90' PC\n☐ Minimum\n☐ Medium \n☑ Fast\n☑ High end \n☑ NASA computer\n\n===[ ☼ Difficulty: ]=== \n☐ You just need 2 arms \n☐ Ez\n☐ Easy to learn / Hard to master \n☑ Hard (first few hours)\n☐ Dark Souls\n\n===[ ۞ Game time/length ]=== \n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☑ Endless\n\n===[ ♬ Story] === \n☑ It doesn't have\n☐ Still better than Twilight\n☐ Average\n☐ Good\n☐ Fantastic\n\n===[ § Bugs ]=== \n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☑ Few Bugs\n☐ You can use them for speedrun\n☐ Nothing\n\n===[ ✦ Others: ]=== \nMultiplayer: Yes\nSingleplayer: You Wish", "timestamp_created": 1522563801, "timestamp_updated": 1522563801, "voted_up": true, "votes_up": 161, "votes_funny": 52, "weighted_vote_score": "0.82947993278503418", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33794531": {"recommendationid": "33794531", "author": {"steamid": "76561197960379146", "num_games_owned": 549, "num_reviews": 18, "playtime_forever": 13681, "playtime_last_two_weeks": 0, "last_played": 1549720350}, "language": "english", "review": "Great MMOFPS.\nNot particularly pay to win either. A good tactic always wins out.\nOh and troops, lots of troops.\n8/10 .... free ffs", "timestamp_created": 1501015009, "timestamp_updated": 1501015009, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.587746083736419678", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15675760": {"recommendationid": "15675760", "author": {"steamid": "76561198050292346", "num_games_owned": 160, "num_reviews": 9, "playtime_forever": 19392, "playtime_last_two_weeks": 0, "last_played": 1533185593}, "language": "english", "review": "This game is like real life. No matter what you do, you are insignificant. You may feel like you can make a difference, but you never will.\n \n11/10 would feel insignificant again", "timestamp_created": 1430685183, "timestamp_updated": 1430685183, "voted_up": true, "votes_up": 1002, "votes_funny": 1788, "weighted_vote_score": "0.854506075382232666", "comment_count": 24, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38686745": {"recommendationid": "38686745", "author": {"steamid": "76561198022227919", "num_games_owned": 154, "num_reviews": 1, "playtime_forever": 65005, "playtime_last_two_weeks": 0, "last_played": 1547420676}, "language": "english", "review": "With over 1k hours in the game I feel I can give a pretty good review on it. Overall, it's a good game. Very much worth the $0 you have to pay to play it. However, you will need a decent rig if you want to be able to run this properly. There ARE fights where there's hundreds of players fighting at the same time 1v1v1 since there's three factions. It can get Very demanding on your PC.\n\nIt's a HUGE grind. By huge, I mean i have 1,027 hours on record by the time of this review. And I haven't come close to unlocking all the upgrades to vehicles and infantry. This game requires you to pick your focus, and then channel all of your Certs (In game currency) towards that specific role. Afterwards, you branch out. So if you want Infantry play, pick your style (Heavy, Medic, Engineer, Light Assault, Recon) and spend your certs only in that role until you are comfortable with it. Then move on to either another infantry role or branch out to a specific vehicle.\n\nNOT MENT TO PLAY SOLO. This is a massive game, with a grander scale of battle than Battlefield or Battlefront will ever offer. While yes, you can lone wolf the game and get moderate success. You will find the true beauty of the game was suppose to be played in a cooperate fashion. Join an Outfit, find a squad, get on Mic, and have fun. Some of my favorite gaming moments have come from Galaxy drops in a full Outfit Platoon with everyone coordinating together. Don't be afraid to reach out to players and make friends. The Main Battle tank is a two man vehicle, and a coordinated team will dominate other tanks who aren't talking to each other.\n\nThis is PLAY TO WIN. Not PAY TO WIN. Money isn't going to get you all the kills in this game. However, time already spent in it will. This isn't me saying \"Because the dude has played more, he will outplay you more\". No, the guy who has logged 1000 hours, will have accumulated more CERTS, and will have spent those Certs on upgrades. This could mean his Main Battle tank has a Reload speed of 2.1 seconds, when your MBT has a reload speed of 3 seconds. This is a huge advantage, not to mention upgraded gunner weapons, specialized main weapon, defensive certs etc etc. A player with more upgrades has a huge advantage over someone who doesn't. If you are new, find a more experienced player and stick with them. Use their vehicles until you can grind out the certs yourself. Lots of players Need and Love a dedicated gunner, become that and learn the ropes.\n\nZERGING, Oh...my...sweet...merciful god, the zerging. This ruins the game more than anything else. This is when you get outpopulated by the enemy on such a massive scale that there is literally nothing you can ever do about it. You and the other 20 people in base suddenly find yourself the 10% populating in the region. With the enemy sporting 90% dominance. Meaning they have more bodies on point than you have ammo in your gun. There is nothing you can do other than shake your head, pack your backs and go somewhere else. Re-deploying destroys a lot of maneuvering in this game. You will find yourself hopping from one base to the other in the form of self-suicides rather than just grabbing a vehicle and driving there.\n\nPlanetside 2 isn't perfect, but it's still a good game. And despite it's flaws, me and my friend have had soo much fun playing it together and trying different things. I very much recommend this game if you have a group of friends you play with that enjoy a good FPS. Even for the solo player you can join an Outfit and partcipate in coordinated strikes. You will find there are quite a few outfits that are quite dedicated.\n", "timestamp_created": 1514271315, "timestamp_updated": 1514271315, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.71849745512008667", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "10328893": {"recommendationid": "10328893", "author": {"steamid": "76561197970757029", "num_games_owned": 511, "num_reviews": 7, "playtime_forever": 2698, "playtime_last_two_weeks": 0, "last_played": 1456124220}, "language": "english", "review": "================================\nhttps://www.youtube.com/user/fdreviews\n================================\n\nJournal Entry 1 \n\nI'm dropped into a large spacey looking corridor, I find myself inside a tube surrounded by a pulsey looking shield... I guess this is what grows me? mom?...no.... After exiting the shielded tube I am now in a room of commotion, 20+ other players are running by in a hurry to go somewhere. I find myself confused and really out of place, like the new guy starting a job and everyone else can't be bothered to explain... sort of a \"get out of the way were busy here\" vibe. Thats cool, ill just do my own thing! \n\nJournal Entry 2 \n\nAfter exploring the first few rooms full of shiny lights and blinking consoles I've decided to head outside the structure. I looked at the doorway leading outside, I can hear horrid amounts of explosions and gunfire and machines moving around. Its quite intimidating... I see 8 troops running out the door into no mans land. I then look to my right hand side to witness a giant walking heavy mech person... my god its beautiful.... the faceplate is painted to look like something out of a Jason murder movie, he has duel Gatling guns on each arm. He stops and looks at me for a second, I suddenly feel like everything might just be alright. He turns and heads out the door.... Now... when I deployed I unknowingly chose a very very violent and war torn section of the map. I walked outside and my Jaw hit the floor in amazement. \n\nJournal Entry 3 \n\nUpon leaving the safety of the structure I was now standing on the steel ledge overlooking the most large scale and violent battlefield I've seen in a FPS to date. Above me dozens of ships waged war on each other, firing rockets and lasers through the sky. A larger ship swoops down onto a hill in the back and unloads soldiers.... below me appears to be hundreds of men charging from this structure towards and equally large force of enemies. Dozens of tanks lined up on both fronts exchange fire while smaller armed Suv's and Quads blaze passed each others lines, exploding and fleeing. \n\nJournal Entry 4 \n\nOn my level, engineers are desperately repairing turrets and heavy walking mechs. Medics run frantically to revive the downed soldiers that litter the parapets. Mounted machine guns and rocket fire are so frequent that you don't even know who to start shooting at. Standing back from the battle I can only watch in complete amazement at the scale of this battle. \n\nJournal Entry 5 \n\nArmed only with my small assault rifle I work up the courage to join the fight. I walk forward on to some type of holographic elevator that takes me straight down to the battle. I look up and can see that there is a large squad of men floating down the elevator behind me. We touch down on the ground and without warning everyone charges forward, I do the same, completely ignoring the tank shells and bullets flying past our heads. Its crowd mentality now, I am no longer thinking for myself I'm just following the flow of this ocean of soldiers. \n\nJournal Entry 6 \n\nI can roughly guess that there is about 30 of us in a squad running up this field. The explosions are starting to lower that number significantly as we get closer to the enemy lines. I don't know the men around me but I feel safe knowing that im not alone. The flyers have now focused in on our squad and begin to rain down rockets from the sky, medics are not able to keep up with the casualties anymore, they have to run for their own lives. We finally reach cover behind a large rock, our numbers are now more like 9 or 10 after the charge. We have one heavy mech with 2 engineers constantly repairing him and a couple medics that are keeping everyone alive. \n\nJournal Entry 7 \n\nSuddenly 3 guys are dropped from the group, it appears a sniper far off on a hill to the right has flanked our position. We can't run back and we can't run forward, we can only dance around like fish in a barrel dodging a mariners spear. I can hear one of the other guys open mic call out to a friend for support, within seconds 10 tanks roll over the snipers position and we safe once again. We are now down to 6 guys, we are really far from our lines and it doesn't appear that more reinforcements are coming to join us anytime soon. \n\nJournal Entry 8 \n\nThe guy with the open mic tells us that we need to try and flank the enemy lines and take out some of their snipers, he says that we are all more then likely going to die but at least we can make a dint. Well... its been a good run, time to go out and make a good last charge. \n\nJournal Entry 9 \n\nWe burst from our cover and charge the left side of the hill that is now considered the sniper's line. I'm not in slow motion but if I was I think id be yelling \"FREEDOM\". We clear the field losing only 1 guy to sniper fire, 5 of us charge the hillside and over the top. We were expecting to see a couple snipers that we could take out easily.... unfortunately there was about 60+ ground troops all crouched behind the hill, I think they were amping up for a big attack. so here is the 5 of us idiots standing at the top of a hill like scarecrows in a parking lot. The 60+ soldiers open fire and within the blink of an eye were all very dead and laying on the hill. Today I learn that being the hero is another mans game, ill stick to hiding in the back with a rocket launcher next time.", "timestamp_created": 1401750690, "timestamp_updated": 1509084373, "voted_up": true, "votes_up": 749, "votes_funny": 8, "weighted_vote_score": "0.857149422168731689", "comment_count": 18, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43891869": {"recommendationid": "43891869", "author": {"steamid": "76561198074116067", "num_games_owned": 145, "num_reviews": 8, "playtime_forever": 5669, "playtime_last_two_weeks": 0, "last_played": 1533838918}, "language": "english", "review": "Seeing a platoon of about 12 tanks, what feels like hundreds (probably is) of infantry, 5 mobile spawn units full of troops, accompanied by fighters in the air all riding through the desert to take a massive outpost is an amazing sight. This game has the largest multiplayer battles ever still to this day, the best part about it is that it feels like a lot of people are coming back, recently there have been battles that wage FOREVER full of lasers, cannons, and machine gun fire that almost never seem to end and I love it. It's like if you could play the board game RISK and also play from the point of view of the troops in the war. Almost every moment is like an action movie. Some thinking is involved if you want to make a real difference in the war, overall best MMO FPS there is.", "timestamp_created": 1533217292, "timestamp_updated": 1533217292, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.775877773761749268", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38205633": {"recommendationid": "38205633", "author": {"steamid": "76561198027526579", "num_games_owned": 86, "num_reviews": 10, "playtime_forever": 19862, "playtime_last_two_weeks": 0, "last_played": 1535372801}, "language": "english", "review": "i remember playing this when my pc was a potato\nanything more than 12 players near me would turn my view into a beautiful symphony of abstract colors and shapes...\n\n\n\n\nnow i can handle up to 24", "timestamp_created": 1512900326, "timestamp_updated": 1512900326, "voted_up": true, "votes_up": 58, "votes_funny": 202, "weighted_vote_score": "0.80283808708190918", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33790435": {"recommendationid": "33790435", "author": {"steamid": "76561198059446117", "num_games_owned": 136, "num_reviews": 9, "playtime_forever": 2158, "playtime_last_two_weeks": 24, "last_played": 1551120030}, "language": "english", "review": "Galaxic version of Battlefield for free\n+1", "timestamp_created": 1501002176, "timestamp_updated": 1501002176, "voted_up": true, "votes_up": 42, "votes_funny": 8, "weighted_vote_score": "0.739305078983306885", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41550827": {"recommendationid": "41550827", "author": {"steamid": "76561198098406326", "num_games_owned": 12, "num_reviews": 3, "playtime_forever": 71327, "playtime_last_two_weeks": 122, "last_played": 1551651943}, "language": "english", "review": "Sometimes i get bored and leave the game hanging for a few months. BUT, then I come back, and I keep coming back. And there are still people playing it so I stay. And i have fun.\n\nAND SINCE THERE IS NO OTHER GAME OUT THERE EVEN REMOTLLY CLOSE TO OFFERING A SIMILAR EXPERIENCE I WILL KEEP COMING BACK AND PLAYING THIS GAME. and having fun. and then getting bored and leaving. but always coming back .", "timestamp_created": 1524034185, "timestamp_updated": 1524034185, "voted_up": true, "votes_up": 47, "votes_funny": 13, "weighted_vote_score": "0.753460109233856201", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28818262": {"recommendationid": "28818262", "author": {"steamid": "76561198055401825", "num_games_owned": 137, "num_reviews": 10, "playtime_forever": 4184, "playtime_last_two_weeks": 0, "last_played": 1490690094}, "language": "english", "review": "As a Terran Republic main, I love logging into the login screen with the TR soldier getting strangled by the Vanu Sovereignty  soldier. Every single time. 10/11", "timestamp_created": 1483079099, "timestamp_updated": 1483079099, "voted_up": true, "votes_up": 52, "votes_funny": 60, "weighted_vote_score": "0.743042469024658203", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39315200": {"recommendationid": "39315200", "author": {"steamid": "76561198080240355", "num_games_owned": 175, "num_reviews": 29, "playtime_forever": 18693, "playtime_last_two_weeks": 0, "last_played": 1537137378}, "language": "english", "review": "If you want to see a dead game, go see blackwake.\n\nThere's a definitive difference between a dead game and an old game.\n\nThis game sure isn't what it used to be, that's guaranteed. It's still not dead though.\n\nIt's players are the only thing driving it on, their loyalty to the battlefields of Auraxis fuel this game.", "timestamp_created": 1515864881, "timestamp_updated": 1515864881, "voted_up": true, "votes_up": 57, "votes_funny": 3, "weighted_vote_score": "0.745733499526977539", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36774606": {"recommendationid": "36774606", "author": {"steamid": "76561198029468523", "num_games_owned": 105, "num_reviews": 3, "playtime_forever": 33717, "playtime_last_two_weeks": 0, "last_played": 1515177556}, "language": "english", "review": "only the great community keeps this game alive", "timestamp_created": 1511381084, "timestamp_updated": 1511381084, "voted_up": true, "votes_up": 62, "votes_funny": 10, "weighted_vote_score": "0.772284209728240967", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43594911": {"recommendationid": "43594911", "author": {"steamid": "76561198373133431", "num_games_owned": 6, "num_reviews": 2, "playtime_forever": 3874, "playtime_last_two_weeks": 76, "last_played": 1551633388}, "language": "english", "review": "====<Graphics>====\n☐ Gorgeous\n☐ Beautiful\n☐ Good\n☑ Fine\n☐ Working\n☐ Fail\n☐ Disgusting\n☐ MS Paint\n\n====<Gameplay>====\n☐ Addicting\n☑ Extremely Good\n☑ Good\n☐ Ok\n☐ Boring\n☐ Bad\n☐ Fail\n\n====<Players>====\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Everyone\n\n====<Audio>====\n☐ Eargasm\n☐ Extremely Good\n☐ Good\n☑ Decent\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n====<Difficulity>====\n☐ Dark Souls\n☐ Difficult\n☑ Not Easy\n☐ Easy\n☐ Super Easy\n☐ Grandpa\n☐ New Born\n\n====<PC>==== \n☐ NASA Super Computer\n☐ Rich Af\n☑ Fast\n☑ Ok\n☐ Bad\n☐ 1990\n☐ Stone\n\n====<Grind>====\n☐ OnlyFarming\n☐ Farming\n☐ Half Farmer\n☐ Can be Grindy\n☐ Average\n☑ Almost no Grinding\n☐ Nothing\n\n====<Price>====\n☐ Buy it\n☐ Worth the price\n☐ Wait for Sale\n☐ If you have leftovers\n☐ Not Worth the price\n☐ To Much\n☑ Free\n\n====<Story>====\n☐ Materpiece\n☐ Super Good\n☐ Good\n☐ Average\n☐ Not Good\n☐ Is Something i Guess \n☑ Doesn't have?\n\n====<Length>====\n☑ Space and Time\n☑ Long\n☐ Average\n☐ Depends\n☐ Short\n☐ To Short\n\n====<Bugs>====\n☐ None\n☐ Almost no Bugs\n☑ Some Bugs \n☐ Sometimes Annoying\n☐ Ruining the game\n☐ Only Bugs\n\n====<Salt Level>====\n☐ Salt Storage\n☐ Salty\n☑ Some Salt\n☐ Normal\n☐ Almost Nothing\n☐ None\n\n====<Multiplayer>====\n☑ Awesome\n☐ It's Good\n☐ Ok\n☐ Bad\n☐ Nope\n☐ None\n\n====<Optimization>====\n☐ Awesome\n☐ It's Good\n☑ Ok\n☐ Bad\n☐ Horrible", "timestamp_created": 1531870937, "timestamp_updated": 1531870937, "voted_up": true, "votes_up": 231, "votes_funny": 40, "weighted_vote_score": "0.832621097564697266", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30182254": {"recommendationid": "30182254", "author": {"steamid": "76561198143796868", "num_games_owned": 192, "num_reviews": 12, "playtime_forever": 507, "playtime_last_two_weeks": 0, "last_played": 1479923641}, "language": "english", "review": "Pros:\n  + HUGE open worlds\n  + Large servers\n  + It's FREE\n\nCons:\n  - Can be hard for new players\n  - A little bit of grinding \n\n      Planetside 2 is an online tactical shooter in which you choose to be a soldier in one of three different factions that are involved in an eternal struggle for various planets. Each faction must capture control points in order to gain control of the planet. There are 6 different soldier classes which allow for large differences in personal gameplay. Give it a try because it is free.\n\n This game was curated for PC Beta Gaming - http://steamcommunity.com/groups/PC-BetaG", "timestamp_created": 1488070158, "timestamp_updated": 1489866951, "voted_up": true, "votes_up": 51, "votes_funny": 0, "weighted_vote_score": "0.767414331436157227", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43800742": {"recommendationid": "43800742", "author": {"steamid": "76561198087411954", "num_games_owned": 92, "num_reviews": 1, "playtime_forever": 25803, "playtime_last_two_weeks": 0, "last_played": 1550459065}, "language": "english", "review": "If you've got a beefy enough PC, play it. Also\nALL WEAPONS ARE SIDEGRADES NOT UPGRADES! DO NOT BUY WEAPONS EARLY ON IN THE GAME YOU START OUT WITH THE BEST GUNS IN THE GAME, THE REST JUST SPECIALIZE. I can't make that clear enough. Also beware that matchmaking is nonexistant. So stay on koltyr if you're brand new.", "timestamp_created": 1532798706, "timestamp_updated": 1532798706, "voted_up": true, "votes_up": 51, "votes_funny": 4, "weighted_vote_score": "0.780555963516235352", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "41214961": {"recommendationid": "41214961", "author": {"steamid": "76561198021998385", "num_games_owned": 396, "num_reviews": 48, "playtime_forever": 17742, "playtime_last_two_weeks": 0, "last_played": 1545273194}, "language": "english", "review": "6 years old, and still a better game than the new COD", "timestamp_created": 1522619281, "timestamp_updated": 1522619281, "voted_up": true, "votes_up": 65, "votes_funny": 31, "weighted_vote_score": "0.771852552890777588", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33567656": {"recommendationid": "33567656", "author": {"steamid": "76561198064059062", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 46555, "playtime_last_two_weeks": 152, "last_played": 1551657758}, "language": "english", "review": "Hey guys,\n\nI don't use the steam launcher for this game, so it hasn't logged all my hours.  If you look up Cyrious at planetside2.com/players you will see pretty quick I am a long time player with over 4000 hours into the game.\n\nI think its obvious that someone that has played this long is going to give the game a positive review.  But that doesn't help most people.  But I did put together a video on the pros and cons of getting started in Planetside 2 now that it is going on a 5 year old game.  Check it out below and I hope it helps you.  Cheers!\n\nhttps://youtu.be/_LIlB0Pee04\n\nBut, a word of warning.  This is a tough game for new players.  If you do find it interesting and want to try it out, I created a bunch of new player tutorials that you can find on my Youtube channel from the above link.\n\nBe Brave.  Be Bold.  And I will see you... Planetside.", "timestamp_created": 1500149366, "timestamp_updated": 1518971213, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.644455611705780029", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33733163": {"recommendationid": "33733163", "author": {"steamid": "76561198121407388", "num_games_owned": 55, "num_reviews": 23, "playtime_forever": 1718, "playtime_last_two_weeks": 0, "last_played": 1461136724}, "language": "english", "review": "You don't need to pay2win", "timestamp_created": 1500770889, "timestamp_updated": 1500770889, "voted_up": true, "votes_up": 80, "votes_funny": 10, "weighted_vote_score": "0.746262907981872559", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17820530": {"recommendationid": "17820530", "author": {"steamid": "76561198096725644", "num_games_owned": 81, "num_reviews": 5, "playtime_forever": 68034, "playtime_last_two_weeks": 46, "last_played": 1551252184}, "language": "english", "review": "PROS:\nMotivation to build new computer\n\nCONS:\nI still don't have new computer\n\nPS Since over 1,000 People found this Review 'Helpful', Then I should just point out that this game needs a pretty good CPU to handle it.", "timestamp_created": 1441064137, "timestamp_updated": 1455860124, "voted_up": true, "votes_up": 693, "votes_funny": 1686, "weighted_vote_score": "0.845419168472290039", "comment_count": 35, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28292951": {"recommendationid": "28292951", "author": {"steamid": "76561198046596383", "num_games_owned": 136, "num_reviews": 4, "playtime_forever": 1456, "playtime_last_two_weeks": 0, "last_played": 1405450525}, "language": "english", "review": "This game is dope. hands down best MMOFPS, and personally my fav FPS.\n\n**Pay-to-Win elements? Sure...** (See below)\n\nIs paying, to be competitive, mandatory? Lol no.\n\nMoney doesnt buy skill and I've taken down many a ~insert name here~ without spending a dime on this game\n\nShotgun light assault trooper and going behind enemy lines can prove how much money doesn't help.\n\nYour \"Credit-Card-loaded-Tank\" still has nothing on my hard earned packs of C4 and my Death-from-Above-Jetpack.\n\n*Phwmb Phwmb* *Click* *BOOM* = Free\n^placing c4^\n\nP.S. ignore my steam hours as i play through planetside 2's own launcher, not steam\n\n\nas for a real review.\n\nPros.\n\nFree +\nFun +\nIntense+\nAwesome+\nLots of different combat scenarios. Tanks, Aircraft, Infantry, Bases, Loadouts, Large... LARGE maps, And all that mixed on different scales. sometimes you will get into 1v1 combat, sometimes 6v20, sometimes 400 v 400, sometimes 1 v 400, sometimes sniper wars, you name it.\n\nCons.\n\nA powerful PC is reccomended though not mandatory. -\nNo Helicopters =(    -\n^I can understand why there are no Helicopters. but they would still be cool\n\n\n**As has been pointed out. This game isn't P2W. Yes you can use money to buy guns, perks, attachments, customization and other small things. All items that can boost stats can be earned in game without any RL money. Money is more of a \"shortcut\" to some things. Though any moderate gamer would be able to earn even the most expensive items in just a day or two. Hardcore PS2 gamers can probably earn them faster. My original wording of \"P2W elements\" was reffering to the shortcuts...\n\nYou will never play this game and feel like you were only beaten because he spends money and you didnt. unlike some games I will not mention... ArcheAge.", "timestamp_created": 1481390832, "timestamp_updated": 1481573887, "voted_up": true, "votes_up": 59, "votes_funny": 6, "weighted_vote_score": "0.757895469665527344", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "4829766": {"recommendationid": "4829766", "author": {"steamid": "76561198042256432", "num_games_owned": 532, "num_reviews": 79, "playtime_forever": 55458, "playtime_last_two_weeks": 0, "last_played": 1543664231}, "language": "english", "review": "Updated review, after clocking 800+ hours, reaching level 82/100 and spending the equivalent of 100+ dosh in it (with sales of course)\n\nLots of things to say, but I'll keep it quick and strict. Pros and cons.\n\nFor a video overview, check this unofficial trailer by Moukass\nhttp://www.youtube.com/watch?v=b5cHAE0eiOE\nHere's a video for new players, courtesy of Wrel\nhttp://www.youtube.com/watch?v=URIu143Si3w\n\n-------------------------------\n    Pros:\n-------------------------------\n\n♦ Unique huge open world experience\nVery hard to find  a game as massive as this. Gargantuan of a world in which every single living being is a human. Heck, even the turrets must be manned if you want them to work.\nOver three continents, each with a player cap of 2000. \nHard to pull off, but they did.\n\n♦ Vehicle game\nPlanes are hella fun if you're good. Tanks, buggies and armored are fun too. The vehicles fit well in a world as big as this and they can be specialized for anything.\n\n♦ Active dev team\nThe dev team are involved in updates and in the community (which is the whiniest community in decades). They bring out consistent changes, not always imbalanced or bugged.\n\n♦ Good graphics and effects\nIt looks good on ultra if you can run it.\n\n♦ Good FPS response for a MMO-Shooter\nSurprisingly, shooting works. It works like in any FPS with a max of 30 players, but with 2000 players max. Not as crisp as that, but it works.\n\n♦ Great to play in an organised outfit\nThat should be your main priority : Find an outfit (a.k.a. a guild), make friends with them, follow the leaders order if you want to win.\n\n♦ Game is fun to play once the battles are evenly matched\n\n♦ It's active. It won't die out this decade.            \n\n-------------------------------\n    Cons:\n-------------------------------\n\nCHECK THE COMMENTS FOR CONS SINCE IT SAID:        \n\"Your recommendation is 789 characters too long. Please shorten it and try again.\"\n\n\nHighly recommend this game if:\n- you got a good PC &\n- you are a social person &\n- you like FPS's or vehicle play (e.g. flying) &     \n- you like fun &\n- you have a big pocket or you don't care about unlockables \n\nIt's a good game. You need to try it definitely, since it's free to play.\n\nUPDATE: I just got a proper PC to play this game, and everything I said doesn't even compare if you have a good machine to run it. Everything gets better with processing power, since you can be competitive in big fights.", "timestamp_created": 1374398241, "timestamp_updated": 1511514728, "voted_up": true, "votes_up": 314, "votes_funny": 0, "weighted_vote_score": "0.851724445819854736", "comment_count": 19, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43301983": {"recommendationid": "43301983", "author": {"steamid": "76561197982667954", "num_games_owned": 285, "num_reviews": 43, "playtime_forever": 22374, "playtime_last_two_weeks": 100, "last_played": 1551584483}, "language": "english", "review": "6 years on, and there's still yet to be any other game of such grandiose scale and scope. Thousands of players from three different sides battling on foot, on ground, and air vehicles, for dozens of bases on a single continent hundreds of kilometers wide, nonstop. And there are several continents comprising the planet, mind you. No other game comes even close still, and that's saying a lot.", "timestamp_created": 1530724004, "timestamp_updated": 1530724004, "voted_up": true, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.718929111957550049", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45072355": {"recommendationid": "45072355", "author": {"steamid": "76561198044598545", "num_games_owned": 291, "num_reviews": 13, "playtime_forever": 6545, "playtime_last_two_weeks": 104, "last_played": 1551557859}, "language": "english", "review": "По-русски после английской версии. Я наиграл сильно больше чем время в стиме, так как раньше долго играл через акк российского представителя, ныне оставившего игру. \nI played a lot more than is shown in steam as I used to play on in Russian distributor's version that's no longer supported. \n\nAside from generally  being a great game, Planetside 2 is an example of a fair free-to-play model. The grind is not too fast, but is fast enough to get the best stuff for your main class in the first day of playing. Skins are the only purchase locked things, but they pose no practical advantage (well, some skins are difinitely a better camo, but playerbase seems to have unhuman vision as they tend to spot you a mile away in the trees, so it doesn't help anyway). \n\nPros:\n+Epic battles. The largest battles you can have in an fps of more than 200 players fighting for a territory for hours both in the air and on land. It could go a lot more, but now playerbase seems too small to really concentrate in a single area with bigger numbers. And some people simply prefer to stay away from meat grinders flanking enemies and capturing undefended territories. \n+Dinamic battlefields. Due to Light assault classability to fly, no battle goes the same as every time something falls on your head from a direction you'd never expected it to be. Infiltrators camo ability also opens a ton of tactical manuvers that will create a feel of a real battle.\n+Difficulty. All weapons are very deadly, but skill requirments are high. Most weapons have high rpm, but very few will kill in even a double headshot, so you have to have great control of yor weapon to outgun an opponent. Same goes for tactics, as fighting a light assault or an infiltrator in difficult terrain might be a nightmare. \n+Quick farm\n+Great weapon customisation. 90% of tools can be customized to your specific playstile as well.\n+Great diversity of weapons. There are a ton of weapons for each class. Secondary tools and abilities also come in lots of variations. Both faction locked and multyfaction guns exist, so you can farm one char, buy a multyfaction gun and go farm for another faction starting with a good weapon from lvl 1. \n+Diversity and customization of vehicles\n\nCosn:\n- Graphics are somewhat old by now. You have to remember that it's already an old game, but I'd say that it never particulary impressed me.\n- Laggs and (possibly) tickrate problems may cause some \"How the hell did this kill me\" (not too often)\n- Optimization is not great. It's highly important to play on maximum draw distance for obviouse reasons, but even my high-end pc can't go much above 70 fps on ultra and I experience drops down to 45 in huge battles. It plays well on low graphic settings thoug, as I remember polaying it on my old weak pc with satisfying framerates, so you don't have to panic that your pc won't handle it. It just won't run as good as you'd expect from 2012 game.  \n\n\nПомимо того что Planetside 2 просто является отличной игрой, это ещё и пример честной free-to-play игры. Гринд на покупку оружия не слишком быстрый, но обзавестись лучшей экипировкой для основного класса, которым вы будете играть можно за один день игры. Единственное, что можно получить только за деньги - это скины, но они не дают практических преимуществ (да, некторые скины намного лучше маскируют на поле боя, но игроки здесь, похоже, обладают сверхъестественным зрением и способны заметить вас в лесу за километр, так что оно того в любом случае не стоит). \n\nПреимущества:\n+ Эпичные бои. В этой игре вас ожидают самые крупные сражения среди всех шутеров от первого лица, в которых сражаться за территорию на протяжение многих часов могут более 200 человек. На самом деле, игроков может быть сильно больше 200 в одной локации, просто сейчас уже народу не хватает, да и многие сторонятся самых суровых мясорубок, предпочитая зайти врагу в тыл и отжать незащищённые территории. \n+ Динамичные бои. За счёт того что у десантника есть возможность летать, ни один бой не проходит одинаково. Постоянно что-то внезапно падает вам на голову с направления, о котором вы и подумать не могли. Камуфляж диверсанта также открывает много тактических возможностей. \n+ Сложность. Оружие крайне смертоносно. У большинства видов оружия крайне высокая скорострельность, но редко какое может убить даже двумя попаданиями в голову, так что для победы над противником требуется хорошо уметь контролировать оружие. Широта тактических возможностей так же добаяляет сложности: к примеру, бой против десантника или диверсанта в лесу или горах может быть настоящим ночным кошмаром. \n+ Быстрый фарм\n+ Широкий потенциал кастомизации оружия. 90% вспомогательных инструментом так же могут быть кастомизированы. \n+ Большое многообразие оружия. Есть как фракционные, так и общие виды оружия. Так можно зафармив одного персонажа купить на нём общее оружие и начать фарм на другом персе с хорошим оружием с первого лвла. \n+ Многообразие и кастомизация техники \n\nНедостатки:\n- Графика на данный момент уже немного устарела. Стоить помнить, что это уже довольно старая игра, но, честно говоря, она и в 2012 году меня не особо впечатляла.\n- Лаги и (возможно) проблемы с тикрейтом могут иногда вызывать непроизвольное \"Да как он меня убил!?\". Но не часто. \n- Оптимизация не слишком хороша. По понятным причинам очень важно играть на максимальной дальности отрисовки местности, но даже мой топовый пк не тянет игру сильно выше 70 фпс, а в особо крупных замесах может падать и до 45 фпс. Хотя на низких настройках графики игра отлично идёт даже на древних слабых пк. Я помню, что на моём старом компе она отлично шла, хотя он был старше самой игры и не был особо хорош никогда, так что не беспокойтесь, что она у вас не пойдёт. Просто возможно она будет идти не так хорошо, как вы ожидали бы от игры 2012 года.", "timestamp_created": 1538567034, "timestamp_updated": 1538567066, "voted_up": true, "votes_up": 34, "votes_funny": 6, "weighted_vote_score": "0.754478216171264648", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39670475": {"recommendationid": "39670475", "author": {"steamid": "76561198115284143", "num_games_owned": 26, "num_reviews": 5, "playtime_forever": 899, "playtime_last_two_weeks": 0, "last_played": 1517209690}, "language": "english", "review": "i came back to this looking for something thats not a call of duty game,\n\nwhat i got was a mix between halo, battlefield, star wars battlefront, and basically most warhammer games...\n\nyeah, idk but this is the best game, ive played, in the 4 years ive had an ability to game at all, 10/10 and if i could 11/10\n\nwell done developers, well done", "timestamp_created": 1517105152, "timestamp_updated": 1517105152, "voted_up": true, "votes_up": 68, "votes_funny": 6, "weighted_vote_score": "0.762991964817047119", "comment_count": 13, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25520537": {"recommendationid": "25520537", "author": {"steamid": "76561198121738231", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 34879, "playtime_last_two_weeks": 0, "last_played": 1533420976}, "language": "english", "review": "Imagine a mix of Halo and Battlefield and then imagine a thousend players in a continent scale map, that Higby thing is PlanetSide2.\n\n Play as a infantry soldier with one of the seven classes available, or be a driver in a one-man fast moving tank or a faction-unique powerfull main battle tank, or ride a buggy or a fighter or ... well you got the point.\n\n And the best part is that this is free.\n\n But be aware of the high demanding hardware to use this game, the hard-to-play for new players and the slow adquisicion on certifications.\n\n One of my favorite games.", "timestamp_created": 1473992968, "timestamp_updated": 1473992968, "voted_up": true, "votes_up": 29, "votes_funny": 7, "weighted_vote_score": "0.704742908477783203", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24165187": {"recommendationid": "24165187", "author": {"steamid": "76561198184219550", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 8136, "playtime_last_two_weeks": 84, "last_played": 1551574858}, "language": "english", "review": "The first open world, fps, massive multiplayer game i have played. I think it is a new type of fps that should be expanded throughout the video gaming industry. \n\n11/10 for creativity", "timestamp_created": 1467921142, "timestamp_updated": 1468289969, "voted_up": true, "votes_up": 52, "votes_funny": 8, "weighted_vote_score": "0.736751794815063477", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19163498": {"recommendationid": "19163498", "author": {"steamid": "76561197989560428", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 140636, "playtime_last_two_weeks": 0, "last_played": 1443137258}, "language": "english", "review": "Massively fun. Big fights accross big maps. Get in now!", "timestamp_created": 1447962688, "timestamp_updated": 1447962688, "voted_up": true, "votes_up": 198, "votes_funny": 25, "weighted_vote_score": "0.849621832370758057", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9500547": {"recommendationid": "9500547", "author": {"steamid": "76561198056519925", "num_games_owned": 25, "num_reviews": 31, "playtime_forever": 27682, "playtime_last_two_weeks": 0, "last_played": 1477481609}, "language": "english", "review": "I have played it for 1400+ hours (off steam), done 50k+ kills. \nI am looking forward to put even more time into it. \n(Free to play user).\n\nDon't know better FPS game at this time. Way better than Battlefield series.", "timestamp_created": 1394977837, "timestamp_updated": 1419673532, "voted_up": true, "votes_up": 167, "votes_funny": 0, "weighted_vote_score": "0.820405006408691406", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23122328": {"recommendationid": "23122328", "author": {"steamid": "76561198043297456", "num_games_owned": 59, "num_reviews": 5, "playtime_forever": 3564, "playtime_last_two_weeks": 0, "last_played": 1463703293}, "language": "english", "review": "There's one rule you need to learn before playing PlanetSide 2 - you are absolutely expendable. Your KD does not matter. You are just fodder in a grand conflict of hundreds of people being thrown at each other to die in a glorious(or less than glorious) fashion.\n\nAnd that is why this game is so freaking refreshing in FPS market covered with K/D ratio focused shooters that are so obsessed with telling you how great and important you are. Its specifically BECAUSE you do not matter that everything you do can matter - you do not need  to \"score kills\" to be useful and help your side. Teamwork is rewarded. Objective play is priority. You might not shoot someone in the head but you might heal, you might repair, you might build or you might serve as something as simple as a body-shield for your friend who is doing something far more important. \n\nSo if you are tired of shooters like Call of Duty or Battlefield and want to  take part in a glorious giant battles that last for hours, then grab some friends and join in. \n\nYou might not score \"the kills\" in your first time playing, but sure as hell  you will have a chance to find yourself in the middle of something mind-blowingly grand.\n\nPlanetside 2 does what CODont.", "timestamp_created": 1463856355, "timestamp_updated": 1463856355, "voted_up": true, "votes_up": 46, "votes_funny": 8, "weighted_vote_score": "0.743356823921203613", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24760225": {"recommendationid": "24760225", "author": {"steamid": "76561198050050239", "num_games_owned": 51, "num_reviews": 4, "playtime_forever": 219754, "playtime_last_two_weeks": 0, "last_played": 1507401389}, "language": "english", "review": "Planetside 2 presents features that allow advanced teamwork for its players.\n\nIt stands out mainly for its unprecedentedly massive numbers for a First Person Shooter and its elaborated Voice Over Internet Protocol.\n\nThat feel when you first embark with hundreds of players, communicating through radio channels that go beyond your unit, in large troop transport vehicules forming huge columns headed to multiple fronts, almost in awe, subjugated. Then, you realise : your adversaries will be pretty much the same size as you and there will be two teams of them!\n\nIts community is vast and diverse. Casual and competitive, lone and gregarious, they will all find a place.", "timestamp_created": 1470578531, "timestamp_updated": 1470578531, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.71846163272857666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29860179": {"recommendationid": "29860179", "author": {"steamid": "76561198017426044", "num_games_owned": 499, "num_reviews": 25, "playtime_forever": 30073, "playtime_last_two_weeks": 0, "last_played": 1540584245}, "language": "english", "review": "You thought Battlefield was war. You were wrong. \n\nThis is war. \n\nBattles with hundreds of people fighting on each side in Combined arms battles with air and land vehicles across maps that are more than 100 square kilometres. Grab your 980ti and hold on tight, because you're in for a treat.", "timestamp_created": 1486856147, "timestamp_updated": 1486856147, "voted_up": true, "votes_up": 55, "votes_funny": 10, "weighted_vote_score": "0.762874245643615723", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29952487": {"recommendationid": "29952487", "author": {"steamid": "76561197967929636", "num_games_owned": 1458, "num_reviews": 105, "playtime_forever": 2468, "playtime_last_two_weeks": 0, "last_played": 1484442239}, "language": "english", "review": "I think anyone who likes multiplayer FPS games should at the very least try out Planetside 2. This is a very special experience, I can’t think of another FPS that is as ambitious, varied, and outrageous in its dedication to all out chaotic war as this game. Thousands, and I mean thousands of real people at sitting at their computers all across the world battle in this never ending sci fi conflict from a first person perspective, all in glorious real time, and for the most part, it works. It’s astonishing to stare across a field at a giant group of advancing enemy infantry, easily larger than even the largest Battlefield server, snap to iron sights, and fire into the group and score a kill, only to get run over from behind by one of a hundred tanks cresting over the hill, firing in all directions like maniacs. The game is an MMO, but just the very fact that it still manages to feel like a standard FPS with decent controls and shooting mechanics is a grand achievement. Planetside 2 feels, at times, like the perfect game I wanted as a little kid while going “pew pew” with dozens of little plastic army men.\n\nLike other MMOs, you can join an outfit (guild) and fight for one of three distinct factions. The scary red space communists (guns are weak but shoot fast), the freedom loving space Americans (guns are strong but shoot slow), and the spiritual xenophile space hippies (laser guns). These factions are engaged in an eternal conflict over several continents, and the game centers around various control points. Choose a class ranging from the vital medic to the jetpacking Light Assault and help out your team crush the enemy forces. The size of each continent is mind boggling, and while large stretches are usually unused for long periods of time, it is easy to find conflict zones and jump straight in by the game’s intuitive map system. See all of those flashing booms? Shit’s going down there, get in the meat grinder, soldier!\n\nThe land and air vehicles are easy to operate, and the infantry controls are familiar if you’ve played any recent FPS. There is a ton of variety in how the gameplay unfolds. One minute you are firing at distant targets in a barren desert from a tank’s turret, the next you could be dropped from a hovering Galaxy troop carrier into the thick of an intense CQB firefight. However, there are definitely long boring stretches of inactivity like in other MMOs, boring car rides or endless sprints to the objective that can become pretty grating over time. Thankfully, you can always kill yourself to respawn somewhere closer, or spawn on a mobile spawn truck known as the Sunderer, so if you’re an impatient type action is never too far away.\n\nThe game unfortunately isn’t perfect. Performance is all over the place, despite having a good system expect things to slow down in some of the more hectic combat moments, which is expected since the game is trying to render hundreds of people shooting each other. The F2P system isn’t too bad, the starting guns are definitely viable in combat, but in order to get another weapon or even to unlock a new attachment can feel very grindy at times. Players who spend a ton of money will definitely have an advantage over you in a 1v1 situation since they have access to more gadgets, scopes, etc. than you do, but since the battles are so chaotic and packed with people, this is rarely an issue. \n\nPlanetside 2 is an ambitious game that truly makes you feel like you are a small cog in a giant sci fi battle. I feel as if many multiplayer FPS games are becoming more and more obsessed with making every player feel like a cool guy special forces operator, but Planetside 2 basically says, “You don’t matter, you’re one of hundreds of dumb grunts running around and you are most likely going to die real quick.” I really enjoy this and I wished more developers would work towards making a similar MMOFPS like this of our dreams. Imagine an MMOFPS set in Europe during WW2 (Not that Heroes and Generals shits), now that would be something I really like. Imagine Allied forces landing in player controlled LCVPs, while Axis Luftwafe strafe the beaches, and Panzer divisions massing for a counter attack. Now THAT's my dream video game. \n\nPlanetside 2 is definitely worth trying out, it’s free, so why not?", "timestamp_created": 1487205447, "timestamp_updated": 1491335494, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.684992969036102295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "44645358": {"recommendationid": "44645358", "author": {"steamid": "76561198041084927", "num_games_owned": 47, "num_reviews": 3, "playtime_forever": 175671, "playtime_last_two_weeks": 0, "last_played": 1550308732}, "language": "english", "review": "It's ok", "timestamp_created": 1536470130, "timestamp_updated": 1536470130, "voted_up": true, "votes_up": 59, "votes_funny": 171, "weighted_vote_score": "0.769625961780548096", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43700335": {"recommendationid": "43700335", "author": {"steamid": "76561198123307495", "num_games_owned": 66, "num_reviews": 5, "playtime_forever": 2220, "playtime_last_two_weeks": 0, "last_played": 1540072149}, "language": "english", "review": "Planetside 2 is a hard game. Not like Dark Souls, where when you learn the system you can easily overcome invader after invader, boss after boss, but hard because there's almost no skill ceiling. There's also no matchmaking system, which while it sounds counterintuitive, is what makes Planetside fun. What's your incentive to keep playing, you might ask?\n\nYou die. A lot.\nThere's so much to learn that you will invariably make mistake after mistake, and that's the beauty of it. After 10 or 20 deaths you'll likely be learning why you died, and do better for the next 10 or 20, and you'll probably learn something again.\n\nAnd then you'll still die.\nBecause there's always more room to grow in Planetside 2.", "timestamp_created": 1532360084, "timestamp_updated": 1532360084, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.721528887748718262", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "11559933": {"recommendationid": "11559933", "author": {"steamid": "76561197997266299", "num_games_owned": 1627, "num_reviews": 134, "playtime_forever": 490, "playtime_last_two_weeks": 0, "last_played": 1407871187}, "language": "english", "review": "Battlefield with lazers.\n\nAnd not made by EA.", "timestamp_created": 1407240427, "timestamp_updated": 1407240427, "voted_up": true, "votes_up": 1130, "votes_funny": 474, "weighted_vote_score": "0.814862728118896484", "comment_count": 31, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25985534": {"recommendationid": "25985534", "author": {"steamid": "76561198333435964", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 71000, "playtime_last_two_weeks": 0, "last_played": 1547286408}, "language": "english", "review": "既然封中国IP你TM到是下架啊。妈的", "timestamp_created": 1476206996, "timestamp_updated": 1476206996, "voted_up": false, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.758491873741149902", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23595785": {"recommendationid": "23595785", "author": {"steamid": "76561198018745755", "num_games_owned": 333, "num_reviews": 39, "playtime_forever": 74771, "playtime_last_two_weeks": 0, "last_played": 1544498477}, "language": "english", "review": "This game destroyed my drive to play any other FPS\n\nYou know why?\n\nSimply put, there is nothing else out there like PlanetSide 2. \n\nNothing.\n\n11/10\n\n(Warning to new players: This game is the dark souls of FPS games, you will die a lot, and then you'll die some more)", "timestamp_created": 1466082242, "timestamp_updated": 1542289899, "voted_up": true, "votes_up": 139, "votes_funny": 32, "weighted_vote_score": "0.812205195426940918", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19817017": {"recommendationid": "19817017", "author": {"steamid": "76561198140346512", "num_games_owned": 67, "num_reviews": 19, "playtime_forever": 4513, "playtime_last_two_weeks": 0, "last_played": 1533840857}, "language": "english", "review": "From my understanding, It's kinda like the new starwars battefront game.\nBut it's way better and it's free.", "timestamp_created": 1450668169, "timestamp_updated": 1450668169, "voted_up": true, "votes_up": 472, "votes_funny": 240, "weighted_vote_score": "0.812740743160247803", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26136520": {"recommendationid": "26136520", "author": {"steamid": "76561198070594213", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 31570, "playtime_last_two_weeks": 0, "last_played": 1548708570}, "language": "english", "review": "There's no reason why you shouldn't give this game a try out, it's a free to play game which offers great content not only that but the game is backed by a great community.", "timestamp_created": 1477002508, "timestamp_updated": 1477002508, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.641287028789520264", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "8680760": {"recommendationid": "8680760", "author": {"steamid": "76561198066522157", "num_games_owned": 110, "num_reviews": 1, "playtime_forever": 71640, "playtime_last_two_weeks": 0, "last_played": 1530304778}, "language": "english", "review": "Sick of the 6 vs. 6 constant running around a tiny \"map\" in COD? Want something more? Planetside is where it's at.\n\nThe game spans across 3 continents on a distant world, and on those continents lies a three way war between factions. The game features multiple vehicles from land to air, and they are extremely fun to operate. Teamwork is close to essential in order to win battles, and it allows you to form squads of 12 players, and a platoon of 48. Battles can be up to 100's of people clashing inside a base with tank rounds flying overhead and enemy fire giving you a new haircut. Things get pretty crazy, which also means you're going to need a pretty good machine to run it. Although there were some impressive optimization updates recently, it still needs a good computer. The game also features in game voice channels to communicate with your teammates. Planetside also uses Certs (Certification points), which are basically the way to unlock things and level up. It takes a while to get certs and things can be expensive and quite frustrating, but IMO it helps from people maxing out really fast and running around with everything maxed out. There is also Station Cash, spend real money and get it (But what can you expect from a F2P game like this?). Aside from money, the game has 6 classes all having something important on the battlefield, from medics that can heal and revive, to heavies who can kill tanks. The game is loads of fun and you will be spending hour upon hour capturing territory and defending bases (Which I forgot to mention is the objective of the game). The three continents are Esamir (Snowy), Amerish (Greenery/Mountains), and Indar (Desert). The factions include the Terran Republic (High fire rates, lots o' ammo), the New Conglomerate (Slow, Hard hitting), and the Vanu Sovereignty (Alien tech, low recoil). I recommend this game more than any other I've played. So, pick your side, and join the fight!", "timestamp_created": 1389543669, "timestamp_updated": 1389543669, "voted_up": true, "votes_up": 177, "votes_funny": 0, "weighted_vote_score": "0.859296619892120361", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29316691": {"recommendationid": "29316691", "author": {"steamid": "76561197978921589", "num_games_owned": 632, "num_reviews": 24, "playtime_forever": 81747, "playtime_last_two_weeks": 0, "last_played": 1512002880}, "language": "english", "review": "In theory, this game is awesome. In practicality, it's a bit of a mixed bag. First and foremost, it's best played with friends or other people, ideally in groups of 12-24. There is a little something for everyone. Infantry/objective holds, vehicle battles, base building, and bombing/dogfighting (mostly everyone hates skyknights). At it's core the game is really fun. The fights can get quite intense. However, most of the time you will jumping around bases trying to find decent fights. Most infantry fights will be greatly imbalanced, with certain clans pushing 200+ people down undefended lanes. Vehicle fights are a blast,  though far and few in between. Overall weapon balance is okay, but not great. Cash shop items give the impression that Sony/Daybreak Games doesn't understand the term \"microtransaction\", as there is nothing micro about it. All customization is limited to real money only, but it's very good, and getting better. With recent updates and developments, I think this game has seen better times, but I wouldn't write it off just yet. It's worth a try, provided expectations aren't set too high.", "timestamp_created": 1484660940, "timestamp_updated": 1484660940, "voted_up": true, "votes_up": 26, "votes_funny": 3, "weighted_vote_score": "0.712030708789825439", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43694174": {"recommendationid": "43694174", "author": {"steamid": "76561198143071913", "num_games_owned": 105, "num_reviews": 7, "playtime_forever": 62573, "playtime_last_two_weeks": 1, "last_played": 1551384538}, "language": "english", "review": "For a nearly 6 year old game (at the time of writing this) it has it's flaws, most noteably performance issues, however it brings to the table an experience that to this day is unmatched. One of Planetside 2's core features is the large, never-ending battles that cover each of the 4 continents. These battles have no player cap (so there can be as many players fighting in one area as there are on that server theoretically) and no matchmaking lobbies, meaning that it is a persistant world and you are always fighting a mixed bag of skill. There are 3 factions; Vanu Soverignty, Terran Republic, and New Conglomerate each with their own traits and values that influence their weapons and vehicles. Final note: Do not use steamcharts to judge population, PS2 has it's own launcher that a surprising amount of people use. This game typically peaks at about 4-5k people daily across all servers. However only about 2-3k of that are on steam.", "timestamp_created": 1532332062, "timestamp_updated": 1536529874, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.666866481304168701", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12929099": {"recommendationid": "12929099", "author": {"steamid": "76561198000701639", "num_games_owned": 176, "num_reviews": 7, "playtime_forever": 7279, "playtime_last_two_weeks": 0, "last_played": 1504796849}, "language": "english", "review": "   I'm running around the point with the platoon as a combat medic, and see my teammates going down left and right. I put down the shield regeneration bubble to recover my teammate's shields up and I start reviving my teammates. Also our engineers are supplying our teammates in the front. We all know that we're in a pich and that we need immediately some help. I see several friendly inflantrators sniping down enemies from behind, which is pretty much helping us a lot, but not nearly enough. Then I hear something beautiful behind us and from the Platoon chat. Our max crash is coming, and it's going to push the enemies back by a bit. We might be able to turn this war upside down for now.\n\n    This game... It's a fantastic game, especially if you are in a platoon with people who know their stuff and know how to give and listen to orders. It's basically a neverending war in a huge zone, where you capture areas and with some main areas, you will gain bonuses for your faction.\n   \n    Once a faction is getting together and making up plans, strategies and orders, this game is an incredible game. It's not just a basic futuristic battlefield, but it's something where you really need and want people to stick together and fight together.\n\n    I know several friends though, who love to play this game alone than in a platoon. I don't myself see the interest in that, but I guess it will give you more freedom. I just myself love to move in a huge mass with other people, always managing to make people push back and supporting my teammates with either ammo or heal.\n\n    When the game was still pretty new (in the first year of it's publishment), it was poorly optimized and gaining certs (which is the free in-game currency) was nearly impossible and a long process. Now though, the game works much better and certs are easier to get, turning the game not to be so pay-to-win anymore. Sure, you need 1000 certs for a gun, but the first guns you're using is pretty much as good as the guns you can only buy with SC.\n\n    This game seriously is a must-to-try. It's an interesting game and really has some decent graphics and an amazing gameplay. When I stopped playing this game because of my low FPS, I felt like always coming back, but never being able to. But now, after getting a new computer, I'm running on semi-stable 60fps, even in huge fights. There still are some minor bugs and minus sides, but those don't really affect the gameplay that much. Only sometimes, but not usually.\n\n9/10, you should try this out, even if you're not into huge battlefield games.", "timestamp_created": 1415913451, "timestamp_updated": 1415913451, "voted_up": true, "votes_up": 118, "votes_funny": 16, "weighted_vote_score": "0.842151284217834473", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 56, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 23982, "total_negative": 4850, "total_reviews": 28832}}
