{"reviews": {"12419824": {"recommendationid": "12419824", "author": {"steamid": "76561198073018990", "num_games_owned": 74, "num_reviews": 3, "playtime_forever": 2501, "playtime_last_two_weeks": 0, "last_played": 1412788008}, "language": "english", "review": "Having 42 hours on record and 100% achievements on this game, I think I can provide a useful review. This is a great game and excels at what it was made for. That said, it is not for everybody. Thus, I shall be listing what to and what not to expect from it.\n\nWhat to expect:\n- Survival horror: there is no fighting (on your part), running and hiding is the aim of the game.\n- Jump scares: yes, it's a survival HORROR for a reason. Keep a spare pair of underwear available when you are playing this game.\n- Explicit and dark: violence, gore, vulgar language, some nudity and sexually related incidents all play a part in creating the dark, horrifying atmosphere of Outlast.\n- Interesting storyline and background information: The storyline has a bit of a twist in the tale, things aren't exactly as you expected them to be. Also, with all the notes and documents one collects in this game, one gets a decent amount of background information which helps with the atmosphere of the game, develops the plot (and player understanding thereof) and gives the player insight as to the nature of the silent protagonist, as well as some of the antagonists you'll be facing.\n\nWhat not to expect:\n- Hours of replay value: your first playthrough will probably be about 5-6 hours and the DLC about 1-2 hours. As the game progression is always the same, there is little reason to play it again (with the exception of wanting to get achievements).\n- Competitiveness: There is no form of multiplayer or leaderboards of any kind.\n- Something suitable for children (you should have picked that up by now)\n- Sunshine and roses\n- Clean underwear\n- Being able to sleep at night (slightly exaggerated)\n\nI absolutely loved this game and highly recommend it to anyone that is a fan of the horror genre, whether it be movies or games. I hope the information listed will help you in your decision of whether or not to purchase this game.\n\nHappy Gaming!", "timestamp_created": 1412836486, "timestamp_updated": 1412836829, "voted_up": true, "votes_up": 970, "votes_funny": 91, "weighted_vote_score": "0.961912035942077637", "comment_count": 17, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23698541": {"recommendationid": "23698541", "author": {"steamid": "76561198112350355", "num_games_owned": 155, "num_reviews": 39, "playtime_forever": 417, "playtime_last_two_weeks": 0, "last_played": 1502309988}, "language": "english", "review": " Back a few years ago, my dad bought me this game for my birthday. Now, to begin, im not a horror gamer. That was the problem when i first started playing this game. I wanted to tough it out, show my brother that im not a little bitch, so for a few weeks, i tried. I tried and tried. Then, i put it down for a few months out of frustration and anger towards the fact that i get scared WAY too easily. However, my dad died a few months ago, and after a while, i picked up this game again. I have vowed to beat this game [even though im very late to the party] and tough out the [incredibly horrifying] level and character desgin. \n\n If you think you're strong enough, get this game. It's a good play on rainy nights.", "timestamp_created": 1466567888, "timestamp_updated": 1466567888, "voted_up": true, "votes_up": 350, "votes_funny": 17, "weighted_vote_score": "0.945243120193481445", "comment_count": 18, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8443405": {"recommendationid": "8443405", "author": {"steamid": "76561197984287275", "num_games_owned": 518, "num_reviews": 21, "playtime_forever": 226, "playtime_last_two_weeks": 0, "last_played": 1470306098}, "language": "english", "review": "This game will creep you out. I will probably never finish it because my gameplay consist of maybe 30 seconds of doing something and then hiding for about 30 minutes until I finally quit because I'm too big a wuss to move.", "timestamp_created": 1388450721, "timestamp_updated": 1388450721, "voted_up": true, "votes_up": 495, "votes_funny": 9, "weighted_vote_score": "0.918814778327941895", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12718351": {"recommendationid": "12718351", "author": {"steamid": "76561198022997080", "num_games_owned": 1750, "num_reviews": 361, "playtime_forever": 418, "playtime_last_two_weeks": 0, "last_played": 1477266950}, "language": "english", "review": "Let's get one thing straight: I am not a fan of horror. I'm a giant wuss, a man baby that screams at every jump scare and closes his eyes when things get too gruesome. It's a genre that is quite frankly too much for me and one I tend to avoid for the betterment of my own sanity.\n\nAll the same horror fascinates me. I'm intrigued by why anyone would voluntarily choose to experience something designed to terrify them, compelled by the different ways horror can be effective, and find myself continuously drawn to horror games especially it's the most difficult to do well and as a result the most interesting and impressive when it's done right.\n\nOutlast might not be the absolute pinnacle of interactive horror, but it's certainly close and an impressive bar for other developers to shoot for. It knows how to not only startle you, but to petrify you in fear from the force of the terrors within it. It's vile and grotesque beyond question, perhaps the most disturbing game I've ever witnessed that is still making me cringe as I recall some of its most horrific moments. It does all this however in a way that's oddly, even scarily compelling, almost as if some dark part of you wants to see how far the developers are willing to take it or if there is ever any light at the end of a perpetually dark tunnel.\n\nOutlast achieves much of this through an incredibly dense and oppressive atmosphere, and a deep understanding of its own mechanics. Your helpless in Outlast, forced to sneak and hide from enemies that can often see and hear you much better than you can them, but the game never becomes frustrating or tedious do to an almost constant supply of hiding places, or the ability to outrun your pursuers should you be spotted. This doesn't mean it's an easy game, or one you can casually run through without worrying over enemies, but it places you into situations you can't handle and never feels punishing the way too many horror games have a tendency to when they rely so heavily on trial and error.\n\nThis is thanks in part also to how well Outlast cements you into its world. There's never a moment where you feel like anything more than a helpless journalist with a camera, and this vulnerability and immersion is one of the most important factors in why this is such a terrifying game. Every stumble, heavy breathe, cut and bruise, and nervous peek of your character is presented in a way that makes you really feel as if you're inhabiting your character. He might be a blank slate in every other respect, but when you step into his shoes the real world seems to melt away as you traverse an almost literal hell on earth.\n\nEverything in Outlast becomes secondary to scaring the living daylights out of you almost the second you grab your camera and step out of your car unprepared for what awaits you inside Mount Massive Asylum, and it's because it's so effective at this goal that it's easier to forgive some of its less polished aspects. A general lack of direction and inability to recall your objectives means it's easy to get lost running in circles, even more so with the nearly impenetrable darkness around you that often hides doors and pathways, and without any map to speak of even just retracing your own steps to try and rule out where you haven't been becomes a challenge that at times removed me from the experience as I was forced to resort to a guide just to progress.\n\nThe narrative as well, for as interesting is it is when you can see it cohesively laid out on paper, is told in such a way as to be all to often jumbled and convoluted past the point of anything intelligible if you aren't paying incredibly close attention to every line of dialogue and document picked up. Even then, it switches gears often enough as to seem almost intentionally written in such a way as to keep you constantly in the dark, guessing at the few threads that are thrown at you what it all might mean. There's a reluctance to commit traced throughout the entirety of Outlast, as if it's concerned about spending too much time on one character of story moment lest you begin to assume it's the main focus of the game. The end result is something that's consistently intriguing but rarely satisfying.\n\nThe most disappointing part of the experience though is the final chapter, which jumps the shark not only in terms of narrative, but also its setting which loses almost all of the terror of the areas that preceded it and closes the game out on a rather odd note. I didn't dislike it because of the ending, so much as I did what it did to the game as a whole, which up until that point had been nothing but consistently excellent.\n\nBut it should be taken as rather large praise that despite Outlast's very present issues, they rarely become more than a minor disappointment or anything you have time to think about with how intense and stressful just surviving in this asylum is. Developer Red Barrel doesn't know how to craft a narrative or direct the player particularly well, but they understand acutely how to do first person survival horror to a degree that deserves commendation. If you have any interest in horror of the most unsettling and macabre nature, Outlast deserves your time. As someone that appreciates horror for what it is more than what it does to me, Outlast succeeded in ways that truly surprised me, and now has me hesitantly interested in discovering more of the genre I've tried so hard to stay away from.\n\n[b]You can read more of my writing on [url=http://kritiqal.com/2014/10/31/outlast-review/]Kritiqal[/url].[/b]", "timestamp_created": 1414812746, "timestamp_updated": 1425146817, "voted_up": true, "votes_up": 357, "votes_funny": 31, "weighted_vote_score": "0.921808600425720215", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "7815221": {"recommendationid": "7815221", "author": {"steamid": "76561198048871968", "num_games_owned": 1046, "num_reviews": 103, "playtime_forever": 923, "playtime_last_two_weeks": 0, "last_played": 1408657758}, "language": "english", "review": "This was probably the most fun I've had playing a horror game in a good while, which surprised me because I really wasn't expecting much out of this one. Jump scares are definitely not the only things that will give you the chills, this game has strong atmosphere, and lurking around to avoid being seen by enemies can be some of the creepiest parts of the game, and can be terrifying when you're being chased. \n\nThe game also has enough meat to it to put all of it's mechanics to good use without ever feeling underplayed or gimmicky. I also feel that the game does a good job of making you care about the main character's well being, he goes through so much crap in this game that it makes it all the more motivating to keep going and see what happens next. I wont say more, overall I highly recommend this to horror fans, it's pretty awesome.", "timestamp_created": 1385681466, "timestamp_updated": 1385681466, "voted_up": true, "votes_up": 1073, "votes_funny": 1, "weighted_vote_score": "0.936601161956787109", "comment_count": 60, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12423887": {"recommendationid": "12423887", "author": {"steamid": "76561198135029027", "num_games_owned": 315, "num_reviews": 24, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1412869746}, "language": "english", "review": "The hours on record represent the time it took me to attempt to play the game. Basically, I paid full price for a game I'm too afraid to play.", "timestamp_created": 1412869178, "timestamp_updated": 1412869178, "voted_up": true, "votes_up": 745, "votes_funny": 376, "weighted_vote_score": "0.917853772640228271", "comment_count": 36, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18479573": {"recommendationid": "18479573", "author": {"steamid": "76561198168636993", "num_games_owned": 67, "num_reviews": 8, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1513820495}, "language": "english", "review": "Never play this at night, a rainy day, a cloudy day or with curtain closed\nNever play this alone, \nif you are planning to do so, check the house and make sure there's no one! \nso when something or someone touches you, you'll know you need to run the duck out of it!\nNever play this when you have a pet that could potentially jump on you(this one almost killled me)\nNever play this when you are stoned (Credit to Someguy583), tried this, but i might have gotten myself too stoned that i fell asleep while playing this game, i guess it's still a no right?\nNever play this when you are drunk (no, i'm just worried you gonna puke on your keyboard)\nNever play this with a headphone on, be aware your surroundings, or if you have to,\nNever play this with a cord one, you gonna whelther break the cord or hurt you neck.\nNever play this before, after and while eating\nNever play this if you have to go to toliet\nNever play this more than 1 hour (in human time not some crazy gamer time!)\nNever play this before bed\nNever play this on a laptop in bed\nNever play this 48 hours prior to sex (Viagra won't help!)\nNever play this while camping in the woods\nNever play this at a friend's house if you have to leave at night\nNever play this when your friend told you he's just gonna stand there and watch. hmm no.\nNever play this if you have kids, \nbut if you are sick of all kids sleepovers, show them this they will never come to your house agian!\nNever play this on a big screen, tried to play this with a projector once, guys you have to try it.\nNever play this if you have any mental illness, or even you think you might not have.\nNever play this under any illness\nNever play this under medical condition\nNever play this under pregnancy or planning to\nNever play this if you have been holding any shit\nNever play this game if you are under 25\nNever play this when your imaginary friend or friends are with you.\nNever play this game!\nNever play this\nNever\nNever\nNever \nEver\n................................................................WARNING!...........................................................\nGamer's who fail to follow these instructions might lead to seriously death or pants shitiing.\nBut aside from that, great game 10/10, thanks for all the comments and likes guys!", "timestamp_created": 1444882525, "timestamp_updated": 1487226792, "voted_up": true, "votes_up": 1107, "votes_funny": 3086, "weighted_vote_score": "0.924385488033294678", "comment_count": 49, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "14241102": {"recommendationid": "14241102", "author": {"steamid": "76561198057739869", "num_games_owned": 419, "num_reviews": 31, "playtime_forever": 446, "playtime_last_two_weeks": 0, "last_played": 1434844341}, "language": "english", "review": "A truly great horror game experience that whilst it made use of jump scares, did not rely on them. An engaging story of horror, with a cast of sick and twisted individuals to torment and terrify you.\n\nSet in an insane asylum run by a nefarious group, you play an intrepid reporter, intent on getting a great stroy. Unfortunately for you, it turns out that you are to become that great story, and your aims quickly change to a simpler one: Get Out!\n\nThere is a mix of supernatural and pseudo science that has an X-Files feeling to it but at its heart this game is a classic horror experience. You don't fight, you run and you hide. Actually the hide mechanics are pretty good and the 'enemy' AI will keep you on your toes (or cowering under a bed). And the game uses an interesting mechanic in the nightvision mode of the camera. It allowed the game to cover you in darkness and yet still be able to see, albeit not very well, and having to use valuable batteries. But more importantly it somehow made the game feel more real. More like a documentary gone wrong. Something akin to the Blair Witch Project.\n\nIf you like horror games, this is a must have.\n\nYou can see my playthrough of this game here : https://www.youtube.com/watch?v=ZFCh-5BXs6M&index=1&list=PLE7DlYarj-Dcgi5vf_vnazG4kzaSqrpjV\n\nAnd my play through of the DLC (Whistleblower) : https://www.youtube.com/watch?v=kI5-KCpqwPs&index=1&list=PLE7DlYarj-DfItvZz_L4yOTgJ6B5UCnQH", "timestamp_created": 1422628272, "timestamp_updated": 1422628272, "voted_up": true, "votes_up": 126, "votes_funny": 7, "weighted_vote_score": "0.911940157413482666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32605636": {"recommendationid": "32605636", "author": {"steamid": "76561198022342244", "num_games_owned": 240, "num_reviews": 10, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1498000770}, "language": "english", "review": "Tried to play. Got scared. Uninstalled.\n\nGood job developers.", "timestamp_created": 1498001976, "timestamp_updated": 1498001976, "voted_up": true, "votes_up": 572, "votes_funny": 554, "weighted_vote_score": "0.905484139919281006", "comment_count": 14, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "42079055": {"recommendationid": "42079055", "author": {"steamid": "76561198199595411", "num_games_owned": 1143, "num_reviews": 26, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1464200061}, "language": "english", "review": "Outlast is a little gem of an indie game, casting the player into the shoes of freelance  photographer Peter Parker,  err freelance writer Miles Upshur, and are investigating an anonymous tip about a potentially ground-breaking exposé that could shed light on a particular asylum. What dear Miles finds is sure to haunt him for the rest of his life, assuming he can make out in one piece.\n\n[h1]Gameplay[/h1]\nThe game is at its core a survival horror game, relying heavily on its intense atmosphere to add the oh so sweet immersion some games are lacking. From the moment you sneak into the asylum, up until the very end, Outlast manages to keep you in a sense of anticipation. The feeling of dread that something will attack you in the dark is quite a horror on its own, but thankfully you are equipped with your trust camcorder(with night vision) to expose the horrors you witness and avoid those horrors. The asylum gets quite dark and becomes difficult to navigate at times without the night vision on your camera, this becomes worse when being chased, but it is not impossible as the game is fairly linear. Despite the linear nature, there was not very much backtracking to make the game longer, besides simply passing by an old area to u lock a new area.  The game had a variety of enemies, the only repetitive one’s used for jumpscares, which are quite nice honestly, most of the times jumpscares are done cheaply, repetitively or just not well times, though there were very few  jumpscares that were badly timed in outlast. From beginning to end, you feel a very eerie feeling that something is constantly watching you and will be chasing after you.\n\n[h1]Visuals[/h1]\nFor an indie this game is quite attractive. The inmates, as in those trying to get you, are quite gruesome and very neat to look at if you aren’t running for your life. You can look at each person and get a sense of the horror and torment they were subject to while in the asylum, all of them being heavily disfigured and in many cases mentally shattered. The little details made quite a difference as the place looks quite ruined and literally trashed everywhere you go, with some exceptions being places where the people have not lost all their sanity at least. As for the tiny details, you can see blood staining the skin and clothes of the more violent characters, and even see staples and stitches on the face of others that are heavily disfigured.\n\n[h1]Sound[/h1]\nExtremely eerie, it was a bit difficult to stay calm with the music and sound effects making every new area feel like you’re going to because down the hall way. The sounds are quite distinct, there is a clear sudden change in sound when an enemy spots you and chases after you. There is not much that can be said, besides that the voice acting is quite excellent, sometimes a little low due to the louder music but good quality, as well as the music changing biased on different areas, which was a nice touch and did not feel like the music was ever feeling stale.\nOutlast is quite the neat little game, having been out for quite some time the game is still a definite example of horror done right, where most games love abusing the cheap jumpscares, this one does them spread out and loves using the feeling of being chased as the main fuel for horror. Overall with an eerie atmosphere, gruesome enemies, dimly illuminated areas, and no way to fight the psychos after you, running and hiding are your only ways to survive this nightmare.\n\nVerdict: 8/10\n\nIf you enjoyed this review or found it helpful, please follow our curator [url=https://store.steampowered.com/curator/9673931-NEKOS/]here.[/url]", "timestamp_created": 1526550077, "timestamp_updated": 1526550077, "voted_up": true, "votes_up": 111, "votes_funny": 4, "weighted_vote_score": "0.840240657329559326", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32341068": {"recommendationid": "32341068", "author": {"steamid": "76561197969749884", "num_games_owned": 1695, "num_reviews": 1150, "playtime_forever": 4734, "playtime_last_two_weeks": 0, "last_played": 1520425361}, "language": "english", "review": "Outlast might as well be one of the most psychologically outrageous horror games of all time. The atmosphere is superbly disturbing, the art design is spot on and the player feels extremely vulnerable and scared at literally all times due to the great AI and enemy design.\n\nAll in all a vastly memorable experience. Definitely recommended.", "timestamp_created": 1497182437, "timestamp_updated": 1497182437, "voted_up": true, "votes_up": 79, "votes_funny": 8, "weighted_vote_score": "0.861746251583099365", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13086218": {"recommendationid": "13086218", "author": {"steamid": "76561198063350180", "num_games_owned": 2116, "num_reviews": 70, "playtime_forever": 850, "playtime_last_two_weeks": 0, "last_played": 1477971942}, "language": "english", "review": "\"What are you going to play next?\"\n\"Umm. Outlast I guess.  It's been in my backlog since summer. Supposed to be scary or something.\"\n\nAnd there I went.  Oblivious to what I was getting into.  Honestly, I had only watched 2 minutes of vids online and a Conan O Brian review. Then came the game; immediately creepy. And it quickly moved on to scary and terrifying. The world seemed a bit Portal 2-ish, but the actual gameplay...was amazing.  Pacing, story, real HORROR, and tension like I had not really felt in a horror game.  Not that I have played a ton of horror titles, but I would put it on par with early Silent Hill games.\n\nI won't go into the details.  Really, it would spoil it for you.  Honestly, very basic.  You are a reporter checking out the weird stuff happening at the aslyum.  And then you walk in into an evil Wonderland complete with menacing large evil killers and a nutso with no pants.\n\nSpeaking of that, tweedle-nude and tweedle-nuder didn't get me once.  I was kinda proud of that. \n\nYou can't fire a gun or use a weapon.  The only defense is running, hiding, ducking, and having your heart up in your throat as Chris Walrider walks by you...aw! He found me!  AwHHHHHH!! RUNNNN!!!\n\nOf all the games I have played this year, this has to be one of the best made in totality.  The length is just right.  Cues and progression move at an exact rhythm that does not allow you to slow your scare down. The jumpscares are there, but are by no means the meat of the game.  There are no useless time wasting missions.  Everything has a reason and the most annoying mission in the game \nis perhaps one of the most terrifying when you do not know what will happen next at all.  Normal difficulty is not impossible and not once did I get stuck on geometry.  A few things are not apparent - that much is true.  Granted, if they were, the game would not be hard enough.  It's just right.  Really.  It's absolutely just right.  Kudos to the dev team.\n\nAt one point I told my buddy I was really wasn't super scared anymore by about the middle of the game.  BUT.  I could not play for more than an hour or so or my heart would not slow down enough for me to sleep well.  Too much tension.  Then he said \"Isn't that what terrifying means?\"\nHe was right.  Even when the horrific graphics no longer phased me, it was the sheer tension of the game that kept me in it's grip.  That is amazing, and impressed me more than many AAA titles I've played in the past.", "timestamp_created": 1416980830, "timestamp_updated": 1441844151, "voted_up": true, "votes_up": 123, "votes_funny": 16, "weighted_vote_score": "0.887107253074645996", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28613033": {"recommendationid": "28613033", "author": {"steamid": "76561198060512310", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 4037, "playtime_last_two_weeks": 0, "last_played": 1543263680}, "language": "english", "review": "Outlast is a unique first person investigation horror game that pits you against your own sanity, every moment riding on tension and anxiety. Armed with nothing but a camera, notepad and olympian cardio skills, you play as Miles Upshur; an investigative journalist with balls of steel and a dedication to shock footage rivalling Louis Bloom of the film \"Nightcrawler\". Limited resource horror-genre games are a popular niche amongst the gaming community, and Outlast was the poster child of the rising market for so long for a good reason.\n\nPROS:\n\n- CHALLENGING: With no combat skills whatsoever, you are tasked to run for your life and hide from most of the threats you encounter. This element makes this game a fresh escape from the mainstream style of gaming we are subject to, which in itself intesifies the excitement and reward that the game offers to those dedicated to it's completion.\n\n- INTERESTING: While the story may appear distant at first glance, it developes just vaguely enough into the final act with bits and pieces of it tucked away in documents and dialogue to satisfy your biting curiousity.\n\n- REWARDING: Completing this game is an accomplishment to which people can proudly boast. If the ending of Outlast ( as great as it is ) does not appease you, expect the DLC Whistleblower to tie a nice bow around the story instead.\n\n- SINGLE PLAYER PARTY GAME?: Yeah. This game is an experience that rivals you and your friends seeing a legitimately scary movie in theaters. You can take turns playing, or easily entertain a group of people watching it in a dark room.\n\nCONS:\n\n- GLITCHES: Sometimes, though very rarely, one can experience glitchy behavior in the AI or physics of the game. For me, this was very uncommon but it does still happen from time to time. Many of these glitches can be found being exploited in videos fellow players post online. If one learns of certain common glitches and uses them, they tend to perturb the authenticity of the gameplay experience. And if you have that very rare chance of hitting a glitch that hurts or kills you on a completion run of Insane mode, well... Prepare to rage.\n\n- SAVING BUGS: Sometimes the saving mechanism bugs out. If for whatever reason you have two playthroughs being simultaneously played, the autosave feature may corrupt the other save files rather easily. Sometimes your saves wont always leave you off where your autosave ticked or even where you manually saved. I even recall once my game continuously crashing due to having too many save points, so I had to delete the majority of what I had saved just to continue playing.\n\n- DIALOGUE: The story is vague, loosely strung together by a combination of forced and side dialogue, and information obtained via camera footage notes or documents found in-game. While the obscurity compliments the experience, if you don't have subtitles activated you are likely to miss out on HEAPS of immersion and story development due to shoddy dialogue timing that sometimes triggers at different moments during alternate play-throughs. Sometimes you'll walk in on dialgoue that was accidentally triggered too early, thus you missing out on the entirety of the message. This will not ruin the game by any means, but it does kind of waste the talent of the work put in by those writers, and may leave most players entirely in the dark during the greater part of their gameplay.\n\n- COLLECTABLE PLACEMENT: If you are an achievement hunter, this game won't have you pulling your hair out by any means, but beware; if unprepared you may miss one, if not a few things on your first play through. The game has \"sweeper\" elements that ( often randomly ) force you into the next situation in order to survive. This means that you may miss something because you forgot to check that one room before triggering a Variant chase that pushed you to the next chapter. Oh, and once you move on to an area, especially a in a new chapter, you will likely never see that area again, so you will not be able to go back and collect what was missed. I advise looking up a checklist of note and document titles per chapter that don't necessarily explain in detail where they are, but instead provide a name for you to go off of when you check your collectables in game to know that you've gotten all of them in your current area before moving on.\n\nPROCONS: \n\n- HORRIFYING: The game will subscribe you to content that no child ( or anyone with a weak heart or mind for that matter ) should witness. While this element is a part of the base of artistic beauty of Outlast, it is also very disturbing; especially to those who aren't already broken and tainted by the internet. I love this game and the horror element adds a layer to it that transcends most of my gameplay experiences. However as a responsible gamer and somewhat functioning adult, I mean it when I say take caution as to who is allowed to play this game. Some people are not built for horror and gore.\n\n- ANXIETY DRIVEN: The constant need to be looking over your shoulder or possibly ready to run is a part of what makes the game exciting. However, if you fail to pick up on the cues the game gives you to prepare for the worst, you may find yourself a nervous wreck who has to put the game down frequently or else you'll induce a panic attack. \n\nFINAL ANALYSIS:\n\nThis game is one of my all time favorite titles and something I find I am able to replay still to this day for enjoyment. I've dumped a lot of hours into it and will probably add more. I can't say it is for eveyone because of the intense gore and topics, or for the fact it may be bad for certain people's health, OR you may not like the limiting gameplay mechanics. But, for anyone strong enough to see it through and intelligent enough to enjoy the overall beauty of the game, it will be a rewarding experience and likely one you'll never forget.", "timestamp_created": 1482620784, "timestamp_updated": 1543263755, "voted_up": true, "votes_up": 54, "votes_funny": 1, "weighted_vote_score": "0.845465481281280518", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8325186": {"recommendationid": "8325186", "author": {"steamid": "76561198028218472", "num_games_owned": 187, "num_reviews": 5, "playtime_forever": 392, "playtime_last_two_weeks": 0, "last_played": 1499992251}, "language": "english", "review": "If you are constipated this game is a solution for you!\n\nYou will poop yourself within minutes of playing!", "timestamp_created": 1388123761, "timestamp_updated": 1388123761, "voted_up": true, "votes_up": 1449, "votes_funny": 13, "weighted_vote_score": "0.893974363803863525", "comment_count": 27, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "41024309": {"recommendationid": "41024309", "author": {"steamid": "76561198122584217", "num_games_owned": 61, "num_reviews": 15, "playtime_forever": 1971, "playtime_last_two_weeks": 0, "last_played": 1518278608}, "language": "english", "review": "Outlast…This game you don’t play for fun :)\n\nHaving 32 hours on record and 100% achievements on this game and the DLC, I think I can provide some useful insight. This is a great game and excels at what it was made for. That said, it is surely not for everybody. \n\nThe game is pretty straightforward. The game differentiates itself from other games by putting the “light” factor as something scarce. Actually there is enough light/battery in the game, sot it is not really difficult to find the way. The music and atmosphere are very good, the graphics oke. Play it in total darkness and headphones for best experience, but honestly that is not how I played it. It helps to play in the darkness and put the gamma a bit up. But headphones is for me too scary, so I played the game on an average volume via speakers. Like that the game is doable in terms of scariness.  \n\nSometimes it is annoying if you are chased by a creep and you have to run through a new area and you don’t know where to go exactly (yet). Makes it scary too of course. After dying 2 or 3 times you know where to go and then it is easy. The game has therefore little replay value. \n\nSome parts are a bit unnecessary sick for a computer game and not really needed for this game. The people who played this game know what I mean. I am not childish, but this game I would say is for 21+. \n\nThe insane difficulty modes are challenging but doable. If you want to work out, play this game. Your heart beat will go up, losing a lot of calories for you. There is no fighting (on your part), running and hiding is the aim of the game. \n\nThe game is truly terrifying and not just because of the “jumpscares” but because of the atmosphere of the game.", "timestamp_created": 1521918254, "timestamp_updated": 1521918254, "voted_up": true, "votes_up": 53, "votes_funny": 6, "weighted_vote_score": "0.828736603260040283", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26301912": {"recommendationid": "26301912", "author": {"steamid": "76561197970314107", "num_games_owned": 1477, "num_reviews": 668, "playtime_forever": 193, "playtime_last_two_weeks": 0, "last_played": 1477723420}, "language": "english", "review": "Everyone has their limits with horror. Some draw the line at jump scares, others with excessive gore. Outlast is the kind of game that goes straight out looking for that line, and holds nothing back in pursuit of it. The way it goes about shocking you might not work for everyone, but for those it does it's one of the best.\n\nYou take on the role of Miles Upshur, the world's most unfortunate journalist, as he sniffs out a scoop at the remote Mount Massive Asylum. Armed with naught but his camcorder and his razor wit, he finds his way inside only to discover that the inmates are running the show. With escape cut off, survival means healthy portions of skulking through the shadows and hauling ass down the blood-soaked halls. The adventure and story take all sorts of turns from this auspicious beginning, but rest assured you're going to be crawling over every inch of this wretched place.\n\nIf anything, I'm underselling just how awful the asylum is. Red Barrels went above and beyond the call to make Mount Massive a literal house of horrors, everything from flickering lights to fountains of viscera, from ransacked offices to moldering cells. Every room is grim, dingy, and feels like the least safe place on Earth. And indeed, you'll never know quite when you're safe, at least at first. Some of the misbegotten patients are quite benign, but others are out for your blood. More than that, just about anything could be waiting around the next corner to mutilate you. Much of the asylum is pitch black, leaving you to grub around in the dark using the night vision on your camera until something gets in your face.\n\nThis is the still-beating heart of Outlast's horror, the jump scares. Don't get outraged just yet, these aren't the screaming Poser models of the indie horror gutters. Like many modern FPSes, Outast models your character's body and takes great pleasure in manhandling it at regular intervals. You'll be thrown through windows, dragged through doors, tied to things, and so much more. The game is rife with these scripted scenes, often coming at the least opportune times to make you jump and curse.\n\nThe rest of the horror lies in the atmosphere and the enemies. Like I said, the asylum is a palpably terrible place to be thanks to superb audio and visual details. You're going to feel gross and uncomfortable the whole way through, which adds immeasurably to the shocks and threats when they arise. As for the enemies, well, they provide the necessary threat of death, but are probably the weakest part of the formula. It won't take long for your foes to become predictable, not only in their patterns but in their appearances. Once you get used to racing past them or losing pursuit, they'll be more like padding than actual threats.\n\nThis is really the crux of what Outlast is, and what will determine if you love it or hate it. It's very much a haunted house ride, moreso even than other guided horror games like SOMA or Condemned. Your path through the asylum always follows the same track, has the same spooks and shocks in the same places, and threatens you in the same ways. There are notes, of course, files to pick up and memos recorded by having your camera up at key points. But these are all on the main path, or a single room or hallway off from it. While I wouldn't say the experience becomes boring or repetitive, I definitely felt more comfortable with it in the last hour than I did the first.\n\nDon't take that as a dismissal of what Red Barrels has accomplished here, though. Outlast is one of the most aggressively unsettling and brutal horror games out there, and as long as you let yourself be drawn in it's a hell of a ride. Terrible things are going to happen, accompanied by sharp graphics and a phenomenal orchestral soundtrack. The story goes crazier than I expected but ended in a good place that should entertain just about everyone. It's not the smartest or the scariest horror game out there, but it works hard to shock and does a damn fine job of it.\n\n\n\nDid you enjoy this review? I certainly hope so, and I certainly hope you'll check out more of them at https://goldplatedgames.com/ or on my [url=http://steamcommunity.com/groups/audish#curation]curation page[/url]!", "timestamp_created": 1477778617, "timestamp_updated": 1501740053, "voted_up": true, "votes_up": 102, "votes_funny": 3, "weighted_vote_score": "0.878006041049957275", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14507519": {"recommendationid": "14507519", "author": {"steamid": "76561198058023641", "num_games_owned": 140, "num_reviews": 3, "playtime_forever": 7037, "playtime_last_two_weeks": 0, "last_played": 1528745323}, "language": "english", "review": "Turn off the lights, wear your headset and turn up the volume for the best experience. If you like horror games, you won't regret it.\nI hope to see games like Outlast, in the future. This is a valuable production.", "timestamp_created": 1424132881, "timestamp_updated": 1424132881, "voted_up": true, "votes_up": 76, "votes_funny": 25, "weighted_vote_score": "0.828498482704162598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "15208911": {"recommendationid": "15208911", "author": {"steamid": "76561198067566483", "num_games_owned": 269, "num_reviews": 12, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1493060472}, "language": "english", "review": "[h1]This isn't a game.\nIt's a [b]nightmare.[b]", "timestamp_created": 1428181804, "timestamp_updated": 1428181840, "voted_up": true, "votes_up": 649, "votes_funny": 521, "weighted_vote_score": "0.91605079174041748", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12601315": {"recommendationid": "12601315", "author": {"steamid": "76561198003476696", "num_games_owned": 237, "num_reviews": 34, "playtime_forever": 823, "playtime_last_two_weeks": 0, "last_played": 1414031699}, "language": "english", "review": "Outlast is a true horror game.  This game scared me more often than many horror films to date.  If you want to experience the fear and adrenaline of running through dark hallways with an injured leg while being chased by men that can only be described as nightmares incarnate, then you must play this game.   There are plenty of horrific characters you meet along the way and a false sense of hope around every corner and at each door.  Please, do yourself a favor and play this EXPERIENCE.  No other game will make you sweat or stimulate your hearbeat like this one. As a sidenote i just finished the dlc Whistleblower and it was well executed too. This game deserves a 10/10.", "timestamp_created": 1414096220, "timestamp_updated": 1479951056, "voted_up": true, "votes_up": 104, "votes_funny": 6, "weighted_vote_score": "0.840124905109405518", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48951867": {"recommendationid": "48951867", "author": {"steamid": "76561198237444042", "num_games_owned": 398, "num_reviews": 10, "playtime_forever": 893, "playtime_last_two_weeks": 0, "last_played": 1549987793}, "language": "english", "review": "it was just Wow.\nnever played something like this its full runing like a pu$$y u dont see too much action its a perfect scary game.\njust buy it and dont forget dlc.dlc was amazing.", "timestamp_created": 1549989456, "timestamp_updated": 1549989532, "voted_up": true, "votes_up": 33, "votes_funny": 3, "weighted_vote_score": "0.77511894702911377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10782594": {"recommendationid": "10782594", "author": {"steamid": "76561198064664906", "num_games_owned": 105, "num_reviews": 11, "playtime_forever": 298, "playtime_last_two_weeks": 0, "last_played": 1414801017}, "language": "english", "review": "PROS: \n- Scary\n\nCONS:\n- Scary", "timestamp_created": 1403671672, "timestamp_updated": 1403671672, "voted_up": true, "votes_up": 169, "votes_funny": 14, "weighted_vote_score": "0.866309463977813721", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "14592150": {"recommendationid": "14592150", "author": {"steamid": "76561198043250032", "num_games_owned": 1438, "num_reviews": 193, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1424600838}, "language": "english", "review": "Outlast is a survival horror game that takes place in the Mount Massive Asylum. You are Miles Upshur, a journalist who has come to Mount Massive having received an email from someone within the facility (the main character in Whistleblower) which raised concerns about the safety of the facility and Murkoff, the company who run it. You will not encounter any scary monsters in this game, those who you run from are men, twisted by Murkoff. \n\nA word of warning, this game is extremely graphic and contains some very disturbing scenes, this game is absolutely not appropriate for a younger audience.\n\n+Gorgeous graphics which help add to the immersion of the game\n+Interesting setting\n+Truly terrifying and not just because of the jumpscares but because of the atmosphere of the game\n+The game's sound design is fantastic and helps contribute to the above point\n+You cannot fight what you come across in the asylum, you can only run and hide\n+Unpredictable enemies makes the game even more scary\n+Intense chase scenes\n+Outstanding voice acting adds to the immersion of the game\n+Some very interesting characters\n+The 'people' you come across in the asylum who were once patients feel very real, mainly due to their unpredictability and the voice acting, and it really helps add to the immersiveness and atmosphere of the game\n\n+/-Some very graphic and disturbing scenes, some may find these too much but I feel they help to add to the realism of the game\n+/-You don't have time to catch your breath as there are no parts of this game where a scare isn't lurking around the corner\n\n-Very little replay value\n-You're gonna need more underwear\n\nVerdict:\n9\n\nAn outstanding horror experience made great by its atmosphere and characters more than anything. A must have for survival horror fans.\n\nEl K.", "timestamp_created": 1424602595, "timestamp_updated": 1433339384, "voted_up": true, "votes_up": 437, "votes_funny": 55, "weighted_vote_score": "0.879763662815093994", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24420034": {"recommendationid": "24420034", "author": {"steamid": "76561198006176581", "num_games_owned": 443, "num_reviews": 119, "playtime_forever": 1820, "playtime_last_two_weeks": 0, "last_played": 1472881123}, "language": "english", "review": "As I give a thumbs up for my review, I think to myself, \"What kind of person are you?\" \n\nYou know when you are playing a horror game or watching a horror movie and everything tells you that the situation is not good and it is not going to get any better and that you will save yourself some scarring if you turn it off? Yet, you keep playing or watching, submitting yourself to any horror that will be thrown at you, BECAUSE YOU JUST HAVE TO KNOW HOW IT ENDS.\n\nThat is my relationship with Outlast. I don't know if I would even call this game scary, but I do know that I would call it horrific and tension-filled. I feel like this game already has enough reviews to cover the pros and cons, so here are just some thoughts on how this game affected me.\n\nIt was a brilliant, tense, horrific experience and the thought to turn the game off never entered my mind. The idea of investigating a mental hospital for its questionable ethics is fairly typical adventure/survival horror material. However, I felt that Outlast was very fresh and original in its delivery. I've never played anything quite like it, and honestly I hope I don't play many more like this. \n\nI loved the familiar territory of the adventure aspects of this game. Exploring and discovering the secrets of the hospital via notes and documents is always a treat. Luckily, not the entire game is running from people who want to kill you. Actually, it was refreshing to find the mental patient who wanted to help, in his own way, of course. The atmosphere reminded me of wonderful games like Amnesia, where you are in almost constant peril and there is no way to fight back. \n\nNow, maybe I am a little sheltered but after playing Amnesia, Dead Space, and the Silent Hill series, I thought I could face what Outlast had to offer. For a while I could. Raving lunatics wandering halls, bodies everywhere, psychos chasing you - standard fare. But then the DLC Whistleblower unleashed a level of horror that I hope I never see again. His name is The Groom. A fair warning for those who love horror games, what The Groom does may test your gore threshold. \n\nMechanic wise, I found that the game ran very smoothly and looked great. The constant need to have your camera out added an edge that I haven't felt since Fatal Frame. \n\nSo do I recommend this game? Yes. Did I find it fun? That is debatable. I couldn't stop playing. Not because it was necessarily fun, but because I had to believe that putting the poor protagonists through all this was worth it. In the end, I think it was, and I am glad that I played it.", "timestamp_created": 1468992556, "timestamp_updated": 1468992662, "voted_up": true, "votes_up": 38, "votes_funny": 0, "weighted_vote_score": "0.804134666919708252", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "14724210": {"recommendationid": "14724210", "author": {"steamid": "76561198127357437", "num_games_owned": 63, "num_reviews": 5, "playtime_forever": 873, "playtime_last_two_weeks": 0, "last_played": 1506337649}, "language": "english", "review": "-Bought\n\n-Played\n\n-Panicked a lot.\n\n-Hide in locker for 30 mins\n\n-Come out of locker.\n\n-Heard something.\n\n-Back in locker \n\n10/10", "timestamp_created": 1425304967, "timestamp_updated": 1425370945, "voted_up": true, "votes_up": 593, "votes_funny": 1750, "weighted_vote_score": "0.871715843677520752", "comment_count": 17, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27752159": {"recommendationid": "27752159", "author": {"steamid": "76561198047343566", "num_games_owned": 137, "num_reviews": 13, "playtime_forever": 578, "playtime_last_two_weeks": 0, "last_played": 1470598548}, "language": "english", "review": "Dude, seriously. Do NOT play this game alone, in the dark, with headphones. I am not joking.", "timestamp_created": 1480205723, "timestamp_updated": 1480205723, "voted_up": true, "votes_up": 147, "votes_funny": 70, "weighted_vote_score": "0.850514590740203857", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35432993": {"recommendationid": "35432993", "author": {"steamid": "76561198105210574", "num_games_owned": 246, "num_reviews": 17, "playtime_forever": 1269, "playtime_last_two_weeks": 0, "last_played": 1507688477}, "language": "english", "review": "[b]A slice of life game full of relatable characters.[/b]\n\nBut, seriously, since [strike]I looked like a dumbass with 5 hours of gameplay and 0 achievements[/strike] Halloween is coming up, I decided to give Outlast a second playthrough to see if it was as good as I remembered it. And for the most part it is, although I did notice a few flaws. Here's what I got out of this playthrough:\n[h1]Pros[/h1]\n+Outlast has some great atmosphere, which is held up by the fantastic sound design, unique characters, and disorienting location. Somewhat similar to Silent Hill, you'll be in a large area full doors, but nearly all of them are locked, which creates a combination of agoraphobia and claustrophobia.\n+The graphics are also decent. Of course, when you can barely see anything because it's so dark, it's hard to mess up graphics. But not much will beat turning on the infrared camera and seeing eyes glowing in the dark for the first time.\n+The controls are pretty smooth; running from enemies, jumping over obstacles, and looking over your shoulder all feel very natural. It's easy to get immersed with the level of control given to you. It's kind of like a very simplified version of Mirror's Edge.\n+And I personally love when you can collect notes to learn about the backstory in a horror game, which Outlast definitely provides, so that's a pretty big plus in my book.\n[h1]Cons[/h1]\n-The enemy AI is both predictable and easy to manipulate. Once you realize that a stalker will check all hiding spots [i]except[/i] the one you're currently in (unless you're an idiot who decided to hide while he's looking at you), hiding changes from you being scared of being found to you being annoyed that he hasn't left the room yet.\n-Some of the jumpscares are kind of weak. I don't mind jumpscares, but in a video game I don't think they're effective when they're part of a cutscene. Basically, instead of thinking \"oh no, I need to run,\" you think \"oh no, I need to watch something happen.\" Don't get me wrong, there are some jumpscares that aren't a part of a cutscene, but there aren't many.\n-But here's probably my biggest complaint: no combat. Now, I'm not some nutcase who picks up a game of Tetris and yells \"WHERE IS THE COMBAT,\" but in a horror game I feel some level of combat is necessary to keep the player scared.\nHere's my [strike]rant[/strike] theory on it: I think fear is strongest in the middle of a fight-or-flight moment. The harder it is to choose between the two, the more stressful and scary the situation is. Without any fighting, there's no real fight-or-flight moment, because the default choice is always to run away. Because of this, it's probably not much scarier to play the game than it is to watch someone else play.\n\nBut don't take these complaints too harshly; the game is still very well put together, and worth a playthrough. I'd give it about a 7.5/10.", "timestamp_created": 1506996887, "timestamp_updated": 1506998307, "voted_up": true, "votes_up": 57, "votes_funny": 8, "weighted_vote_score": "0.815280258655548096", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16851745": {"recommendationid": "16851745", "author": {"steamid": "76561198087794073", "num_games_owned": 200, "num_reviews": 5, "playtime_forever": 550, "playtime_last_two_weeks": 0, "last_played": 1428704284}, "language": "english", "review": "Outlast is a great game in almost every way, from tension to graphics.\n\nPros:\n- Amazing atmosphere.\n- Great graphics.\n- Sound is fantastic.\n- The camera is a well-implemented part of the game, making the search for batteries yet another tense part of the game.\n- You have no weapons - your only option is to run.\n- The environment is amazing.\n- The Whistleblower DLC is a nice touch to the story.\n\nCons:\n- The maps are big and can be confusing, but I'm not sure if that's even a con, given that you have some sense of exploration.\n- It can have a repetitive nature. It can quickly turn into a hide-and-seek simulator, if you have no idea how to progress through the level.\n- The character-design is not well developed or in-depth. \n\nAll in all, I can deeply recommend Outlast. The cons are nothing compared to the great parts of Outlast, and you should definitely buy it, if you enjoy the genre.", "timestamp_created": 1435878084, "timestamp_updated": 1435878111, "voted_up": true, "votes_up": 42, "votes_funny": 3, "weighted_vote_score": "0.785862922668457031", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32755418": {"recommendationid": "32755418", "author": {"steamid": "76561197978440338", "num_games_owned": 163, "num_reviews": 3, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1498364614}, "language": "english", "review": "I have watched horror movies for fun for over 25 years.\nI can walk in the woods at midnight with no moon.\nI have toured abandoned hospitals and tunnels under buildings.\nI have been wanting to purchase this game for a while.\nI played .3 hrs.....I dont know if I want to continue or uninstall.\nWhy are my hands shaking......", "timestamp_created": 1498364969, "timestamp_updated": 1498364969, "voted_up": true, "votes_up": 82, "votes_funny": 56, "weighted_vote_score": "0.851019084453582764", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28221742": {"recommendationid": "28221742", "author": {"steamid": "76561198116611248", "num_games_owned": 154, "num_reviews": 25, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1509291937}, "language": "english", "review": "Don't Play this with your Girlfriend.\nDon't Play this before bed.\nDon't Play this before or after a meal.\nDon't Play this with your head phones on.\nDon't Play this on a big screen.\nDon't Play this in a dark room.\nDon't Play this if you have any signs of epilepsy or seizures. \nDon't Play this if your a p***y\nAnd most importantly,Don't Play this if you don't got an extra pair of pants.\nSeriously man,this is, by far, the most scary experience I've ever came across.\nSo without further screwing around, lets get to this:\nPlot:\nIn Outlast, you assume control of a Journalist,who breaks into the \"Mount Massive Asylum\", a bu...... you get the point don't you.\nSo you get in, climbing the construction ladder.And as soon as you enter the room.. whos, the lights go out.\nSo what you have through out the game is a camcoder with a night vision, and your light parkour skills.\nJust after opening a few doors and climbing a few vents, you suddenly open a door which jump scares the s**t outta you, only to be followed by uncountable corpses and unbearable Gore.\nThroughout Outlast, you will be haunted by the sickos of the Asylum.\nYou either hide from them, or you run from them.\nOutlast is freaking intense at time when they're chasing you and you run blindly into the dark, not know where your going, only to discover a dead end, or find yourself in even deeper s**t.\nThere is even a scene where you get strapped to a chair by a doctor(yeah doctor[laughs]. Right), who takes out a big f** scissor(like the ones Edward Scissor-hand used to have) and chops of your fingers. And the best part: You get to watch it in FPS.\nOutlast had been an immense,memorable experience. I'm damn glad that I was able to finish it, cause hell I ain't playin' it again..... ever. The ending was a bit unsatisfactory though, but still, fun and scary.\nGameplay length: Took me about 5 hours to complete.(Played in Normal Difficulty)\n9.5/10", "timestamp_created": 1481041856, "timestamp_updated": 1481041856, "voted_up": true, "votes_up": 128, "votes_funny": 65, "weighted_vote_score": "0.844887673854827881", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16876347": {"recommendationid": "16876347", "author": {"steamid": "76561198014766672", "num_games_owned": 2961, "num_reviews": 398, "playtime_forever": 560, "playtime_last_two_weeks": 0, "last_played": 1439158551}, "language": "english", "review": "Outlast is a first person horror game which was released in mid 2013 on the PC while also being released afterwards on consoles. It is own by approximately a million users on Steam too.  The game is also built on the unreal engine. \n\nThe game is based around a story rich campaign told in first person narrative style set in a psychiatric hospital which has been overrun by murderous paitents.  Your character, Miles Upshur, has no means of combat, other than shoving enemies out of your way. You are forced to use the technique which most would do when faced with the types of enemies in this game, running for your life and hiding like a little girl under a bed.  You also carry a notebook and a camcorder, which is used to document the events inside the hospital. The camera is used as your mechanism of seeing in the dark, but obviously in good horror genre style it has a limited supply of power - so you also have to explore the hospital for batteries to keep it turned on.  \n\nOutlast is built on the Unreal engine; so the graphics are top notch; they really capture the scene and will have you cringing in horror at some of the sights you will see. The lighting is absolutely perfect, along with the rain effects when outside. \n\nYou can go as deep as you want with the story; you can either follow the plot by just wandering around the halls and purely just going off the scripted events that happen or you can delve very deeply into the story by finding all kinds of documents scattered around in drawers and cupboards. \n\nThis is easily the scariest game I have ever played. On top of the stunning visuals that are almost life like, the game has the best audio you will ever find in a horror game; footsteps, background screaming, musical tempo changes. They are all amazing and you won't find a game which captures it more perfectly than Outlast. \n\nOutlast is hard; the first \"level\" chucks you straight in at the deep end as you have to scramble around a beefed up guy to turn the power generator on; this is the first of many challenges you will face in the game. You have to really stick at it at times to try work the best method of progressing around some events. You will be very lucky to complete the game without running into any problems. \n\nThe whole game took me seven hours to complete; this was my first playthrough and there sadly isn't any other reason other than collecting all of the documents to play through it again. The story is linear and you will end up with the same ending each time. \n\nRegardless of the lack of replay ability, Outlast is easily one of the best games to come out in recent years and horror fans will absolutely love it. If you aren't into jump scares this may not be for you, as there are plenty and you will probably find yourself alt F4ing out many times. \n\nIf you found this review helpful, please consider giving it a thumbs up. You can also find more reviews over at http://www.completingthebackloggroup.com/\n\nPlease also check out Completing the Backlog's Curator page [url=http://steamcommunity.com/groups/completingthebacklog#curation]here[/url] - follow for regular updates on reviews for other games!", "timestamp_created": 1436010197, "timestamp_updated": 1445352578, "voted_up": true, "votes_up": 351, "votes_funny": 26, "weighted_vote_score": "0.851149320602416992", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "47422963": {"recommendationid": "47422963", "author": {"steamid": "76561198344155139", "num_games_owned": 66, "num_reviews": 12, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1542294056}, "language": "english", "review": "I can confirm the pause button works after testing it numerous times.", "timestamp_created": 1544380177, "timestamp_updated": 1544380177, "voted_up": true, "votes_up": 40, "votes_funny": 129, "weighted_vote_score": "0.811875820159912109", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "13998585": {"recommendationid": "13998585", "author": {"steamid": "76561198026512199", "num_games_owned": 1219, "num_reviews": 4, "playtime_forever": 1049, "playtime_last_two_weeks": 0, "last_played": 1434288941}, "language": "english", "review": "We accidently summoned a god, so we hid in a locker. Then some guy came in and opened all but the last locker (where we were hiding) and stood there, waiting to see if the locker would open itself. When we emerged he shouted “Yes” as if his entire life dream had been accomplished - he proved he wasn’t insane because finally, the locker opened itself.\n\nOutlast isn’t a game about the horrors of being trapped inside a mental asylum, it’s a game about fulfilling the dying wishes of crazy people. \n\n10/10 would hide in a locker again", "timestamp_created": 1421349667, "timestamp_updated": 1421349667, "voted_up": true, "votes_up": 52, "votes_funny": 82, "weighted_vote_score": "0.78943789005279541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16780213": {"recommendationid": "16780213", "author": {"steamid": "76561198075877937", "num_games_owned": 930, "num_reviews": 61, "playtime_forever": 6536, "playtime_last_two_weeks": 0, "last_played": 1464456633}, "language": "english", "review": "Been hiding the whole 35 hours in a locker,  I'm literally too scared to get out.", "timestamp_created": 1435586747, "timestamp_updated": 1435586775, "voted_up": true, "votes_up": 413, "votes_funny": 1045, "weighted_vote_score": "0.853660523891448975", "comment_count": 21, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18514889": {"recommendationid": "18514889", "author": {"steamid": "76561198132758751", "num_games_owned": 99, "num_reviews": 5, "playtime_forever": 704, "playtime_last_two_weeks": 0, "last_played": 1476403075}, "language": "english", "review": "All I can say about this game is that it is basiclly having an orchestra on your back while you are chased by naked deformed men.", "timestamp_created": 1445043781, "timestamp_updated": 1445043781, "voted_up": true, "votes_up": 173, "votes_funny": 577, "weighted_vote_score": "0.851716697216033936", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32242068": {"recommendationid": "32242068", "author": {"steamid": "76561198011831952", "num_games_owned": 88, "num_reviews": 9, "playtime_forever": 7434, "playtime_last_two_weeks": 0, "last_played": 1498089350}, "language": "english", "review": "[b]O[/b]utrageous\n[b]U[/b]nholy\n[b]T[/b]errifying\n[b]L[/b]unatic\n[b]A[/b]trocious\n[b]S[/b]chizophrenic\n[b]T[/b]hreatening\t\n\n\n[h1]⭐⭐⭐⭐Very Positive[/h1]", "timestamp_created": 1496853694, "timestamp_updated": 1506240041, "voted_up": true, "votes_up": 160, "votes_funny": 30, "weighted_vote_score": "0.83042222261428833", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32641420": {"recommendationid": "32641420", "author": {"steamid": "76561198139205006", "num_games_owned": 275, "num_reviews": 4, "playtime_forever": 297, "playtime_last_two_weeks": 0, "last_played": 1435658746}, "language": "english", "review": "Open game, watch the creepy Red Barrels intro. Start the game, try to pass the wellchair guy and...  ALT+F4.", "timestamp_created": 1498135698, "timestamp_updated": 1498135731, "voted_up": true, "votes_up": 80, "votes_funny": 107, "weighted_vote_score": "0.823954641819000244", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18028739": {"recommendationid": "18028739", "author": {"steamid": "76561198089299679", "num_games_owned": 6724, "num_reviews": 357, "playtime_forever": 1035, "playtime_last_two_weeks": 0, "last_played": 1442226307}, "language": "english", "review": "Well this game is 20$ right now and it saved me more money then that....\n\nI couldn't eat yesterday's lunch.. last night dinner and this morning's breakfast because of this game.\nI would have spent more then 20$ on food and other things yesterday.. But during and after playing this game.. those money are saved...\n\nI just couldn't stomach the food for right now and i couldn't sleep last night...\n\nThere is a chinese saying.. \"尸山血海\" Which is use to describe the battle field or Masscure... It's word by word meaning is \"Corpse Mountain, And Blood Sea\". This game literally take the meaning and produced the effect.\n\nI only posted 1 screenshoot of this game and I had to choose one of the very basic ones and put on spoiler...\nThe other ones I end up deleting simply because it feels like a crime to show such graphic picture on internet to kids that may stumble upon them.\n\nI did play Insane difficulty to start to try to get all the achievements but gave up 3 hours in cause it's just a bit too hard since you basicly playing ironman and simply cannot die even once. Just lower the difficulty by 1 would be a great experience. 17 hours marathon was enough for me to complete the main game and DLC. I am sure a lot people can do much faster if they just play on normal.\n\nAs I play this game. It immendiatly felt like the good old resident evi 2l: Nemesis. You are constantly pressured by enemy you cannot defeat and have to find way to evade, hide and use enviroment to your adavange to dodge/delay the encounter. Except this time you play a reporter(for DLC a software engineer) and unlike Jill you don't get a weapon... not a gun.. not a bat.. not even a shiv... You don't get to use a single weapon in the entire game.\n\nAll you got is camera that have infradvision for you to see in the dark.. And there are alot dark...\n\nGraphics of this game is really not that great but creater made it super nasty and even borderline disgusting and give a grand sense of surreal terror. The way Horror game should be!\n\nThe story, dialog and interaction is great though out the base game. The DLC even improved what worked for the base game and even made it better.\n\nThere is section of full 20 seconds in DLC made me hold my balls the entire time and afraid it's gonna be table saw away...\n\nThe heavy breathing and scared sound the main character feel so real.. and as you playing the game there will be many time you feel your heart beat match the main character's heartbeat. Sometime too fast.. sometime stopped!!!\n\nYou must use everything to survive in this game and sound/music play a huge importance and it's very well done. You can just feel the big guy breathing down your neck when you being chased.\n\nFor horror Game I have always said Silent hill Series would be my No.1 because that's psychologically involved...\nIt still is my number one. But this game grab second very easily. It's not as story involved and intriging as silent Hill. But It  will make a weak man shit his pants... (I didn't .. but i did lose sleep and food over it soooo...)\n\n9.9/10 for a Great horror Game experience... And please keep kids less then 18 away from this game..", "timestamp_created": 1442228049, "timestamp_updated": 1445663987, "voted_up": true, "votes_up": 165, "votes_funny": 102, "weighted_vote_score": "0.844757139682769775", "comment_count": 11, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31028715": {"recommendationid": "31028715", "author": {"steamid": "76561198095102736", "num_games_owned": 176, "num_reviews": 98, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1491694307}, "language": "english", "review": "14 minutes in I can confirm it's scary", "timestamp_created": 1491694474, "timestamp_updated": 1491694474, "voted_up": true, "votes_up": 158, "votes_funny": 70, "weighted_vote_score": "0.848903954029083252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35109517": {"recommendationid": "35109517", "author": {"steamid": "76561198121059169", "num_games_owned": 591, "num_reviews": 41, "playtime_forever": 376, "playtime_last_two_weeks": 0, "last_played": 1539884976}, "language": "english", "review": "IM FEELING SO RELAXED", "timestamp_created": 1506014620, "timestamp_updated": 1511407395, "voted_up": true, "votes_up": 825, "votes_funny": 29, "weighted_vote_score": "0.856478214263916016", "comment_count": 19, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20504264": {"recommendationid": "20504264", "author": {"steamid": "76561197991288710", "num_games_owned": 934, "num_reviews": 73, "playtime_forever": 778, "playtime_last_two_weeks": 0, "last_played": 1549824532}, "language": "english", "review": "I certainly didn't Out-last this one.\n\nRather unfortunately, my game was abruptly ended after just over an hour (some giant spasm ran down my arm, causing my fist to smash down on the PC's reset button whilst my other hand mashed Alt+F4... I should really see a doctor about that.)\n\n\nIn all seriousness, the tension in Outlast is ramped up to MAX. \nA perfect example of a psychological thriller, with all bases covered.\n\n\nThe atmosphere is incredibly eerie, borderline terrifying!\nArmed with only a Night-Vision camera inside an insane asylum, you're up for some serious competition against your imagination and whatever may lurk within...\n\n\nTldr;\n\nFor any who suffer from IBS, a weak heart or insomnia, I really don't recommend playing this game unless you have access to methods of medical treatment (seriously.)\nMy wrecked nervous-system says run away and don't come back.\n\nFor those that are fans of the Thriller genre, in no way claustrophobic, and have a limitless supply of underwear to hand - my inner thirst for self-torture says 'Go for it!'\n\n\n(To your own mental detriment.)\n\nI believe my brain may be screwed.", "timestamp_created": 1452689746, "timestamp_updated": 1452689754, "voted_up": true, "votes_up": 37, "votes_funny": 56, "weighted_vote_score": "0.776621997356414795", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35173391": {"recommendationid": "35173391", "author": {"steamid": "76561198332209063", "num_games_owned": 171, "num_reviews": 10, "playtime_forever": 649, "playtime_last_two_weeks": 0, "last_played": 1509126578}, "language": "english", "review": "best way to get a heart attack", "timestamp_created": 1506237956, "timestamp_updated": 1506237956, "voted_up": true, "votes_up": 54, "votes_funny": 22, "weighted_vote_score": "0.791889846324920654", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33016515": {"recommendationid": "33016515", "author": {"steamid": "76561198184379993", "num_games_owned": 116, "num_reviews": 46, "playtime_forever": 1334, "playtime_last_two_weeks": 0, "last_played": 1506049692}, "language": "english", "review": "This game was amazing, and gave out some really good horror that made me leaning back on my chair.\n\nOutlast is a horror survival game that takes place at an asylum. You play as Miles Upshur, an investigative reporter that risked his life to investigate the asylum, and to see what happened. But thank to that, you are trapped with crazy \"patients\" that usually want to kill you. In order to escape, you have to run or hide, and complete the objective it wants you to complete.\n\nI know there is a lot more to the story, but the story itself is quite interesting, and describing it more might bring out some spoilers (which I don't want to happen).\n\nThe gameplay is stealth-base. You aren't a fighter, so you need to hide or run to survive. You can hide in the dark, under a bed, in a locker, or just run for your life (which I don't recommend unless you get spotted.). 90% of the game is dark, so you need to use your night-vision to see where you are going. If you do use your night-vision, it takes up battery, so you need to look for batteries in the area so you don't run out. If you do run out, your night-vision will be quite weak, and you can only see things that are close to you. Miles Upshur takes notes along the way to bring out his thoughts about what's happening (which was a clever way to give his character some development.), and you can pick up documents to find some answers on what happened to the Asylum.\n\nThe enemies are terrifying. If they find you, they will chase you until you get away. Their A.I. isn't the best ever, but it's good enough to make the enemies intense, since they check lockers, wander around, and look under beds to find you. You never feel safe when they're in the area.\n\nThe game does have good replayability thanks to achievements and difficulty choices. There are 14 achievements (you need the DLC in order to get all of them, though.), and 4 difficulty options. Normal, Hard, Nightmare, and Insane. On normal, you can hold 10 batteries, the enemies aren't very smart, the enemies don't run as fast as you, you can survive more hits, etc. On harder difficulties, however, the enemies can see and hear you easier, they run more faster, the night-vision drains the battery more quicker, you can't survive 2-3 hits, etc. In fact, on Insane, you have to play through the WHOLE game without saving, so if you die, you need to play the whole game all over again.\n\nMost of the characters are quite interesting. You have the main character, Miles Upshur, Father Martin, Chris Walker, The Twins, and much more. Most of them have a personality, and are nicely written.\n\nThe game looks AMAZING. They did such a good job on the graphics it makes the game even more terrifying, even for today standards. For 2013, it's quite impressive. The levels, character designs, etc. just look really good. The only thing I can say about the graphics is, \"They're amazing.\"\n\nThe soundtrack fits into the game perfectly. When just walking around, it has that calm, disturbing music playing. If there is an enemy in the area, the music will get a bit intense, but not as intense as it gets. But if you are found, the music gets very intense it's really alarming, and it will make you panic. Again, the only thing I can say about the soundtrack is, \"It's amazing.\"\n\nI do have some flaws, though.\n\n-The game can get repetitive with the chases and stealth moments after 3 hours into it.\n-The game's ending was kind of disappointing.\n-Some moments were kind of easy to predict what was going to happen.\n\nTL;DR: Outlast is a horror game that has a good amount of scary moments with fun gameplay, interesting characters, mind-blowing graphics for 2013, amazing soundtrack, and an interesting story. If you love horror, this is a must buy! If you enjoyed Amnesia: The Dark Decent, you will enjoy this game.\n\nHighly Recommended!", "timestamp_created": 1498782805, "timestamp_updated": 1498950649, "voted_up": true, "votes_up": 48, "votes_funny": 3, "weighted_vote_score": "0.811732590198516846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30660323": {"recommendationid": "30660323", "author": {"steamid": "76561198119439513", "num_games_owned": 65, "num_reviews": 3, "playtime_forever": 707, "playtime_last_two_weeks": 0, "last_played": 1490137281}, "language": "english", "review": "For a mindless horror game, Outlast comes off... surprisngly not mindless. There is a plot, and the use of journal notes makes Miles (and Waylon, if you're playing Whistleblower) easier to connect to as a character without losing imersion. The mechanics of the game work fairly well (though grabbing objects can be a little touchy; not enough to really be even a minor inconvenience), and the actual horror aspects are very well executed. The characters that do speak are interesting and engaging. You also don't want to encounter them in a dark hallway, which - just saying - you will. Often. \nAnyway. I had a lot of fun being murdered loads of times by guys who somehow found me sitting in a dark corner I couldn't even see in.", "timestamp_created": 1490140283, "timestamp_updated": 1490140283, "voted_up": true, "votes_up": 56, "votes_funny": 5, "weighted_vote_score": "0.7768821120262146", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "7794217": {"recommendationid": "7794217", "author": {"steamid": "76561198041432485", "num_games_owned": 351, "num_reviews": 1, "playtime_forever": 1884, "playtime_last_two_weeks": 0, "last_played": 1505194334}, "language": "english", "review": "Even though the past few years have brought along a number of horror titles that haven't really been up to par, Outlast is a survival-horror experience that shines through.\n\nIt's been stated previously that Outlast isn't the most innovative or creative work available, and although that statement rings true on a cetain number of levels, it's definitely a title to consider and invest in, especially if you're a horror-junkie who's looking for some more nightmare fuel.\n\nOutlast contains the same atmosphere-type horror as the most-all-around praised Amnesia: The Dark Descent, although it also features several other elements that keep the game flowing smoothly and keep the player on the edge of their seat. The game does contain a good amount of jumpscares along with the overall tense feel of the environment, and even if you're not a fan of cheap spooks, Outlast does a wonderful job of placing them in areas you probably wouldn't expect them to be, getting the best reactions out of the people playing it.\n\nOutlast also has fantastic aesthetic value, as the graphics are some of the most realistic I've seen in a long while. That being said, if you want to enjoy the full visual factor of this game, you might want to make sure your computer is up to speed.\n\nThe game does have its flaws, of course. The story is well placed together, but in order to fully understand it, you'll have to make sure to collect all of the documents and notes you come across, making the experience a bit confusing and monotonous at certain times. I personally also had my dislikes with how the entire thing came to a close at the end, as it wasn't the best wrap-up I've seen.\n\nAlthough it has a few rough spots, Outlast is an overall excellent experience, and I was satisfied throughout the entire game. It's also the only horror title I've ever played that's caused me literal chest pain and nausea. Like, ever. So it's pretty damn good. Pick it up if you've got the coin. A definite must-buy for horror fans.", "timestamp_created": 1385590839, "timestamp_updated": 1385590839, "voted_up": true, "votes_up": 150, "votes_funny": 2, "weighted_vote_score": "0.838271081447601318", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12846990": {"recommendationid": "12846990", "author": {"steamid": "76561197967608630", "num_games_owned": 434, "num_reviews": 61, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1415465615}, "language": "english", "review": "As soon as I get out of here I am going to write a poor review for this hospital on Yelp.", "timestamp_created": 1415465769, "timestamp_updated": 1415465769, "voted_up": true, "votes_up": 382, "votes_funny": 521, "weighted_vote_score": "0.85998004674911499", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39491826": {"recommendationid": "39491826", "author": {"steamid": "76561198147753994", "num_games_owned": 123, "num_reviews": 34, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1532376881}, "language": "english", "review": "===[ ❤ Audience: ]===\n☐ Kids\n☐ Everyone\n☑ Casual players\n☑ Pro players\n\n===[ ☼ Graphics: ]===\n☐ Potato\n☐ Really bad\n☐ Bad\n☐ OK\n☑ Good\n☐ Beautiful\n☐ Masterpiece\n\n===[ $ Price/quality: ]===\n☑ Full price\n☑ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Don't do it\n☐ Free\n\n===[ ☣ Requirments: ]===\n☐ 90' PC\n☐ Minimum\n☑ Medium\n☐ Fast\n☐ High end\n☐ NASA computer\n\n===[ ☼ Difficulty: ]===\n☐ You just need 2 arms\n☐ Ez\n☑ Easy to learn / Hard to master\n☑ Hard (first few hours)\n☐ Dark Souls\n\n\n===[ ۞ Game time/length ]===\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☑ Long ( 12+ hours)\n☐ Endless\n\n===[ ♬ Story] ===\n☐ It doesn't have\n☐ Still better than Twilight\n☐ Average\n☑ Good\n☐ Fantastic\n\n===[ § Bugs ]===\n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☐ Few Bugs\n☑ You can use them for speedrun\n☐ Nothing\n\n===[ ✦ Others: ]===\nMultiplayer: NO\nSingleplayer: YES", "timestamp_created": 1516477335, "timestamp_updated": 1516477335, "voted_up": true, "votes_up": 66, "votes_funny": 15, "weighted_vote_score": "0.798853516578674316", "comment_count": 5, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36547755": {"recommendationid": "36547755", "author": {"steamid": "76561198398810196", "num_games_owned": 525, "num_reviews": 19, "playtime_forever": 646, "playtime_last_two_weeks": 0, "last_played": 1519256705}, "language": "english", "review": "- played it around midnightish...\n- cat snuggled up to my leg suddenly...\n- got a heart attack...\n- exit game, watched lilo & stitch ...\n- my soul is smooth again.\n\n", "timestamp_created": 1510824866, "timestamp_updated": 1510824866, "voted_up": true, "votes_up": 38, "votes_funny": 143, "weighted_vote_score": "0.796594917774200439", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "10005552": {"recommendationid": "10005552", "author": {"steamid": "76561197975993384", "num_games_owned": 159, "num_reviews": 5, "playtime_forever": 423, "playtime_last_two_weeks": 0, "last_played": 1488513926}, "language": "english", "review": "Hands down the scariest game I've ever played. Amnesia was awesome, but this game makes Amnesia look like a sunny and romantic walk in the park with your new puppy. :O", "timestamp_created": 1399114713, "timestamp_updated": 1399114713, "voted_up": true, "votes_up": 473, "votes_funny": 0, "weighted_vote_score": "0.811518669128417969", "comment_count": 22, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "15642466": {"recommendationid": "15642466", "author": {"steamid": "76561198044484011", "num_games_owned": 812, "num_reviews": 60, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1457257542}, "language": "english", "review": "THEY WILL FIND YOU AND KILL YOU!\nTHEY WILL RUN AT YOU.\nTHEY WILL FIND YOU WHEN YOUR HIDING.\nTHEY WILL BREAK DOWN THE MOTHERFUCKING DOORS TO GET TO YOU.\n\nNOTHING CAN STOP THEM!\n(Except vents, that's a nono zone)", "timestamp_created": 1430510613, "timestamp_updated": 1430510613, "voted_up": true, "votes_up": 285, "votes_funny": 671, "weighted_vote_score": "0.8378562331199646", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47385416": {"recommendationid": "47385416", "author": {"steamid": "76561198027776061", "num_games_owned": 1334, "num_reviews": 87, "playtime_forever": 658, "playtime_last_two_weeks": 0, "last_played": 1542511046}, "language": "english", "review": "One of my all-time favorites. Brutal, scary, intense and most importantly... FUN.", "timestamp_created": 1544268084, "timestamp_updated": 1544268084, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.761419236660003662", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12423750": {"recommendationid": "12423750", "author": {"steamid": "76561198057178633", "num_games_owned": 149, "num_reviews": 6, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1404219971}, "language": "english", "review": "I played this for barely even 11 minutes 3 months ago and have been too afraid to play anymore since. \n\n10/10", "timestamp_created": 1412868401, "timestamp_updated": 1412868401, "voted_up": true, "votes_up": 368, "votes_funny": 158, "weighted_vote_score": "0.832698047161102295", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26280423": {"recommendationid": "26280423", "author": {"steamid": "76561198074435251", "num_games_owned": 374, "num_reviews": 48, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1478041137}, "language": "english", "review": "-In complete darkness\n-Battery of camera almost empty\n-Replaces battery\n-Turns nightvision back on\n-\"Hello sweetie\"\n-Instant ESC button\n", "timestamp_created": 1477706229, "timestamp_updated": 1477706229, "voted_up": true, "votes_up": 58, "votes_funny": 129, "weighted_vote_score": "0.824170529842376709", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8353602": {"recommendationid": "8353602", "author": {"steamid": "76561197981801649", "num_games_owned": 308, "num_reviews": 21, "playtime_forever": 789, "playtime_last_two_weeks": 0, "last_played": 1483290254}, "language": "english", "review": "No matter who you are, no matter what you experienced in your life so far, no matter how cold your soul has become: THIS game will  scare the shit out of you !!! Forget Amnesia. Amnesia is a little fart compared to Outlast. You're playing a journalist who has to investigate an empty psychiatry. But sooner or later you will find out that this psychiatry is not empty and the battle for survival begins. There aren't any weapons you can use, only some beings in this psychiatry have weapons and they will use them against you. You can only run away and hide. Your camera is the only thing you have. Run, hide, film and hope. Outlast is one of the best Steam-games I have ever played so far. I can only recommend it to people who like horror-games and have the guts to play it. If you thought Amnesia is scary, then try this! It's the best horror-game existing so far !", "timestamp_created": 1388199205, "timestamp_updated": 1511712609, "voted_up": true, "votes_up": 157, "votes_funny": 0, "weighted_vote_score": "0.819605112075805664", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33406824": {"recommendationid": "33406824", "author": {"steamid": "76561198040443739", "num_games_owned": 102, "num_reviews": 14, "playtime_forever": 2176, "playtime_last_two_weeks": 0, "last_played": 1488083430}, "language": "english", "review": "\"Hell is an experiment you can't survive in Outlast, a first-person survival horror game developed by veterans of some of the biggest game franchises in history... if you dare.\"\n―Outlast tagline\n\n[h1]What Is Outlast[/h1]\nOutlast is a crazy, gory, insane first-person survival horror video game developed and published by Red Barrels. It was released on;\n[list]\n    [*]September 4, 2013 for the PC,\n    [*]February 4, 2014 for PS4, and\n    [*]June 18th, 2014 for Xbox One\n[/list]\nThere is on one DLC for this game, a direct prequel and finale to the game, Outlast: Whistleblower, was released on;\n[list]\n    [*]May 6th, 2014 for PS4 and PC, and\n    [*]June 19th, 2014 for Xbox One\n[/list]\n\n[u]Warning[/u]:\nOutlast contains intense violence, gore, graphic sexual content, and strong language. Please enjoy!!\n\n[h1]Who You Are In This Game[/h1]\nYou are Miles Upshur, an investigative reporter whose ambition is about to earn him an intimate tour of hell on earth. Always willing to risk digging into the stories no other journalist would dare investigate. After receiving a whistleblower's tip concerning the mistreatment of patients, he arrives at Mount Massive Asylum to investigate, unaware of the hell he is about to walk into.\n\n[h1]Game/Gameplay[/h1]\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=877605111\nThe game starts with Miles Upshur driving up the road that leads to Mount Massive Asylum. Once Miles reaches the checkpoint past the entrance gate of the asylum, he will stop the car and put it in park while having a look around the checkpoint area in front of him. Miles will look down to the passenger seat of the car and pick up **\"THE WHISTLEBLOWER\" DOCUMENT** and then the **2 BATTERIES** followed by his camcorder.  [b]From here its all down hill for both player and the protagonist![/b]\nIn order to find out what is happening here, you will seek out the dark secret at the heart of Mount Massive Asylum. Stay alive as long as you can, record everything. You are not a fighter; to navigate the horrors of Mount Massive and expose the truth, your only choice are to run, hide, or die.\n\nEaster Egg\n[spoiler]Miles leaves the key in the ignition - judging by the car beeping as he gets out.[/spoiler]\n\nThere are eight- (8) Chapters in this game. Each one more messed up then the previous. \nAlso, there are eight- (8) achievements. You can achieve 7 of 8 in one play through, unless you play the game on INSANE mode (No Saves, No Checkpoints).\n\nThroughout the game, you will need to search for batteries for your camera, 31 documents and 31 notes... the last thing you will need to do is run out of batteries for that camera of yours! If you find all 62 \"collectibles\" you will not only get an achievement, but will truly understand what is happening at Mount Massive Asylum. The Documents are picked up and the [b]notes are obtained by filming certain events or objects with your camcorder[/b].\n\nYou definitely need to like horror/survival type games to get through this one. There are some VERY disturbing things going on at the Asylum. You whitness some very gory scenes that will cause you cringe and walk away from the computer or outright it shutdown. \n\nI had a blast with this game. It was very creepy, nasty, deranged and totally WRONG! You definitely will walk away from this game upset at times. Those guys at Red Barrels are unquestionably on some wackey meds!\n\nMy rating system for Horror based games is: \n[b]The Sphincter Factor[/b]. 1 thru 5\n1 - Totally Open, you need surgery to fix this Muscle (game) ->\n5 - Totally Closed (Superb)! Tight as a well diggers a$$ (The Tops, a great game)\n\nThe Sphincter Factor for Outlast = Solid 4.85\n[list]\n    [*]AWESOME story\n    [*]Very good gameplay... I felt lots of tension and stress playing this game! That was the point, BTW! :)\n    [*]Graphics were great!\n    [*]Great atmosphere, IMO,\n    [*]Awesome audio effects/soundtrack\n    [*]Boss fights were challenging (for me) and were inscope of the game theme. Awesome!\n[/list]\n\nI don't believe there is any \"replayability\" of Outlast if you focus on obtaining all the collectibles in the 1st playthrough. Once you know the story, that's pretty much it. All in all a vastly memorable experience. Definitely recommended. On to the DLC!\n\n\n\n", "timestamp_created": 1499613653, "timestamp_updated": 1499613653, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.758511006832122803", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12252096": {"recommendationid": "12252096", "author": {"steamid": "76561198080120176", "num_games_owned": 851, "num_reviews": 40, "playtime_forever": 619, "playtime_last_two_weeks": 0, "last_played": 1412646428}, "language": "english", "review": "I found a guy fapping", "timestamp_created": 1411770983, "timestamp_updated": 1411770983, "voted_up": true, "votes_up": 327, "votes_funny": 340, "weighted_vote_score": "0.827067375183105469", "comment_count": 15, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31047832": {"recommendationid": "31047832", "author": {"steamid": "76561198119474956", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1491796317}, "language": "english", "review": "How my 10 minutes of playtime went:\n\n1. Walk out of car\n2. Walks around the perimeter of the building\n3. \"Parkour\" into the building (Climbed a ladder)\n4. Music Change\n5. \"Slowly\" open door (like honestly made more noise than me falling down a flight of stairs)\n6. Walks into the first room\n7. Hears Banshee shreik through my headphones.\n8. Drops my controller on my right pinky toe.\n9. Reads review of people shitting themselves.\n10. Uninstalls game. (For Now)\n10/10. Strikes fear man.", "timestamp_created": 1491768132, "timestamp_updated": 1491768132, "voted_up": true, "votes_up": 89, "votes_funny": 103, "weighted_vote_score": "0.779884159564971924", "comment_count": 9, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28614045": {"recommendationid": "28614045", "author": {"steamid": "76561198059955236", "num_games_owned": 126, "num_reviews": 27, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1434721538}, "language": "english", "review": "Had to refund it because it was too scary for me. 10/10", "timestamp_created": 1482623693, "timestamp_updated": 1482623693, "voted_up": true, "votes_up": 74, "votes_funny": 72, "weighted_vote_score": "0.773668527603149414", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10005087": {"recommendationid": "10005087", "author": {"steamid": "76561198101276222", "num_games_owned": 277, "num_reviews": 8, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1535808928}, "language": "english", "review": "This is how you should play the game: \n1. medium-big screen with high res so you can see the scary details, and high FPS to prevent motion sickness\n2. proper headset so you can hear your character's gasping breath and other magnificent sound details\n3. play when you're alone so you wont be a laughing stock when you fall from your chair after a dead body fall from the ceiling right before you enter a room\n\nAs I write this, my playtime is still minimal because I still to need to regain my balls.\n\nYou think you're awesomely though after watching Paranormal Activity? Try this game..\n", "timestamp_created": 1399110855, "timestamp_updated": 1399110855, "voted_up": true, "votes_up": 59, "votes_funny": 0, "weighted_vote_score": "0.767959237098693848", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18480910": {"recommendationid": "18480910", "author": {"steamid": "76561198142073418", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 2667, "playtime_last_two_weeks": 0, "last_played": 1502689152}, "language": "english", "review": "Good luck finding the courage to leave the lockers\n10/10", "timestamp_created": 1444895262, "timestamp_updated": 1444895262, "voted_up": true, "votes_up": 107, "votes_funny": 163, "weighted_vote_score": "0.832210123538970947", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38035283": {"recommendationid": "38035283", "author": {"steamid": "76561198307016109", "num_games_owned": 132, "num_reviews": 11, "playtime_forever": 675, "playtime_last_two_weeks": 0, "last_played": 1512314793}, "language": "english", "review": "Outlast\n\nThe opening of the game gave me a heart attack which is usual in every horror game. I expected a lot of jumpscares in this game. This game did satisfy some but once we play and start to understand how the game works this is like all those usual horror game we have played.\nThis game till is worth your try as it maintains the thrill element throughout but it may feel little dragging even though the game is very small.\nThe ending of the game was a bit of disappointment to me.\nThis game will sure scare the hell out if your playing a horror/thriller game for a first time. People who usually plays horror may not find it much scarier but this game will keep your heart beating.\nThe best and the worst part of the game is most of the time you run randomly in some direction in fear of getting caught, so be cautious in the path you go, most of the way will be a dead end.\n\nOutlast:Whistleblower DLC\n\nAfter finishing the base game i felt like a little disappointed as the game was less scarier than i imagined it to be and the ending made it even worse.So i played the dlc out of a kind of compulsion to finish this game but the dlc changed my opinion about the game.\nThe dlc is a very small game than the base game but the depth of fear i experienced in this game was blowing me away.\nI almost at one time removed my headphones went out to get some fresh air.I found this one to be a lot scarier than the base game.\nI never knew dlc would have such an impact. After playing the dlc i found why this game have such good reviews.\nThe dlc connects very well to the base story and stays crisp in its story which helps to maintain the fear throughout the dlc.\n\nSo i strongly recommend this game especially due to Whistleblower DLC.Make sure you are ready to play this, faint hearted people stay away from this game especially the dlc.\n\nOutlast:9/10\nWhistleblower DLC: 10/10.\nso overall 10/10.\nJust buy the game and make sure you play in dark with your headphones to get the most out of it.", "timestamp_created": 1512313359, "timestamp_updated": 1512313460, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.718590080738067627", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39257698": {"recommendationid": "39257698", "author": {"steamid": "76561198336572372", "num_games_owned": 313, "num_reviews": 4, "playtime_forever": 786, "playtime_last_two_weeks": 0, "last_played": 1531156615}, "language": "english", "review": "Outstanding game, even better DLC \nPerfect atmosphere with amazing story and gameplay.\n10/10 recommend", "timestamp_created": 1515682821, "timestamp_updated": 1515682821, "voted_up": true, "votes_up": 19, "votes_funny": 3, "weighted_vote_score": "0.706189751625061035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19707881": {"recommendationid": "19707881", "author": {"steamid": "76561198011312058", "num_games_owned": 324, "num_reviews": 4, "playtime_forever": 2654, "playtime_last_two_weeks": 0, "last_played": 1530613035}, "language": "english", "review": "*Hears random sound*\n*Hides in locker, hoping nothing shows up*\n\"I'll stay here for just a little bit more and make sure nothing is there\"\n3 hours later still hiding in the same locker\n\"Okay, I can't hear anything so I think it's safe now\"\n*Finally leaves, then hears the sound of a chainsaw starting up followed by \"I CAN SMELL YOU\"*\n*Proceeds to have a heart attack and get murdered by a naked cannibal*", "timestamp_created": 1450165574, "timestamp_updated": 1456570167, "voted_up": true, "votes_up": 67, "votes_funny": 224, "weighted_vote_score": "0.753296494483947754", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "15161274": {"recommendationid": "15161274", "author": {"steamid": "76561198074399860", "num_games_owned": 209, "num_reviews": 9, "playtime_forever": 1405, "playtime_last_two_weeks": 0, "last_played": 1530423878}, "language": "english", "review": "I found a guy fapping\n10/10 would play again", "timestamp_created": 1427926812, "timestamp_updated": 1427926812, "voted_up": true, "votes_up": 38, "votes_funny": 56, "weighted_vote_score": "0.718918144702911377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "45076946": {"recommendationid": "45076946", "author": {"steamid": "76561198202022263", "num_games_owned": 193, "num_reviews": 117, "playtime_forever": 853, "playtime_last_two_weeks": 0, "last_played": 1538582238}, "language": "english", "review": "[h1] Outlast [/h1]\n\n--- [Player Base] ---\n☑ Casual players\n☐ Hardcore players\n\n\n--- [Is it for mature players?] ---\n☐ Everyone\n☑ Mature\n\n\n--- [Story] ---\n☐ Doesn't have it\n☐ Bad\n☑ Average\n☐ Good\n☐ Fantastic\n\n\n--- [Graphics] ---\n☐ Really bad\n☐ Bad\n☐ OK\n☑ Good\n☐ Beautiful \n☐ Masterpiece\n\n\n--- [Difficulty] ---\n☐ Easy Peasy\n☐ Easy to learn but hard to master\n☑ Medium\n☐ Hard\n☐ Dark Souls\n\n\n--- [Timelength] ---\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☑ Average ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☐ Endless\n\n\n--- [PC specs] ---\n☐ Toaster\n☐ Average\n☑ Solid Medium\n☐ High end\n☐ Unoptimized\n\n\n--- [Price] ---\n☑ Full price\n☐ Wait for sale\n☐ Don't do it\n☐ Free\n\n\n--- [Bugs] ---\n☐ Game itself is a bug\n☐ Lot of bugs\n☐ Few Bugs\n☑ Nothing\n\n[u] Gameplay [/u]\nIn Outlast, the player assumes the role of investigative journalist Miles Upshur, as he navigates a dilapidated psychiatric hospital overrun by homicidal patients. The game is played from a first-person perspective and features some stealth gameplay mechanics. The player can walk, run, crouch, jump, climb ladders and vault over objects. Unlike most games however, the player doesn't have a visible health bar on the screen and is unable to attack enemies. The player must instead rely on stealth tactics such as hiding in lockers, sneaking past enemies, staying in the shadows and hiding behind or under things in order to survive. Alternatively, the player can attempt to outrun their pursuer. If the player dies, the game will reset to the most recent checkpoint.\n\nMost of the hospital is unlit, and the only way for the player to see while in the dark is through the lens of a camcorder equipped with night vision. Using the night vision mode will slowly consume batteries, forcing the player to scavenge for additional batteries found throughout the building. Outlast makes heavy use of traditional jump scares and audio cues, which alert the player if an enemy has seen them. If the player records specific events with their camcorder, Miles will write a note about it, providing further insight into his thoughts. Documents can be collected, which offer backstory and other supplementary information about the hospital.\n\n[u] Review [/u]\nThis game is guaranteed to give you nightmares, there are so many jumpscares in this game that I struggled to complete it without my partner by my side. It's recommended to use headphones and to be played in the dark to get the best gameplay, I didn't have the balls to do this.\n\nBatteries are your best friend! 8.5/10", "timestamp_created": 1538585340, "timestamp_updated": 1538585340, "voted_up": true, "votes_up": 33, "votes_funny": 1, "weighted_vote_score": "0.756307363510131836", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12393861": {"recommendationid": "12393861", "author": {"steamid": "76561198111353940", "num_games_owned": 87, "num_reviews": 5, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1412705286}, "language": "english", "review": "I told my gf horror games don't scare me. I screamed like a little girl.\n\n10/10 won't play again.", "timestamp_created": 1412636601, "timestamp_updated": 1412636601, "voted_up": true, "votes_up": 261, "votes_funny": 173, "weighted_vote_score": "0.812531173229217529", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19118195": {"recommendationid": "19118195", "author": {"steamid": "76561198080713218", "num_games_owned": 214, "num_reviews": 7, "playtime_forever": 6527, "playtime_last_two_weeks": 0, "last_played": 1478595360}, "language": "english", "review": "one of the best survival horror games to date", "timestamp_created": 1447701880, "timestamp_updated": 1447701880, "voted_up": true, "votes_up": 103, "votes_funny": 21, "weighted_vote_score": "0.816492021083831787", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27325591": {"recommendationid": "27325591", "author": {"steamid": "76561198128085739", "num_games_owned": 177, "num_reviews": 58, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1480120978}, "language": "english", "review": "The gameplay is great the graphics are really good, the story is really good too. You think you want to stop playing but you can't stop playing it. So you play it and play it until you beat it. Its pretty short around 3 or 5 hours. You wil S H I T your pants big time. Don't act like this game isn't scary it fucking is.", "timestamp_created": 1480023545, "timestamp_updated": 1480023545, "voted_up": true, "votes_up": 23, "votes_funny": 7, "weighted_vote_score": "0.704742968082427979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28565258": {"recommendationid": "28565258", "author": {"steamid": "76561198161141911", "num_games_owned": 341, "num_reviews": 327, "playtime_forever": 278, "playtime_last_two_weeks": 0, "last_played": 1482504500}, "language": "english", "review": "This is a very solid horror game. It has a cool setting and concept that gets you invested, the story however is very average and pretty forgettable which is a shame. I think the dlc of the game whistleblower does a good job of fleshing out the story and making it a bit more interesting.  I like the villans in the game like the doctor from the original or the husband from whistleblower, they added to the game and made it more memorable with some cool sequences.  I do think that whistleblower is overall slightly better than the original, it was just more fun to play through. I liked the level design more, it had a lot of disturbing scenes and I thought that the protagonist of the dlc went through a bigger struggle overall to survive than the main character did and by the end I was saying to myself ‘cmon just let the poor guy survive.\n\nI didn’t find the game very scary though for three main reasons \n1. The jumpscares never really got me, they just startled me and I got over it straight away and continued like nothing happened, I think the problem was they happen a bit too frequently without any build up and they were kind of predictable which is a shame.\n2. You can run from all your problems pretty easily, you run pretty fast in this game and you never get tired. If your always on the move you can easily avoid getting hit from the enemy, you only need to hide if you are trapped in a corner. I beat both the main game and the dlc pretty quickly because I was running through most of the game and most of the enemies without much trouble.\n3. I didn’t care if I died because there is no punishment for dieing, the checkpoints are very frequent so it was a never a big deal if I died because I would get put back right where I was and there is a big benefit to dying because the game recharges your battery for your camera when you spawn (on hard difficulty). So there were moments where my battery was low and I let the enemy kill me so I could get my battery recharged. \n\nOverall though I can’t deny that this is a good horror game because the core mechanics work and there are some genuinely good ideas put in the game that make it worth playing and I did have fun playing through it, I can definitely see why people find the game scary too. \n7/10 (Good)", "timestamp_created": 1482506488, "timestamp_updated": 1537601700, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.702613651752471924", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17210098": {"recommendationid": "17210098", "author": {"steamid": "76561198086336269", "num_games_owned": 114, "num_reviews": 11, "playtime_forever": 1465, "playtime_last_two_weeks": 0, "last_played": 1512107468}, "language": "english", "review": "Just a quick note before I begin. Half the reviews I read down here were just people saying that they played for like an hour before closing the game out of fear. I'm giving a legitimate review as someone who's had multiple playthroughs of Outlast, and about three fourths through Whistleblower. Alright, without further ado, here goes.\n\n\nBefore I got this game, I really, really wanted it. In fact ever since it was announced and released, I wanted it. It seemed legitimately scary and, overall, just a fun game. A few months ago for my birthday, my friend was kind enough to get it and Whisteblower for me together. Needless to say, I was overjoyed, installed and played the game immediately. I started a new game on Normal and began my playthrough. After finishing my first serious playthrough, I played through it again. Both times were a hell of a lot of fun, and some scares still get to me. I really did love this game, and I'm loving Whistleblower just as much.\n\nStories aside, you probably want the actual review. Fair enough and I'll give it to you.\n[h1]Pros[/h1]\n-Great, tense atmosphere\n-Amazing, immersive sound and music design\n-Enemy design is absolutely terrifying, character and model-wise, Eddie and Trager are prime examples\n-Full body awareness\n-Simplistic \"parkour\" system that lets you traverse the map in various ways to help hide and run from enemies\n-Player characters actually have implied personalities\n-Every character has their own unique personality that gives them their own charm\n-For the most part, you actually feel like you're in danger, and you feel compelled to run away from the danger and survive\nWith that said, for a first game, and just on its own, Outlast really, REALLY outdoes itself.\n\n[h1]Cons[/h1]\n-Cliched setting, and semi-cliched story, it's been done before, though I will give Red Barrels credit for making it work\n-Deus Ex Machinas, they're in abundance, I mean Miles and Waylon are LITERALLY the luckiest people on Earth\n-Trager could have used more of a role, for his character\n-The ending in Outlast was kind of a buzzkill, though Whistleblower makes up for it\nBased on your opinion, the cons can outweigh the pros or the pros can outweigh the cons. I went with the latter.\n\n[h1]Final verdict[/h1]\nNow, finally, the final verdict I give to Outlast. My final verdict is a 8.9/10. It would have scored higher, and may change, if I knew what else is to come of Whistleblower. Expect an update by that time, but this, for now, is my final verdict. I really loved Outlast, and I feel it's deserving of all the praise it got. Now we just have to wait for Outlast 2, yay!", "timestamp_created": 1437769984, "timestamp_updated": 1437769984, "voted_up": true, "votes_up": 46, "votes_funny": 3, "weighted_vote_score": "0.753144741058349609", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40424969": {"recommendationid": "40424969", "author": {"steamid": "76561198299493213", "num_games_owned": 119, "num_reviews": 21, "playtime_forever": 498, "playtime_last_two_weeks": 0, "last_played": 1528825806}, "language": "english", "review": "Pretty much the best Horror game that i have ever played,the story,gore,the setting...everything fits right in perfectly.\nPerfect amount of Jumpscares,nothing over exaggerated.(SPOILER ALERT)[spoiler]At first i thought that the plot is gonna be around a Cult that is going on in the Asylum but when i actually saw the Labs at the end, it really really really reminded of Resident Evil,the ending was on point to be honest.\t[/spoiler], i reccomend this game, if you still haven't played Outlast, give it a try you won't regret it.      10/10  Richard Trager is a B*tch", "timestamp_created": 1519682051, "timestamp_updated": 1519682051, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.714314103126525879", "comment_count": 4, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "13877965": {"recommendationid": "13877965", "author": {"steamid": "76561198025301599", "num_games_owned": 4606, "num_reviews": 121, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1420705247}, "language": "english", "review": "a scary and really tense horror game, there is no combat here so you have to run and hide all the time, which makes it even scarier. tense atmosphere, great story and amazing creepy sounds ( jump scares included too) that adds a lot to the experience. it takes around 5 hours to finish the main game.\n\nso is it worthy of a purchase ? i bet my smelly brown pants it is.\n\nEdit: i have just finished the WhistleBlower DLC, the gameplay is pretty much the same as the main game, but it adds a lot to the story as a prequel and it explains what happens after the ending of the main story. highly recommended for sure.", "timestamp_created": 1420632040, "timestamp_updated": 1420705506, "voted_up": true, "votes_up": 36, "votes_funny": 15, "weighted_vote_score": "0.732194364070892334", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23349815": {"recommendationid": "23349815", "author": {"steamid": "76561198006743284", "num_games_owned": 368, "num_reviews": 17, "playtime_forever": 1949, "playtime_last_two_weeks": 0, "last_played": 1526720500}, "language": "english", "review": "After several hours loving this game I decided to write down my personal thoughts about it. \n\nAfter installing Outlast and pressing the \"NEW GAME\" button the next few hours will be pure horror. \n\nStaying in front of \"Mount Massive Asylum\" is just WOW! You know that mood shortly before it begins to rain? Lighting flashes soft thunder sound mixed with a nice sunset and an old lantern waving in the wind. Controls are easy going and intuitive. Mount Massive asylum is huge. You visit several areas of the asylum where some can be a true pain in the ass when you run out of batteries. Oh yeah you are equipped with a camcorder that you can proof what you experience in Mount Massive. Every time you use \"night shot\" it is consuming battery power. The \"night shot\" replaces the flashlight in the game. \n\nI noticed weather changes during play through - so later in the game it rains cats and dogs. I loved the sometimes slow pace of the game  with lot of hiding in the dark e.g. where you have to get the three fuses - but maybe that´s just me TYLER :) There are fast paced parts alike where you have to run like hell to escape some baddies who just want one thing -  hunt you down! You quickly realize that you are the prey in this game - at the latest when you lose some fingers... \n\nAll in all the reason I played OUTLAST again and again was the cool asylum setting. If you´re a fan of movies like \"Grave Encounters\" this game could be right for you since Unreal Engine 3.5 does a great job offering you Mount Massive Asylum as a playground. I can nothing but recommend Outlast as it is a great thrillride through an typically 1950´s asylum.", "timestamp_created": 1464896164, "timestamp_updated": 1464896164, "voted_up": true, "votes_up": 63, "votes_funny": 5, "weighted_vote_score": "0.774383008480072021", "comment_count": 4, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37164854": {"recommendationid": "37164854", "author": {"steamid": "76561198047280176", "num_games_owned": 338, "num_reviews": 3, "playtime_forever": 429, "playtime_last_two_weeks": 0, "last_played": 1478625692}, "language": "english", "review": "Investigative reporters/journalists don't always have it even moderately easy. They are the soldiers for truth on the battlefront of deceit and cover-ups, and are occasionally sent on excursions nothing can quite prepare one for.\n\nPlayers step up to the role as Miles Upshur, a very ambitious self-employed investigative journalist who follows a lead from an anonymous source to the  Mount Massive Asylum, where an apparently dubious operation is being conducted by the unscrupulous Murkoff Corporation.\n\nWith the front entrance locked down and no security personnel to be found anywhere despite the presence of an unusual number of different law enforcement vehicles stationed in the front courtyard, it becomes quickly apparent that something is very askew. Still determined, Miles eventually makes his way into the building, only to stumble upon a horrific scene of mutilated and slaughtered members of one of Murkoff's own elite security teams.\n\nAnd so the freefall into a hellish gore fest with a nightmarish origin commences...\n\nAn illegal experiment headed by the Murkoff Corporation, dubbed 'Project Walrider', has been carried out on almost all patients at the Asylum, further damaging their mental state and making them physically stronger. As a result, many have degenerated even further into sickeningly sadistic and monstrously cruel Variants, byproducts of a malevolent entity at the heart of the project that would break even the darkest recesses of the primal mind. Some of them also have a great love for full nudity and the dark desires that accompany it.\n\nOutlast is first-person survival horror game which makes use of the [i]Amnesia[/i] series'  mechanic of providing the player with only a limited set of equipment and pickups to survive with, foregoing any form of fighting and instead focusing on a feeling of helplessness. Undoubtedly, despite many games in this day and age making use of similar mechanics with clear inspirations from some titles, some people would still draw a single line of comparison. \n\n[i]Outlast[/i] progresses with a very different premise, setting, and the utilization of some present day equipment. There is no health bar or health consumables, either. Miles can only take a set amount of hits which depends on the difficulty setting and the frequency of the attacks dealt to him. If one gets hit and evades the enemy for a brief time, the hit will be recovered from and the amount is reset. It also noticeably lacks a mental state mechanic no matter how long one spends in dark or light environments.\n\nAlong the way, details about patients and events come to light through collectible documents in set locations, as well as recordings from Miles' main equipment that one will use almost exclusively, a video camera with a night vision mode which needs batteries to function. Only night vision mode consumes battery power, however, prompting players to keep the camera rolling as often as possible to be their eyes and ears. Additional batteries can be found in many locations, though less spawn on the higher difficulty levels, and less can be kept on hand at a time.\n\nA strong emphasis is placed on a foreboding and eerie atmosphere which is often underlined with heavy breathing and fearful swallowing from the player's character. Occasionally, it's cranked up in intensity by means of jump scares and/or nerve-racking chase scenes with one of the many deranged patients of the Asylum or one of the particularly pronounced inmates such as the hulking Billy Walker, a recurring boss enemy that stalks the player up until the end of the game.\n\nThe visuals are pretty plain and simple, with an overall settings range from irregular lighting and flat textures to finer details on security badges and bodily scars on patients and the player character. \nAlong with the atmosphere and plot progression, the game's strength lies in its audio, with suitable sound effects like rain and thunder, and superb voice acting through boss characters like Dr Richard Trager.\n\nBesides the main campaign, the [i]Outlast: Whistleblower[/i] DLC includes a side story featuring a different player character - who so happens to be the employee that sent the email tip off to Miles - and takes place in different parts of the colossal Mount Massive Asylum in the same time frame as the main campaign. The DLC story might be shorter than the main one, but it is no less impactful and contains some disturbing scenes that dwarves even some that are present in the main game.\n\nLastly, to add a bit of a challenge to the survival horror element, the game features an Insane mode for both the main campaign and DLC. Players can only take two hits from patients and one from any boss before they die, forcing them to restart the entire run from the very beginning. Saving and checkpoints are also disabled.\n\n[i]Outlast[/i] is a grotesquely beautiful horror title with very few, if any, cons to it. It's a fresh entry in a sometimes oversaturated category that provides a unique sense of dread and disturbances in a deviously well-construed way.", "timestamp_created": 1511462321, "timestamp_updated": 1543054328, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.731722354888916016", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9123899": {"recommendationid": "9123899", "author": {"steamid": "76561198077786996", "num_games_owned": 620, "num_reviews": 51, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1455475866}, "language": "english", "review": "And this, my slipper-loving bozos, is why you never go to an abandoned mental asylum on your own in the middle of the night. \n\nIf you do, however, let me know how it went.", "timestamp_created": 1392484900, "timestamp_updated": 1489016613, "voted_up": true, "votes_up": 40, "votes_funny": 1, "weighted_vote_score": "0.722440242767333984", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13827869": {"recommendationid": "13827869", "author": {"steamid": "76561197969058643", "num_games_owned": 563, "num_reviews": 1, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1420318942}, "language": "english", "review": "Absolutely terrifying and intense from start to finish. You will feel nothing but fear and horror throughout the entire game, it's simply amazing. \n\nSo all my life I've been watching horror movies, read scary novels and what not. Figured Outlast wouldn't be that much of a difference, but it turns out [b]I was wrong[/b]. Outlast throws you into the depths of hell by the name of Mount Massive Asylum and really pushes you to the limit. As soon as you pick up the camera and sneak into the building you can feel the intensity rising. You're about to have an experience of a lifetime, in between running for your life, hiding under beds or just screaming like a little girl as you try to find a way out. \n\nThe story could have been a bit more polished. At times it was quite confusing what was really going on, could it be I had missed a file somewhere which could explain what just happened? But overall I found it more and more intriguing the deeper I went. The more files I picked up, the more characters I met. Every meeting with a new main character really messes with your mind. They're all twisted in their own little ways, ranging from wanting to cut you to pieces to stitch you back up, eating your flesh or just brutally ripping you apart for their own amusement. \n\nI greatly enjoyed the immersive atmosphere of the game. The distant lights you hoped to be safe, the creeping shadows you tried to hide in. It really felt like you were there, surviving for your own life whilst trying to figure out what really happened in the depths of the asylum. \n\n[h1]The Whistleblower DLC[/h1]\nIs definitely a great addition to the game, and it delivers horror in a different way. You're taking the role of Waylon Park, a software engineer who works for Murkoff who is also responsible for the e-mail which brought the reporter, Miles Upshur, to the asylum. Having a completely new perspective on what's going on it still delivered the same, if not more horror on top of an already extremely scary game.\n\nOverall the game gave me an amazing experience I'd recommend to anyone who would like a good scare and/or a great story to throw yourself into. However, keep in mind that it does contain quite vulgar language, gore and a lot of nudity.", "timestamp_created": 1420374594, "timestamp_updated": 1420374632, "voted_up": true, "votes_up": 35, "votes_funny": 0, "weighted_vote_score": "0.753443717956542969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34526850": {"recommendationid": "34526850", "author": {"steamid": "76561198112219396", "num_games_owned": 54, "num_reviews": 19, "playtime_forever": 1983, "playtime_last_two_weeks": 0, "last_played": 1509974933}, "language": "english", "review": "First i watched Youtubers play this game.\nThen i bought it because it looks so sick and really wanted to play it myself.\nAlready played this game twice. Gonna play for the third time soon.\n\nI just love the atmosphere, the visuals, gore, the feeling of being really defenseless and all i can do is hide and hope for the best.\n\nIf you still havent bought this and try out this game you're missing out big time. One of my top top games ever! 10/10\n\n UPDATE: I've finally managed to complete Insane Difficulty after like 12 attempts! Definitely gonna try and complete Insane mode for the 2nd time! I just like to suffer xD", "timestamp_created": 1503831662, "timestamp_updated": 1504860454, "voted_up": true, "votes_up": 26, "votes_funny": 4, "weighted_vote_score": "0.748928725719451904", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16584690": {"recommendationid": "16584690", "author": {"steamid": "76561198126382352", "num_games_owned": 99, "num_reviews": 10, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1468175897}, "language": "english", "review": "Starts game \"oh this isn't to bad\"\n10 minutes in \"so it's kinda scary\"\n30 minutes in \"screams like a little girl at a justin bieber concert\"\nDeletes game \nThrows pc into a lake \nMove to Mexico\nchanges name to Peto\n\n11/10 would do it again", "timestamp_created": 1434897151, "timestamp_updated": 1434897151, "voted_up": true, "votes_up": 547, "votes_funny": 1801, "weighted_vote_score": "0.804598033428192139", "comment_count": 28, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27130251": {"recommendationid": "27130251", "author": {"steamid": "76561198051978199", "num_games_owned": 640, "num_reviews": 1, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1401912477}, "language": "english", "review": "Outlast is terrifying, brutal and crazy. The story is clever enough to assemble all themes into a complete picture and tie it with some historical facts, but the most important thing is this: Outlast is really scary. Honestly, no game before has made me feel such strong emotions. Outlast is a must buy for all fans of scary stories. Amnesia: A Machine for Pigs is a fairy tale in comparison.", "timestamp_created": 1479988365, "timestamp_updated": 1479988365, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.663292169570922852", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47758861": {"recommendationid": "47758861", "author": {"steamid": "76561198272936933", "num_games_owned": 8, "num_reviews": 13, "playtime_forever": 4903, "playtime_last_two_weeks": 0, "last_played": 1547225219}, "language": "english", "review": "I totally recommend both Outlast and Outlast: Whistleblower to those who love to play survival/horror games like me. \n1 million of stars to Red Barrels!!", "timestamp_created": 1545599327, "timestamp_updated": 1545599327, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.686482071876525879", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "15816195": {"recommendationid": "15816195", "author": {"steamid": "76561198046210501", "num_games_owned": 81, "num_reviews": 47, "playtime_forever": 623, "playtime_last_two_weeks": 0, "last_played": 1474383131}, "language": "english", "review": "i had never seen a dong in a videogame", "timestamp_created": 1431547884, "timestamp_updated": 1431547884, "voted_up": true, "votes_up": 78, "votes_funny": 165, "weighted_vote_score": "0.795490384101867676", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "46164319": {"recommendationid": "46164319", "author": {"steamid": "76561198316705001", "num_games_owned": 167, "num_reviews": 5, "playtime_forever": 605, "playtime_last_two_weeks": 0, "last_played": 1530893761}, "language": "english", "review": "Very good game with perfect game play", "timestamp_created": 1542863370, "timestamp_updated": 1542863370, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.705345511436462402", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15504519": {"recommendationid": "15504519", "author": {"steamid": "76561197991393916", "num_games_owned": 439, "num_reviews": 29, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1428702629}, "language": "english", "review": "Pros:\n-Graphics\n-Atmosphere\n-Controls\n-No weapons\n-Terrifying\n\nCons:\n-I don't want to beat it\n-I don't want to play it\n-I don't want to be alive after playing it\n-I don't want to play it more than 10 minutes at a time\n-I don't want to be in a dark room while playing it\n-I don't want to have a full bladder while playing it\n-I don't want to be alone while playing it\n-I don't want to turn the sound on while playing it\n-I don't want to turn on the nightvision on my camcorder\n-I don't want to open that door quickly or slowly\n-I don't want to keep playing this game\n-I don't want to have any more nightmares\n-I don't want to sleep with the lights off\n-I don't want to sleep at nighttime\n-I don't want to leave my room again\n-I don't want to put down this knife\n-I don't want to open my closet\n\n-I don't want to play this game anymore\n\n10/10 would scream and jump back and hit my head on  my wall then fall forward and spill my hot chocolate on my crotch and then fall on the floor and grab my crotch and hit myself in the dick with my clenched fist because I was so scared then shitting my pants out of pain and vomiting because I shit my pants then my roommate walked in and said \"have you tried outlast yet?\"\n\nten. outa. ten.", "timestamp_created": 1429801971, "timestamp_updated": 1429802017, "voted_up": true, "votes_up": 77, "votes_funny": 266, "weighted_vote_score": "0.713968873023986816", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9036302": {"recommendationid": "9036302", "author": {"steamid": "76561198089640707", "num_games_owned": 58, "num_reviews": 4, "playtime_forever": 615, "playtime_last_two_weeks": 0, "last_played": 1391966442}, "language": "english", "review": "One of the best horror game ever played 10/10.", "timestamp_created": 1391978501, "timestamp_updated": 1391978501, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.760796844959259033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "47458943": {"recommendationid": "47458943", "author": {"steamid": "76561198322364446", "num_games_owned": 34, "num_reviews": 18, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1549714469}, "language": "english", "review": "Best horror game ever.\nGameplay/scene: https://www.youtube.com/watch?v=2ojrVUaBe_s&feature=youtu.be\n\n===[ ☼ Graphics: ]===\n☐ Potato\n☐ Really bad\n☐ Bad\n☐ OK\n☐ Good\n☑ Beautiful\n☐ Masterpiece\n\n===[ $ Price/quality: ]===\n☑ Full price\n☑ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Don't do it\n☐ Free\n\n===[ ☣ Requirments: ]===\n☐ 90' PC\n☐ Minimum\n☑ Medium\n☐ Fast\n☐ High end\n☐ NASA computer\n\n===[ ۞ Game time/length ]===\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☑ Long ( 12+ hours)\n☐ Endless\n\n===[ ♬ Story] ===\n☐ It doesn't have\n☐ Boring\n☐ Average\n☐ Good\n☑ Fantastic", "timestamp_created": 1544527387, "timestamp_updated": 1544542459, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.734397232532501221", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34518202": {"recommendationid": "34518202", "author": {"steamid": "76561198382937929", "num_games_owned": 39, "num_reviews": 6, "playtime_forever": 1350, "playtime_last_two_weeks": 0, "last_played": 1543273314}, "language": "english", "review": " During my horrific experience of playing both Outlast and Outlast:Whistleblower I had many frightful moments. I learned to always conserve your battery and check everywhere if it costs you a bit of time bu having an extra battery is worth it. Out of all the characters in the main game and the DLC I would say that Richard Trager, and Eddie Gluskin would be the most unique characters that stand out. They actually engage in conversation with Miles, Or Waylon and make the playthrough more enjoyable. However I'd like to state that when I tried to do the insane mode I would have liked for the checkpoint to begin after Father Martin's speech in the lobby after being thrown out by Chirch Walker. I suggest hiding when you need to, be quick on your feet, and always look in the rooms for documents. 8/10 Intact Fingers Agree.", "timestamp_created": 1503797128, "timestamp_updated": 1503797128, "voted_up": true, "votes_up": 46, "votes_funny": 5, "weighted_vote_score": "0.77614670991897583", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17614639": {"recommendationid": "17614639", "author": {"steamid": "76561198061355394", "num_games_owned": 929, "num_reviews": 18, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1526677566}, "language": "english", "review": "Someone was coming.\nLocker became my best friend.\nTried to be a hero and got out.\nNot a hero.\nGoes back to locker.\n10/10 Would change my pants again.", "timestamp_created": 1439991510, "timestamp_updated": 1440000165, "voted_up": true, "votes_up": 215, "votes_funny": 703, "weighted_vote_score": "0.785402119159698486", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "3625449": {"recommendationid": "3625449", "author": {"steamid": "76561198025357025", "num_games_owned": 1670, "num_reviews": 62, "playtime_forever": 509, "playtime_last_two_weeks": 0, "last_played": 1403397928}, "language": "english", "review": "Definitely not the scariest horror game ever, but scary enough to make you cry like a schoolgirl. Tense gameplay with both dynamic chases and thrilling stealth experience, atmospheric soundtrack, and story perfectly short for one dreadful evening.\nIt's dangerous to go alone, take your camera.", "timestamp_created": 1378447654, "timestamp_updated": 1385469160, "voted_up": true, "votes_up": 328, "votes_funny": 4, "weighted_vote_score": "0.804187774658203125", "comment_count": 24, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16372254": {"recommendationid": "16372254", "author": {"steamid": "76561198060172192", "num_games_owned": 526, "num_reviews": 26, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1471861231}, "language": "english", "review": "Not recommended for Heart Patients.", "timestamp_created": 1434239626, "timestamp_updated": 1434239626, "voted_up": true, "votes_up": 119, "votes_funny": 169, "weighted_vote_score": "0.772768199443817139", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28711518": {"recommendationid": "28711518", "author": {"steamid": "76561198177263258", "num_games_owned": 378, "num_reviews": 21, "playtime_forever": 3023, "playtime_last_two_weeks": 0, "last_played": 1494713301}, "language": "english", "review": "great idea lets buy this game what can go wrong?! i bet it wont scare me.\n\nnow im traumatized", "timestamp_created": 1482845046, "timestamp_updated": 1482845046, "voted_up": true, "votes_up": 61, "votes_funny": 36, "weighted_vote_score": "0.71904522180557251", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "43127393": {"recommendationid": "43127393", "author": {"steamid": "76561198123911256", "num_games_owned": 89, "num_reviews": 5, "playtime_forever": 603, "playtime_last_two_weeks": 1, "last_played": 1551212241}, "language": "english", "review": "I put the game on idle for 10hrs so people think that i wasn't scared to play the game.\n\n10/10 would idle again", "timestamp_created": 1530189013, "timestamp_updated": 1530189013, "voted_up": true, "votes_up": 32, "votes_funny": 122, "weighted_vote_score": "0.764478921890258789", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "1547317": {"recommendationid": "1547317", "author": {"steamid": "76561197994527992", "num_games_owned": 1850, "num_reviews": 113, "playtime_forever": 410, "playtime_last_two_weeks": 0, "last_played": 1387988652}, "language": "english", "review": "If Amnesia: The Dark Descent and the Penumbra games had a baby, that baby would be Outlast. This is classic survival horror - a creepy setting, no weapons, and no way to survive except to hide. You play as a journalist investigating an abandoned insane asylum, based on an anonymous tip of shady goings-on there. The only tool you have at your disposal is a video camera. The main hook of the game is using the camera's IR (night vision) mode to see just what the hell is going around you. It makes for some very effective moments of terror. Imagine knowing something scary and nasty is out there stalking you, but not being able to see what's 3 feet in front of you... yeah, that's the experience in a nutshell. Those moments are what makes this game effective. But unfortunately the whole game is not just those moments. Some parts I found to be somewhat tedious. For example, in one section, you have to explore an area to collect 3 fuses to restore power to something, all the while being stalked by crazy people. It's tense, to be sure, but also makes you realize that you're playing a game with a lame \"collect x things\" mechanic. It kind of brings you out of the experience a bit. The final section of the game is also sort of hit or miss, as it changes direction in a big way (reminds me sort of how Amnesia fell apart a little bit towards the end). But it's not necessarily bad... just different (I don't really want to get into spoilers at all), so it's one of those things where you might like it or you might not. But the majority of the game leading up to the end is pretty much consistently good. The environment is creepy as hell, the atmosphere is dark, and the \"enemies\" (mostly disfigured inmates) serve their purpose well. There are a few jump-scares, and the aforementioned fetch-quest sections where you're being chased, but mostly, the horror of the game comes from the combination of atmosphere and having to rely on a camera (whose batteries drain quickly when using IR) to be able to see. On the downside, you sort of get used to things after a while, so the scare factor wears off a bit towards the end. So it's ultimately a good thing that the game only lasts around 4-5 hours. Any more would have been too much. Despite the flaws, there's still lots of good things to experience here, so if you're a fan of this genre, you pretty much have to play this at some point. I think the price is probably fair, but if you can wait, it's definitely worth picking up in a sale. \n\nTechnical notes: I ran into a major bug towards the beginning of the game that prevented any further progress (it involves shaking the mouse during a quick-time event). The issue has supposedly been fixed in a patch, but it didn't work for me. There is a pinned post in the Steam discussions explaining how to work around this if it doesn't work for you either.", "timestamp_created": 1379255285, "timestamp_updated": 1379255285, "voted_up": true, "votes_up": 244, "votes_funny": 1, "weighted_vote_score": "0.808151781558990479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8894436": {"recommendationid": "8894436", "author": {"steamid": "76561197986992213", "num_games_owned": 2883, "num_reviews": 175, "playtime_forever": 1027, "playtime_last_two_weeks": 0, "last_played": 1484124146}, "language": "english", "review": "Outlast is a first-person survival horror game. As an investigative journalist you explore an abandoned mental asylum. There you will find yourself soon being hunted by some sick individuals who still wander its halls. \nMost of the time you will spend between heart pounding encounters exploring the hospital, trying to find clues to the mystery that landed you there in the first place. You will also spend most of that downtime dreading the next encounter because you never quite know when its going to hit you next.\nOutlast is a dark game. Without your handy camcorder and its nifty night vision display, you would not be able to play this game. Survival depends almost exclusively on managing your supply of camera batteries for fear of losing your ability to see. You must keep a close eye on your camera battery at all times and remain aware that the battery will drain faster if the night vision is turned on. The night vision effect itself is portrayed beautifully and really manages to capture the essense of a found footage film.\nCombat is not existent and emphasis is instead placed on trying to outsmart your attackers and hiding in moments of desperation. When you can not shake your attacker, the best option is to break line of sight and find a place to hide. As a result, the gameplay feels like a satisfying game of cat and mouse. Situations often boil down to a desparate run for survival that have you barreling over objects and looking back over your shoulder as crazed madmen pursue you.\nThe game looks fantastic and the sound design in Outlast is awesome. The sound is the glue that keeps the whole thing together. Everything from ambient noise to your own character's heightened breathing in moments of panic is excellent.\nOutlast is the best horror experience I have had in years. It is a must have for fans of the horror genre.\n\nSounds 10/10\nGraphics 9/10\nGameplay 9/10\nAtmosphere 10/10\n\n[b][u]Video of Whistleblower DLC playthrough:[/u][/b]\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=849443589\n\nIf you liked my review, please feel free to follow me and/or my curator group:\nhttp://steamcommunity.com/id/Ov3RT4K3R/myworkshopfiles/?section=guides\nhttp://steamcommunity.com/groups/orcollective#curation\n\nAlso feel free to check out my YouTube Channel: \nhttps://www.youtube.com/channel/UC83DYCmrWfl9ttrhX54jmWA", "timestamp_created": 1390953648, "timestamp_updated": 1489170852, "voted_up": true, "votes_up": 97, "votes_funny": 1, "weighted_vote_score": "0.792239785194396973", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38902721": {"recommendationid": "38902721", "author": {"steamid": "76561198726782247", "num_games_owned": 358, "num_reviews": 10, "playtime_forever": 273, "playtime_last_two_weeks": 0, "last_played": 1531447801}, "language": "english", "review": "-Bought the Game\n\n-Play it along \n\n-Panicked like a lil' girl \n\n-Hide in the locker for 1 hour\n\n-Out of the locker\n\n-Heard Something \n\n-Back in the locker\n\n-Accidently out of the locker when enemy subject near me\n\n-Alt + F4\n\n9/11", "timestamp_created": 1514729517, "timestamp_updated": 1514975476, "voted_up": true, "votes_up": 48, "votes_funny": 160, "weighted_vote_score": "0.739546120166778564", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35855498": {"recommendationid": "35855498", "author": {"steamid": "76561197969489829", "num_games_owned": 604, "num_reviews": 165, "playtime_forever": 208, "playtime_last_two_weeks": 0, "last_played": 1508466963}, "language": "english", "review": "Outlast is a game about a world champion marathon runner stuck in an Asylum with a very slack custodian code. \n\nYou play as Miles Upshur, a freelance journalist who apparently gave up on his dream as a Olympic runner. Miles gets a message from a whistleblower inside Mount Massive Asylum, saying that shit is whack and that you should probably check things out. So Miles, with no combat experience, no way to defend himself, and no back up whatsoever, decides to break into the Asylum and then run away from everything because hes the world's bravest coward. \n\nOutlast is a first person survival horror game that relies on stealth and escape to survive. There is no combat, so you spend most of your game either hiding or running from your attackers. You also have a camera, which works as both a way to unlock notes written by Miles, but also as your only way to navigate through the darkest parts of the game with the night vision feature. \n\nBatteries is something you have to be on the lookout for since Miles' camera eats them in the same pace and fury as I eat unmarked medication. \nI call them mystery skittles.\n\nThe game prides itself as a horror, but either I'm the bravest person to ever live or the game isn't really all that scary. I asked around with other people that played it and they didn't really get all that spooked either, it seems the only people who actually got scared of the game were Youtubers back in 2013. \n\nThe game seems to mistake startling jump scares and gore for horror, but because of that you at least get a really neat setting. Mount Massive Asylum's dreary and dark atmosphere gives the game a lot of life, ironic considered all the corpses.  But that being said, it isn't all that scary, it's more startling than anything.\nSurvival Startler. \n\nIt also doesn't help that Miles may as well be the Flash. He can outrun everyone from the giant hulk man to the naked knife brothers. He's also fairly good at sneaking, since you can avoid one of the big confrontations later on by just running back a bit and standing in the corner. Give this guy a knife and he'd probably give Sam Fisher a run for his money. \n\nThat being said, it's also rather short. It took me around three hours to get through, but that also included a break where I didn't turn off the game. If you know what you're doing you could probably get through this game in about an hour, give or take. But that includes skipping out on the collectibles. \n\nBut should you play Outlast? \n\nProbably wait for it to go on sale, if you didn't nab it that one time it was free. There's DLC for the game called 'Whistleblower' where you play as the guy who got Miles in that mess to begin with. But I don't know if that will get you your moneys worth. The atmosphere is neat and it can be fun to just completely tool on your attackers by outrunning them like I outrun the authority. \n\nBut do yourself a favor and maybe increase the difficulty a bit. It may give you that tension you needed, or it may just annoy you in the long run, I guess it depends on who you are. Just remember that there are better horror games for the same price.\n\nOutlast gets a no-spooky out of a spooky.\n\nFemale kangaroos have three vaginas. \n\n[url=http://steamcommunity.com/groups/Dickbuttexperience#curation] The Dickbutt asylum. [/url]", "timestamp_created": 1508473388, "timestamp_updated": 1508473388, "voted_up": true, "votes_up": 52, "votes_funny": 86, "weighted_vote_score": "0.773028969764709473", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "48021894": {"recommendationid": "48021894", "author": {"steamid": "76561198237709254", "num_games_owned": 75, "num_reviews": 11, "playtime_forever": 191, "playtime_last_two_weeks": 52, "last_played": 1551390036}, "language": "english", "review": "Why is Outlast so damn scary?\n\nFirst of all, batteries are quite limited and you can’t find them easily while exploring the locations. You know that you have to use your camera wisely and when you find yourself without batteries in a pitch dark room your heart pace increases drastically. Especially when you hear voices not too far from you.\n\nWhen you get spot by an enemy all you can do is run like hell and look asap for a hiding place where you have to stay as quieter as possible. The tension reaches its peak when, for example, you are hiding in a closet and through a slot you can see your enemy looking around for you, cursing you. Only thing you can do is hoping he is not going to open that closet. Even when the enemy leaves, you still hesitates to get out of your safe place.", "timestamp_created": 1546373018, "timestamp_updated": 1546373018, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.678362548351287842", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34713193": {"recommendationid": "34713193", "author": {"steamid": "76561198316600242", "num_games_owned": 103, "num_reviews": 2, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1506026922}, "language": "english", "review": "I thought I was a pretty tough guy until this game came along which made my heart skip a beat every minute of the half an hour or so I've put in to it hiding behind my chair. But, I will carry on! Reluctantly... Usually when playing first person games, I move around very quickly but in this I have slowed right down as I just don't know what to expect whenever I open a door. This is definitely not for the faint hearted of us out there. You have been warned...", "timestamp_created": 1504449043, "timestamp_updated": 1504449043, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.688149809837341309", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23738871": {"recommendationid": "23738871", "author": {"steamid": "76561198119702176", "num_games_owned": 116, "num_reviews": 13, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1466824581}, "language": "english", "review": "This game needs VR asap", "timestamp_created": 1466726965, "timestamp_updated": 1466726965, "voted_up": true, "votes_up": 27, "votes_funny": 7, "weighted_vote_score": "0.728549301624298096", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30866760": {"recommendationid": "30866760", "author": {"steamid": "76561198088198883", "num_games_owned": 234, "num_reviews": 7, "playtime_forever": 732, "playtime_last_two_weeks": 0, "last_played": 1497641526}, "language": "english", "review": "This is for sure the most HORRIFYING game I've ever played. It's very well paced and well thought out with levels that are clever and highly rely on your senses and your quick thinking to avoid death. This game will make you feel panic like youve never had before and its amazing. The atmosphere is so great and scary it perfectly fits the game and your camera's nightvision is also kinda creepy which I think they did great on. Its my favorite horror game and it worth a look if your into survival horror games with great atmosphere. Also, the characters/enemies encountered are worth noting to be well written and creative. The lore and backstory is excellent and I love this (somewhat short) game. I'd give it an 8/10.", "timestamp_created": 1491016584, "timestamp_updated": 1491016584, "voted_up": true, "votes_up": 19, "votes_funny": 2, "weighted_vote_score": "0.686042428016662598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29127023": {"recommendationid": "29127023", "author": {"steamid": "76561198101098896", "num_games_owned": 188, "num_reviews": 6, "playtime_forever": 992, "playtime_last_two_weeks": 0, "last_played": 1484922190}, "language": "english", "review": "Both Outlast the main game and Whistleblower (DLC) are excellent, and if you’re lucky, you’ll be able to get them as a bundle discount (especially with Outlast 2 coming out soon!). \n\nOutlast is more stretched out and does a great job at introducing you to the mechanics and world - and also giving you a heart attack! Whistleblower (DLC) feels more streamlined, succinct, and hence, may feel more intense and scarier because so much is packed into a short time. \n\nYou can’t go wrong. Both these titles deserve to be played to prepare you for the awesomeness that will be Outlast 2.", "timestamp_created": 1483910091, "timestamp_updated": 1483910091, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.7004128098487854", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23625673": {"recommendationid": "23625673", "author": {"steamid": "76561197972937889", "num_games_owned": 171, "num_reviews": 12, "playtime_forever": 846, "playtime_last_two_weeks": 0, "last_played": 1520889048}, "language": "english", "review": "This Game, if you can even call it that, has scarred me for life. The combination of music and graphics is just insane. In my opinion it is worse than watching Jaws at age 2 with John Williams at the helm. Playing it in the middle of the day was the only choice for me. I had people around me the entire time so I can not say I experienced it at its best. It kept my heart pounding and I kept looking past my monitors and down the hall the entire time. When you can not walk thru your own home without feeling afraid then the programmers did a great job. I would love to shake all of their hands and slap them at the same time.  I recommend this game 100% and then some.  Please buy it and try it for 20 minutes at least. It does not get easier, it never lets you relax and it certainly will not let you sleep again. Absolutely love it!  Bought the DLC right after finishing it and I am not sure my heart can take playing it now.  Good luck....", "timestamp_created": 1466221832, "timestamp_updated": 1466221832, "voted_up": true, "votes_up": 30, "votes_funny": 8, "weighted_vote_score": "0.76176297664642334", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48965052": {"recommendationid": "48965052", "author": {"steamid": "76561198110201818", "num_games_owned": 155, "num_reviews": 97, "playtime_forever": 342, "playtime_last_two_weeks": 0, "last_played": 1550048961}, "language": "english", "review": "€ PRICE / QUALITY\n\n☐\"IT'S A TRAP!\"(Admiral Ackbar)\n☐ \"That'll do, pig. That'll do.\"(James Cromwell)\n☑ \"SHUT UP AND TAKE MY MONEY!\"(Philip J. Fry)\n\nPC REQUIREMENTS\n\n☐Minimum\n☑Medium\n☐High\n☐ Extreme\n\nGRAPHICS\n\n☐Cheap\n☐Acceptable\n☑Masterpiece\n\nGAME TIME (hours)\n\n☐ 0>2\n☐ 2>5\n☑ 5>15\n☐ 15>30\n☐ 30>50 \n☐ 50>75\n☐ 75>100\n☐ 100>?\n\nSTORY\n\n☐ None\n☐Bad\n☐Good\n☑Amazing\n\nDIFFICULTY\n\n☑Simple\n☐Easy to learn, hard to master\n☐Hard\n☐Blackhole (FiolaSoft Studio)\n☐Impossible\n\nBUGS\n\n☐Game itself is one big BUG\n☐Bugs destroying the game\n☐Bugs\n☐Few little bugs\n☑Perfect", "timestamp_created": 1550049060, "timestamp_updated": 1550049117, "voted_up": true, "votes_up": 9, "votes_funny": 5, "weighted_vote_score": "0.577178418636322021", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "49126734": {"recommendationid": "49126734", "author": {"steamid": "76561198120559848", "num_games_owned": 115, "num_reviews": 7, "playtime_forever": 2062, "playtime_last_two_weeks": 34, "last_played": 1550758545}, "language": "english", "review": " Playing this game was an amazing experience! The story was filled to the brim with what seemed at first glance to be the most cliché theme in the horror genre, but as I progressed further into the story, everything changed. All of the key characters have their own backstory of why they ended up in the asylum. Their stories are mostly a dark past of crimes or losing their sanity, not gonna spoil more tho. The story can just suddenly escalate from 0% to 100% in a single area. You might be just running around the asylum, trying to find a way out and then you just magically pop up in an underground facility.\n The atmosphere and your helplessness just add up to the crapping-your-pants factor. If an enemy is chasing you, you have to find a place to hide or just outrun them if you can. This game also has a bunch of achievements, some are just story achievements some are extreme challenges for not the faint of heart (like the game itself). Seriously though, if you have heart problems don't play this game, it'll not be good for you. \n To sum it up: Great game, great story, butt cheek clenching, fun time if your friend is playing it and you're laughing as they're weeping in terror.\n10/10\nCpt. Sparg seal of approval", "timestamp_created": 1550694324, "timestamp_updated": 1550694324, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49303408": {"recommendationid": "49303408", "author": {"steamid": "76561198235844764", "num_games_owned": 82, "num_reviews": 6, "playtime_forever": 520, "playtime_last_two_weeks": 218, "last_played": 1551478872}, "language": "english", "review": "This game is amazing ! lots of jump scares tho. I would give this game 10/10", "timestamp_created": 1551479270, "timestamp_updated": 1551479270, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49075215": {"recommendationid": "49075215", "author": {"steamid": "76561198386104818", "num_games_owned": 81, "num_reviews": 10, "playtime_forever": 355, "playtime_last_two_weeks": 0, "last_played": 1550505130}, "language": "english", "review": "The best hide and seek simulator in the market.\n\nAnd it's scary as hell.", "timestamp_created": 1550505755, "timestamp_updated": 1550505755, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49356699": {"recommendationid": "49356699", "author": {"steamid": "76561198197663687", "num_games_owned": 243, "num_reviews": 185, "playtime_forever": 516, "playtime_last_two_weeks": 161, "last_played": 1551713380}, "language": "english", "review": "Player Bases.\n☐ Kids.\n☐ Everyone.\n☑ Mature.\n☐ Casual Players.\n☐ Pro players.\n\nGraphics.\n☐ Potato.\n☐ Really Bad.\n☐ Bad.\n☐ OK.\n☐ Good.\n☑ Beautiful.\n☐ Masterpiece.\n\nPrice.\n☑ Full Price.\n☐ Wait For Sale.\n☐ Refund It If You Can.\n☐ Don't Buy It.\n☐ Free.\n\nRequirements.\n☑ Minimum.\n☐ Medium.\n☐ Fast.\n☐ High End.\n☐ Super Computer.\n\nDifficulty.\n☑ Easy.\n☐ Medium.\n☐ Hard.\n☐ Very Hard.\n☐ Death March.\n☐ Dark Souls.\n\nGame length.\n☐ Really Short. ( 0 - 2 hours)\n☐ Short. ( 2 - 8 hours)\n☑ Medium. ( 8 - 16 hours)\n☐ Long. ( 16+ hours)\n☐ Endless.\n\nStory.\n☐ It Doesn't Have One.\n☐ Horrible.\n☐ Ok.\n☐ Average.\n☑ Good.\n☐ Fantastic.\n\nCinematic/Art.\n☐ It Doesn't Have.\n☐ Horrible.\n☐ Ok.\n☐ Average.\n☐ Good.\n☑ Like Watching A Movie.\n\nMusic/Sound.\n☐ Horrible.\n☐ Decent.\n☐ Average.\n☐ Good.\n☑ Amazing.\n\nGameplay.\n☐ Terrible. \n☐ Ok.\n☐ Average.\n☐ Good.\n☑ Fantastic.\n\nBugs.\n☐ Game Itself Is One Big BUG.\n☐ Game Breaking Bugs.\n☐ Lots of bugs.\n☐ Few Bugs.\n☑ Nothing.\n\nOthers.\nMultiplayer: ☐\nSingleplayer: ☑\n\nFinal Score:\n9/10\n\nHighly Recommended!", "timestamp_created": 1551714184, "timestamp_updated": 1551714184, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "48868348": {"recommendationid": "48868348", "author": {"steamid": "76561198414974468", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 451, "playtime_last_two_weeks": 0, "last_played": 1550300898}, "language": "english", "review": "The best horror game ever i've seen", "timestamp_created": 1549709120, "timestamp_updated": 1549709120, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48871464": {"recommendationid": "48871464", "author": {"steamid": "76561198801376811", "num_games_owned": 28, "num_reviews": 10, "playtime_forever": 1943, "playtime_last_two_weeks": 160, "last_played": 1551541319}, "language": "english", "review": "nice", "timestamp_created": 1549717088, "timestamp_updated": 1549717088, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48858098": {"recommendationid": "48858098", "author": {"steamid": "76561198204586475", "num_games_owned": 61, "num_reviews": 20, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1549775989}, "language": "english", "review": "Arguably the scariest and best horror game ever made. I not only love it for nostalgia purposes, but because of how exhilarating and terrifying the environment is. You're always holding on to your seat, preparing for the next scare.", "timestamp_created": 1549668520, "timestamp_updated": 1549668520, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49067404": {"recommendationid": "49067404", "author": {"steamid": "76561198054033312", "num_games_owned": 186, "num_reviews": 29, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1550398555}, "language": "english", "review": "Very good experience, interesting characters and dialogue, gameplay is smooth and an environment that is very appealing that builds the atmosphere well. [i]It is fun to run[/i]", "timestamp_created": 1550471172, "timestamp_updated": 1550471172, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517241418361663818", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "48859578": {"recommendationid": "48859578", "author": {"steamid": "76561198102077180", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 852, "playtime_last_two_weeks": 0, "last_played": 1549757449}, "language": "english", "review": "Okay legitimate review time.\nMy best friend got it for me in 2017 to play at the same time, but she never finished it. Yesterday I decided to try and finish it, and I'm glad I did. Its an amazing game, and because of how good it was, I bought the Whistleblower DLC and Outlast 2. Even 5 soon to be 6 years after its release, it's an amazing game to play. The controls are really good and the animation is great. The graphics were out of my expectations, and the placement is great.\n\nNot that many jumpscares is good, because out of the like.. 6 maybe 7 hours or so, I only remember 2 that got me. I forgot about the library one, and later on, around a corner, there was a lack of sound queues, so it was great, and sometimes it sounds like you're about to be chased only for nothing to be coming for you. \n\nSo it was an amazing game, and after playing a little of Outlast 2, the graphics are amazing and the gameplay so far looks promising, Whistleblower too. I can't even remember any of the cons, except for.. braindead enemies. \n\nAt  some point an enemy looked under the bed directly next to me and didn't see me so that  was an experience.\n\nOh and, I suggest not playing this game if you are on some high amounts of mentally unstable, this game probably will not fucking leave you. You will hear it in every song, and imagine yourself in the scenarios. I'm sure it goes away but like I would like to say that, just proceed into this game with caution.\n\n11/10 play this holy game", "timestamp_created": 1549675685, "timestamp_updated": 1550444369, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "49230513": {"recommendationid": "49230513", "author": {"steamid": "76561198800536283", "num_games_owned": 19, "num_reviews": 3, "playtime_forever": 188, "playtime_last_two_weeks": 188, "last_played": 1551895420}, "language": "english", "review": "Actually it works on 4GB of RAM, Intel Core 2 Duo 2Ghz and 512MB nVidia G102M Windows 10 32 Bit and it´s a really good game! But I have 20FPS", "timestamp_created": 1551104541, "timestamp_updated": 1551105182, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49014348": {"recommendationid": "49014348", "author": {"steamid": "76561197981808501", "num_games_owned": 220, "num_reviews": 10, "playtime_forever": 804, "playtime_last_two_weeks": 0, "last_played": 1472396588}, "language": "english", "review": "Absolute master piece. My favorite horror game of all time. I have so much respect for the developers nailing the atmosphere.", "timestamp_created": 1550259166, "timestamp_updated": 1550259166, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.516129076480865479", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48876094": {"recommendationid": "48876094", "author": {"steamid": "76561198214429753", "num_games_owned": 262, "num_reviews": 22, "playtime_forever": 101, "playtime_last_two_weeks": 85, "last_played": 1551708739}, "language": "english", "review": "1.Install the game\n2.Recommend this game\n3.uninstall the game", "timestamp_created": 1549727582, "timestamp_updated": 1549727582, "voted_up": true, "votes_up": 1, "votes_funny": 4, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48957027": {"recommendationid": "48957027", "author": {"steamid": "76561198843228055", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 1056, "playtime_last_two_weeks": 0, "last_played": 1546140736}, "language": "english", "review": "Absolutely one of the best games i've ever played. Truely terrifying, great atmosphere, fun gameplay, smart AI, intense cutscenes, and scary and interesting villains. Often times i go back to my favorite scenes with my friends and the dlc is just as good. This game bridged my interest in horror games and truely is one of my favorite games of all time.", "timestamp_created": 1550007369, "timestamp_updated": 1550007369, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "49236245": {"recommendationid": "49236245", "author": {"steamid": "76561198319104878", "num_games_owned": 96, "num_reviews": 35, "playtime_forever": 439, "playtime_last_two_weeks": 407, "last_played": 1551908051}, "language": "english", "review": "Me pone nervioso jaja asi es", "timestamp_created": 1551129257, "timestamp_updated": 1551129257, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497925341129302979", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49036992": {"recommendationid": "49036992", "author": {"steamid": "76561198337098422", "num_games_owned": 22, "num_reviews": 6, "playtime_forever": 787, "playtime_last_two_weeks": 199, "last_played": 1551624117}, "language": "english", "review": "Amazing survival horror game with an interesting plot and an overall \"pretty\" game design. If you're into horror and gore- or just craving a good ol' adrenaline rush, this is the right game for you. \n\n\n\nP.S: Walker's death was extremely satisfying to watch.\n", "timestamp_created": 1550344668, "timestamp_updated": 1550344668, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49133328": {"recommendationid": "49133328", "author": {"steamid": "76561198160801058", "num_games_owned": 54, "num_reviews": 40, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1511112297}, "language": "english", "review": "Stoopid bunch of jump scares, instead of a horror game.", "timestamp_created": 1550733956, "timestamp_updated": 1550733956, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.470948010683059692", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48988875": {"recommendationid": "48988875", "author": {"steamid": "76561198056909632", "num_games_owned": 67, "num_reviews": 2, "playtime_forever": 108, "playtime_last_two_weeks": 0, "last_played": 1550161536}, "language": "english", "review": "Nothing more than a collection of stereotypical horror mechanics. Use them if you're not creative, like developers of this game: \n\n- Darkness for the sake of darkness\n- Constant sense of vulnerability without any options (typical for cheapest horror games)\n- Gore (for no reason most of the times, so it looks silly and laughable)\n- Mysteriousness (they're trying so hard, but the plot still a cliche) \n\nCombine these stereotypes with boring gameplay and the overall lack of taste in art direction (enemies, decorations, level design, plot and atmosphere) and you get this overhyped game. It's hard to play it after something good - like Resident Evil 2 (Remake). \nOverlast feels like a cheap chinese mobile game - I'm glad I didn't pay for this.", "timestamp_created": 1550157427, "timestamp_updated": 1550157427, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.431497752666473389", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 19, "review_score": 9, "review_score_desc": "Overwhelmingly Positive", "total_positive": 17550, "total_negative": 828, "total_reviews": 18378}}
