{"reviews": {"49241756": {"recommendationid": "49241756", "author": {"steamid": "76561198082238823", "num_games_owned": 4, "num_reviews": 2, "playtime_forever": 5, "playtime_last_two_weeks": 5, "last_played": 1551164128}, "language": "english", "review": "[h1]The slow fall of a once great game.[/h1]\n\nI've played TERA since its launch in May 2012.  Overall, I have a lot of good memories with it.  \n\nI've played it almost non stop since 2012 right up until June 2018 with the Xigncode rootkit fiasco.  Enmasse basically introduced a dangerous and malicious malware rootkit into the game... which in turn caused a good 50% of the players to outright quit either out of fear of using the game with this security risk, or quitting because it caused large performance hits or system instabilities after they put it into the game.\n\nIt was around the end of 2018 they removed this Xigncode \"anticheat\" rootkit; but by this time, hundreds and hundreds of people had quit the game, moved onto other things.  In that time period they had to close all servers and merge them into just 1 pve and 1 pvp.\n\nI find this sad that Enmasse would do such a reckless thing to their own game and no only betray all the loyal players, but also ruin their game.  I can't see how this game will survive much longer.  All they seem to do is pander to the whales and offer RNG lootboxs, while the other players feel out of place in the game, with not much idea what to do since there is no trust left to be had in this game.  Its fairly hard to see myself spending money on it again.  Or at least not until they offer non RNG options in the store to buy things.\n\nThis is an example when a company won't admit they did something wrong until its too late.  They did stop the bleeding by removing Xigncode... by the damage done by introducing it may never be fixed.  This game became a bit of a cult classic over time but so many classic people have quit and its hard to know if they'd ever come back to the game in high enough numbers to bring the game back to life.\n\nYeah this first part wasn't really a review at all, more of a complaint about bad decisions that were made and that were completely avoidable.  Here's a list of some good and bad things I experienced with the game.\n\n[b]Good:[/b]\n[i]~ The games combat is fun.  \n~ Lots of classes, and yes some newer ones are race locked.\n~ The games got several races, some including thick Elins, slooty Castanics, loose Elves and derpy Humans.\n~ graphics hold up still, and performs alright when you are solo... but the game chugs as more players are in an area\n~ the game will run at virtually any resolution.  I run this game at ultrawide 21:9 2560x1080 and it looks great.  However, the wider you go, the more bottleneck that gets put onto the cpu due to the poor optimization of this game.\n~ the combat and other animations are very well done and I still like looking at them\n~ travelling around is very quick, you can use scrolls to travel to cities and towns instantly for a tiny cost\n~ sometimes game events will give you cosmetic items that would normally cost a good amount of money or be not even for sale, but these events are hit and miss and seem more rare now that Enmasse has gone full on greed mode.  These happened a lot more pre 2017.\n~ most game updates aren't too large\n~ the journal and quest layout and direction is easy to follow\n~ very few loading screens and large open world areas (except the odd placement of invisible walls which is awful)\n~ possible to grind gear up without grouping with most classes depending on if you get bored easily killing same mobs each day or not\n~ the UI is fairly customizable... but has been sorta ruined and nerfed a bit at the end of 2018 compared to vanilla UI... nerfed as in; they removed a lot of slots so you now have less areas you can keybind to.[/i]\n\n[b]Bad:[/b]\n[i]~ grindy\n~ the character creator and customization could be a bit better and its hard to make a unique character due to the limited options and restrictive sliders\n~ PVP isn't balanced, and like most MMO's, probably won't be.\n~ Battleground queues, and even most pve dungeon queues are extremely long these days because of the dying tiny population in the game\n~ P2W - from 2015, slowly store items kept getting added that started to make the game pay to win.  Launch 2012 to 2015, the game store was purely cosmetic, no items that gave you large advantages.  This can't be said now, you can gamble and get RNG lootboxes for powerful mounts that will give you a RNG buff that will make your damage much higher than someone without it\n~ RNG lootboxes\n~ Enmasse doesn't give good support compared to the early days where you could get one on one GM support for problems, now you have no direct contact with them and give very slow service if you have a problem.\n~ Leveling is a bit too fast, the speed of leveling was balanced in 2012-2013, but they accelerated it far too much and took away the fun of leveling up a new class, its just too fast now and you miss some entire areas of the game because you outlevel them too fast\n~ shrinking game population and eventually dead game if things don't improve\n~ ignorant publisher that ignores too many player suggestions and only interested in RNG lootboxes and not expanding player base\n~ bad performance, gets worse the more players in an area.  Not a gpu problem, its a cpu optimization problem\n~ I really dislike the chatbox font style they added a while ago, its too bold and harder to read than the old school font.  I'm not sure how to change it or if its possible even.\n~ invisible walls and too restrictive flight height limitations.  The invisible wall problem wasn't a problem until they added flight, then they mangled the open world areas with a ton of oddly placed invisible walls, killing a lot of exploration that did exist before flight.[/i]\n\n\nSo ya, thats it.  I was a bit harsh on Enmasse.  I actually played the game since 2012, and was never harassed by them and they just let me play the game.  But i care about the game and didn't like how they ran it into the ground.  In better hands, this game would have several times the population and be a much more fair place to spend your money on -  But this isn't the case; they charge you more for a cosmetic item in game than you would spend for a similar item in real life.  I've seen people spend hundreds of dollars on a virtual dyeable clothing item... in real life, you could buy the same item for 15-20 bucks.\n\nYou just don't get your moneys worth here, yeah its true... Enmasse has to pay the bills, but if you scare away too many people and just assume a handful of whales will pay out enough to keep you going... you are wrong.  Whales will leave if there aren't any other players in the game left for them to play with.  Non whales may be scum and trash in Enmasse's eyes, but we are filler and are still needed to keep the game alive.\n\nSo its like, Feb 2019 right now, just reinstalled the game since the Xigncode hell in June 2018, not sure if I can get back into things, hard to know if I can waste more time in here, I fear what other crazy stunts Enmasse will try to pull off in the future.  \n\nWith all this said, I do slightly recommend this game still if you have the time and bandwidth to test it out.  Its worth trying because there is a ton of classes to play in this game and they are fun to learn to play.  Its just too bad they scared away all the players back in June 2018.   If I had to rate this on a number scale, it'd be around a 5/10.  You have like a 50/50 chance to like it, and only if you can overlook the negatives.  In comparison, in 2012, I would have rated this a 8 or 9 out of 10.  Its fallen a lot since this time.... its not the mechanics of the combat either, that has improved, its the dead population and abusive sales practice from Enmasse that really is killing this game.\n\nWho knows, maybe some less greedy company will someday take over and turn things around.\n\n[i]***I don't play this game with Steam, I had to install it briefly in here to patch some files and decided to just toss up a quick review and thoughts of the current state of TERA.... But over the years, my playtime is in the millions of hours likely.  Maybe billions?[/i]", "timestamp_created": 1551164193, "timestamp_updated": 1551429319, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.696709692478179932", "comment_count": 6, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49056866": {"recommendationid": "49056866", "author": {"steamid": "76561198085565616", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 6376, "playtime_last_two_weeks": 0, "last_played": 1529463406}, "language": "english", "review": "I love this game, and would definitely have more hours on it than I do if it wasn't so PtW now. Before, upgrading your armor and grinding dungeons was totally doable, felt challenging, and few things felt very OP (except for Ninjas, sometimes). Now, grinding a week just to upgrade one thing to a level that I'm higher than now. Wish it wasn't so PtW.", "timestamp_created": 1550422759, "timestamp_updated": 1550422759, "voted_up": false, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.593685150146484375", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48900581": {"recommendationid": "48900581", "author": {"steamid": "76561198246928790", "num_games_owned": 17, "num_reviews": 4, "playtime_forever": 2342, "playtime_last_two_weeks": 0, "last_played": 1527012029}, "language": "english", "review": "good lolis.", "timestamp_created": 1549803928, "timestamp_updated": 1549803928, "voted_up": true, "votes_up": 15, "votes_funny": 14, "weighted_vote_score": "0.534110903739929199", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48879476": {"recommendationid": "48879476", "author": {"steamid": "76561197992468446", "num_games_owned": 45, "num_reviews": 3, "playtime_forever": 22084, "playtime_last_two_weeks": 0, "last_played": 1469901197}, "language": "english", "review": "Pretty solid MMO, the end game is an absolute grind fest and it can be especially toxic if you're 1. the tank, or 2. the healer who let the tank die. That being said, i absolutely enjoyed the world and the lively graphics.", "timestamp_created": 1549735479, "timestamp_updated": 1549735479, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525842607021331787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49198356": {"recommendationid": "49198356", "author": {"steamid": "76561198281484535", "num_games_owned": 4, "num_reviews": 2, "playtime_forever": 3466, "playtime_last_two_weeks": 3466, "last_played": 1551779584}, "language": "english", "review": "Love this Game, Superb graphics, excellent game play, runs very smoothly. Also love the fact you can use a gaming controller   to play the game, makes moving around and fighting so much easier.", "timestamp_created": 1550964057, "timestamp_updated": 1550964057, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49285812": {"recommendationid": "49285812", "author": {"steamid": "76561198140825884", "num_games_owned": 208, "num_reviews": 24, "playtime_forever": 7429, "playtime_last_two_weeks": 69, "last_played": 1551410305}, "language": "english", "review": "Played it for a long time back in the day. It's a good game, the gameplay feels fluid with a controller.", "timestamp_created": 1551392054, "timestamp_updated": 1551392054, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49272553": {"recommendationid": "49272553", "author": {"steamid": "76561198142746307", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 6233, "playtime_last_two_weeks": 0, "last_played": 1548720787}, "language": "english", "review": "Highly recommend TERA, very simple to learn for beginners, and is compatible with people that like harder MMORPG's.\nSpent a lot of time in the summer playing this game day after day just chillin, fun with friends.\n", "timestamp_created": 1551327588, "timestamp_updated": 1551327588, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49260858": {"recommendationid": "49260858", "author": {"steamid": "76561198119663771", "num_games_owned": 146, "num_reviews": 5, "playtime_forever": 6784, "playtime_last_two_weeks": 6784, "last_played": 1551849746}, "language": "english", "review": "Character design worth going to jail for.", "timestamp_created": 1551266291, "timestamp_updated": 1551266291, "voted_up": true, "votes_up": 1, "votes_funny": 5, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49202883": {"recommendationid": "49202883", "author": {"steamid": "76561198059489716", "num_games_owned": 108, "num_reviews": 1, "playtime_forever": 68, "playtime_last_two_weeks": 63, "last_played": 1551007282}, "language": "english", "review": "Can't even log in to the game. Never had this much trouble logging in to anything, even my bank account is easier to get into. Thumbs down \n\nLearn how to send verification codes, or better yet, just use my steam account!!!!!!!", "timestamp_created": 1550985837, "timestamp_updated": 1550985837, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.510019958019256592", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49055865": {"recommendationid": "49055865", "author": {"steamid": "76561198019333467", "num_games_owned": 268, "num_reviews": 36, "playtime_forever": 7484, "playtime_last_two_weeks": 0, "last_played": 1492385051}, "language": "english", "review": "It's pretty trash, Gotcha system with bad rng, cash shop that makes it feel PTW, mounts that are cool are hella expensive just like the clothes and pets.  Unfortunately like most Asian MMOS this is just a cash grab on a bad engine.", "timestamp_created": 1550419533, "timestamp_updated": 1550419533, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.50972449779510498", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49019804": {"recommendationid": "49019804", "author": {"steamid": "76561198012737043", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 21861, "playtime_last_two_weeks": 0, "last_played": 1550280947}, "language": "english", "review": "The game is free to play and it does rush you through to get to endgame as fast as possible but that is because of the horrid systems they have for gear progression especially the end game gears. Let me say this simply, if you are not investing money into lootboxes/premium items/Elite Status (like a fck ton of real money investment)  be prepared to spend a month or 2 of full time daily grind to upgrade just 1 piece of your equipment (if you are lucky that is lol cuz the upgrade system is also RNG based). if you enjoy the mindless grind for weeks and months on end and get rewarded by a slap in the face for not spending tons of money in this game (yes paying for character, bank and inventory slots still relegates you to third class citizen in this game) then this is the game for you ! When the community of this game said \"You pay to progress faster\" they literally mean it !", "timestamp_created": 1550281733, "timestamp_updated": 1550281733, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.493940144777297974", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49200913": {"recommendationid": "49200913", "author": {"steamid": "76561198108039794", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 1816, "playtime_last_two_weeks": 0, "last_played": 1510886449}, "language": "english", "review": "I played this game before there were any \"expansion classes\" back when being a founder meant something. The developers have completely sold out now. I used to have two characters on every server when the combined all the servers down to two they are now forcing me to delete all but 4 of my characters including all transferable gold and items. \nThere are better free games that don't waste my time and cheaper paid games I can get more from.", "timestamp_created": 1550976728, "timestamp_updated": 1550976728, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.50190126895904541", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49149672": {"recommendationid": "49149672", "author": {"steamid": "76561198318045455", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 279, "playtime_last_two_weeks": 0, "last_played": 1499291316}, "language": "english", "review": "TL;DR - Not beginner/New User Friendly\n\nOn other people's gameplay on this game, it looked neat! It's massive multiplayer, has character customization and free roam! Trying out the game for myself(cause its free, duh) I'm greeted with a boring prologue which is supposed to be the tutorial. After a tedious tutorial and an ego stroking prologue, I was off to the main hub(at least I think it was) and boy was I lost! There was little to no sense of direction on where things were and where to go next.  I eventually found out where to progress through the story on a whim and was back going through the bland story. I then decided to quit while I wasn't too deep and leave things where it is, almost 5 hours on this hand held thing and I can't do anything? I'm out.\n\nThe UI layout for the battle and inventory system is a mess. There's WAY too much slots on the screen, I don't know which is which.\nAs for quests, the usual MMORPG consists of going from point A to B, killing specific enemies, and as well obtaining specific items. On my 5 hourish playthough on this, one thing irked my when completing quests where it required you to kill a number amount of enemies. YOU have to be the FIRST one to strike the enemy in order for it to count. If someone else struck it first, well you'll have to find another enemy of the same title to complete the quest. If you do decide to join in when someone is already fighting the enemy, the quest WILL NOT COUNT, though you will still get drops.\n\nLook, if you somehow find enjoyment in this game then that's great! You found something that interests you within the game. Regardless this was my take on this maybe this will steer you away or you'll brush it off and still try it, be their guest.", "timestamp_created": 1550813286, "timestamp_updated": 1550813286, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49050140": {"recommendationid": "49050140", "author": {"steamid": "76561198137084658", "num_games_owned": 30, "num_reviews": 23, "playtime_forever": 1033, "playtime_last_two_weeks": 0, "last_played": 1509197407}, "language": "english", "review": "ok game", "timestamp_created": 1550400918, "timestamp_updated": 1550400918, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.5", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49112359": {"recommendationid": "49112359", "author": {"steamid": "76561198259981972", "num_games_owned": 43, "num_reviews": 2, "playtime_forever": 432, "playtime_last_two_weeks": 0, "last_played": 1533541036}, "language": "english", "review": "it gets boring", "timestamp_created": 1550633306, "timestamp_updated": 1550633306, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502074718475341797", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49203118": {"recommendationid": "49203118", "author": {"steamid": "76561198049656836", "num_games_owned": 63, "num_reviews": 1, "playtime_forever": 103, "playtime_last_two_weeks": 103, "last_played": 1550987420}, "language": "english", "review": "Am uninstalling this due to terrible support.\n\nUnable to even register for the game.\nthe account verification email is not sent as expected. When the support page is checked, it was suggested to wait 15 to 30 minutes and to check SPAM folders also. All unsuccessful.\nIronically, it also mentioned to contact support after 30 minutes..... unfortunately, this is not possible as to contact support you need a verification email to login.\n\nWhat a failure in support.", "timestamp_created": 1550986850, "timestamp_updated": 1550986850, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.491291284561157227", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49175428": {"recommendationid": "49175428", "author": {"steamid": "76561198104662760", "num_games_owned": 53, "num_reviews": 1, "playtime_forever": 281, "playtime_last_two_weeks": 0, "last_played": 1497577446}, "language": "english", "review": "TERA is terable", "timestamp_created": 1550903730, "timestamp_updated": 1550903730, "voted_up": false, "votes_up": 3, "votes_funny": 5, "weighted_vote_score": "0.501030921936035156", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48793341": {"recommendationid": "48793341", "author": {"steamid": "76561198032010057", "num_games_owned": 106, "num_reviews": 1, "playtime_forever": 456513, "playtime_last_two_weeks": 0, "last_played": 1543304402}, "language": "english", "review": "Haven’t played this game much but it looks pretty good.", "timestamp_created": 1549440275, "timestamp_updated": 1549440275, "voted_up": true, "votes_up": 8, "votes_funny": 69, "weighted_vote_score": "0.489755153656005859", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49128860": {"recommendationid": "49128860", "author": {"steamid": "76561197975543765", "num_games_owned": 154, "num_reviews": 3, "playtime_forever": 3681, "playtime_last_two_weeks": 318, "last_played": 1550788854}, "language": "english", "review": "Beginner level MMO. Good for children as a first try. Not difficult. A lot of hand holding. Simple in almost every important way. Pass if you have played any other MMO at all.", "timestamp_created": 1550706127, "timestamp_updated": 1550706127, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.464788734912872314", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49391746": {"recommendationid": "49391746", "author": {"steamid": "76561198311591102", "num_games_owned": 41, "num_reviews": 4, "playtime_forever": 3863, "playtime_last_two_weeks": 0, "last_played": 1537547145}, "language": "english", "review": "Dead game with no PvP (PvP is like the foundation of MMOs). Unless you enjoy fighting monster 24/7 this game isn't for you.", "timestamp_created": 1551864396, "timestamp_updated": 1551864396, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.449217915534973145", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48801170": {"recommendationid": "48801170", "author": {"steamid": "76561198010604607", "num_games_owned": 56, "num_reviews": 3, "playtime_forever": 54187, "playtime_last_two_weeks": 0, "last_played": 1549466203}, "language": "english", "review": "OH TERA you mean, the BR game wrote in english. That no one speak english, that is now full of pleb that doesnt know any dungeon mechanic. This game once was good, now its dead and trash", "timestamp_created": 1549466288, "timestamp_updated": 1549466288, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.42957797646522522", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "49377070": {"recommendationid": "49377070", "author": {"steamid": "76561198052817286", "num_games_owned": 98, "num_reviews": 13, "playtime_forever": 105, "playtime_last_two_weeks": 15, "last_played": 1551798552}, "language": "english", "review": "i cant uninstall this fast enough its garbage", "timestamp_created": 1551798531, "timestamp_updated": 1551798531, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.30083349347114563", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17129165": {"recommendationid": "17129165", "author": {"steamid": "76561198027069083", "num_games_owned": 275, "num_reviews": 2, "playtime_forever": 29929, "playtime_last_two_weeks": 0, "last_played": 1538890449}, "language": "english", "review": "Ah, where to begin with this game. I've been playing it for at least 2-3 weeks now, and as someone who wasted their life away on WoW for 4+ years straight, and who is very iffy and skeptical of \"F2P\" games, my experience has been enjoyable. Going to review the main parts of the game that I feel make it stand out from other F2P games.\n\n[b]Graphics and overall design[/b] - The game is visually stunning. No other way to describe it. The graphics, the scenery, the character design are all gorgeous as hell. The character creation/customization is also quite amazing and if you're like me you'll find yourself engrossed in making your characters for long periods of time. Granted, a lot of the armor designs are over-the-top and sexualized, but that goes for both the female and male armor. The male Castanic's armor designs are a fine example of that. But hey, everyone likes eyecandy right? And they even have some for the ladies!\n\n[b]Combat[/b] - The combat is super fun and engaging, as well as satisfying. You have to actually aim your abilities and a lot of the time it's while you're on the move. It can be a little weird to adjust to, at least it was for me (Again, I came from WoW), but it's very easy to pick up. Even as a tank, you have to watch the mobs your fighting and time your blocks properly. It's a lot different from other MMO's, where most of the time it's just target + hit your skill button. You get a lot of abilities you can use, but you can link them together via combos, where you can do your rotations in order via using your spacebar. Makes it a little easier if you get overwhelmed by all the stuff you have at your disposal.\n\n[b]F2P and Elite Status[/b] - The big part for me. TERA is a F2P game with an item shop and optional \"Elite\" status (AKA the subscription plan). When I started playing the game, and even later on, I never felt like I [i]needed[/i] to buy anything in the item shop to progress. Everything in the shop are cosmetic items and items for convenience. Certainly not \"pay-to-win\". This is what attracts me to the game the most. Granted, I did eventually start up a subscription, but that was because I enjoy the game just that much. You don't have any real advantages as an elite member from what I have seen, just convenience and a neat mount. Everything in the item shop can be bought through in-game currency via the player marketplace, including 30 and 60-day vouchers for elite status. So technically, you [i]don't even need to pay actual money[/i] for stuff in the item shop or for elite status if you decided to go that route. Overall the F2P system on this game is very fair and will not make your characters stronger and won't make you feel like you /have/ to buy things in the item shop in order to get anywhere. Item shops are usually the make-or-break for a lot of F2P games, and TERA has perfected it. \n\nI would definitely recommend this game if you want super engaging combat, beautiful graphics and character design, and a F2P system that doesn't make you feel forced to buy anything from the item shop. The leveling can be a bit of a grind after a point (It's a Korean MMO, after all), and sometimes the community can be a bit weird (Particularly about goats and Elins), but if you can tolerate those things then by all means give it a shot. You won't regret it!\n\n**EDIT** \n\nSo I have been getting a large influx of friend requests, which is okay and all as I enjoy meeting new people. However, if you are only adding me to ask about TERA or to try and play it with me, I would rather you didn't. You can find more than enough information on their website, and I'm more than happy to answer your questions in the comments below. I don't have as much time to dedicate to the game as I did when I made this review, so if you're looking to try and play it with me it will be difficult. Very sorry for this.", "timestamp_created": 1437334091, "timestamp_updated": 1450354297, "voted_up": true, "votes_up": 599, "votes_funny": 46, "weighted_vote_score": "0.952279388904571533", "comment_count": 16, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15750544": {"recommendationid": "15750544", "author": {"steamid": "76561198034621556", "num_games_owned": 87, "num_reviews": 15, "playtime_forever": 124058, "playtime_last_two_weeks": 0, "last_played": 1537689113}, "language": "english", "review": "*has around 400+ days total play time spread among 9 characters since July 2012*\n\nIt's okay.\nDressup simulator with some MMO elements, as expected of a Korean MMO.\n\n\nIn Depth version:\n\nHmm. Let's start with the big white elephant in the room. Is this pay to win? No, it's pay to convenience.\n\n[h1]Pay to Convenience[/h1]\nThe RL cash shop (EnMasse Store - EME Store) is generally costumes. Costumes, everywhere. There's also a premium \"Elite Status\" as well, which doubles your monster kill experience (not quests), quest gold and faction reputation/credit gains - the last one is especially useful. Sure, it sells certain things that will speed your ingame play along, but nothing you can't farm with relative ease. More on that in a moment, need to describe enchantment of gear in this game, which is generally why some games are labelled P2W.\n\nEnchantment system is divided into 2 types of materials - Alkahest and Feedstock. Alkahest is that magical glue, for lack of a better description, and feedstock is the fodder you throw onto the pile. It's straightforward until you have a +9 weapon - and while levelling that's all you need. Once you hit endgame, its time to go hard or be labelled a filthy casual. Most groups in the LFG chat channel will have a +12 DPS requirement, meaning your weapon has to be +12 or nuts to you. Now you need a couple more things - first, you need to Masterwork the item (done at roughly 5% rate through Masterwork Enigmatic Scrolls, 10% through Blessed Enigmatic Scrolls or 100% through Noble Enigmatic Scrolls. Last two are EME shop only.) then you need to use large amounts of masterwork level alkahest (Masterwork Alkahest/Extensive/Premium - note that premium is not 100% chance). You can either be insanely lucky, +12ing your entire item with no fails from +0 through to +12, or you can cry as you burn some 2,000 feedstock and ~600 alkahest on a single item. Not to mention the masterwork rate is obviously low. +12 is considered the MAINSTREAM mind you, especially if you only have a single character. From personal experience, could take a week or so to +12 a character's gear completely.\n\nSo back on that P2W thing - it's really not. I can't stress this enough. You can farm all that alkahest, MES and feedstock pretty fast. I get over 1,200 feedstock a day, and I'm not really farming it - it's a [u]BONUS[/u] for what I'm actually farming. Gold is easy to make and there's an ingame Trade Broker (or auction house or whatever you wanna call it) that lets people with too much RL money and too little time on their hands sell stuff to us poor folk with too much time on our hands. The market prices fluctuate wildly at times for some items (for example Noble Enigmatic Scrolls went from 25k to 15k in two nights) based on supply and demand. As a well established endgamer, I've got the ability to make around 30-50k on a big sale of crafted items through the broker at least once or twice a week. It takes a bit of time to get established, but its not THAT hard.\n\n[h1]Gameplay[/h1]\n\n*cough*\n\nThis isn't WoW. It sure as hell isn't Final Fantasy XIV ARR. There will be no standing still, tab targetted on a monster and mashing your \"1\" key repeatedly. At least, not if you want to live, not get kicked from a party and earn a reputation as trash. :'D\n\nYour character gains skills (and improves them) as you gain levels as well as Glyphs and Glyph Points. Glyphs augment your skills, improving an aspect or giving them entirely new effects. For example, a warrior could spend 5 glyph points to grant 25% chance for Rising Fury to reset (a critical glyph as a DPS build). Your glyph points are equivalent to (player level)-10 and you start getting them at level 20.\n\nYou may (should!) customize your gear with crystals. Your weapons can have stuff like increased critical chance while your armor can bear more health or reduced monster damage. Your gear will also have rolls (\"stats\" in TERA parlance) that affect its performance, similar to crystals. Unlike crystals, you can reroll these stats to suit your tastes. Crystals aren't permanent or item bound, so at least you can move them around.\n\nYour equipment varies based on class. There are 4 Plate users, 4 Leather users and 3 Cloth users.\nLancer - Plate, Tank Class.\nBrawler - Plate, Tank Class.\nBerserker - Plate, Burst DPS class. Can tank at 65.\nGunner - Plate, Sustained Ranged DPS class.\nArcher - Leather, Burst Ranged DPS class. Game considers it sustained - it's not.\nReaper - Leather, Hybrid DPS class. BEST PvE DPS, PvP focused class. [SPC]\nSlayer - Leather, Sustained Melee DPS class.\nWarrior - Leather, Sustained Melee DPS class OR Tank class.*\nSorcerer - Cloth, Burst Ranged DPS class. CAN be sustained with the right setup.\nPriest - Cloth, Burst Healer class. Poor support.\nMystic - Cloth, Healer** class. Excellent support.\n\n\n[SPC] Reaper starts at lvl 50 but requires an existing lvl 40 to roll.\n*Despite its learning curve, the warrior is potentially a MUCH better tank than Lancer. I have no issues surviving anything PvE related to Warrior that my lancer may have issues with. The amount of iframes (invulnerability frames - split seconds where you are invincible due to skill use) the warrior has more than makes up for the slightly reduced armor.\n**Mystic isnt as powerful as a priest in terms of healing. Instead it's significantly more mobile and bears a lot of support abilities such as crowd control skills and superb MP restoration. Auras and Thralls are also fun.\n\n[u]PvE[/u]\nIt's not as hard as it used to be, not by a long shot. Hasn't been hard for years to be honest. Previously, one wrong step in a Hardmode dungeon would result in you dying horribly (or amusingly, depending on what you just did n_n) but now it's...forgiving? I don't know if that's the right word. The dungeons and bosses before had tons of mechanics which you had to do specifically (check out Manaya's Core Hardmode on youtube) but now...it's like the developers got lazy. The fights are really heavily gear dependant. Previously I'd tank hardmodes with gear from the previous expansion block. Now, trying to do that gets me killed pretty damn quickly. It's a joke to be honest. Not to say it doesn't have its moments, but it simply lacks the flair and difficulty it had 2 years ago in the favor of less mechanics, more gear dependancy.\n\n[u]PvP[/u]\nOh, this is amusing. Until you get to endgame, expect to be turned into - to quote the Bloody Mess perk of the Fallout franchise - an eyeball strewn, gut-ridden paste. Fun! There's only one difference between PvP and PvE servers - open world PvP. On PvP servers, gamers looking to get an epeen extention will happily camp lowbie areas, making your lives hell until you figure out how to change from Channel 1 to Channel Anything-but-1.\n\nSo. PvP. There's a number of Battlegrounds available (instanced PvP dungeons) with the majority being available ONLY to endgamers - and thank god for that. Remember glyphs from earlier? Missing the higher level skills, crystals and glyphs means that for the lowbie BG (Corsair's Stronghold), an endgamer will turn you into an eyeball strewn-...you get the point.\n\n[h1]End Note[/h1]\nThere's only so much I can cram into this steam review panel. For more in-depth stuff, refer to a guide or poke my characters on Tempest Reach. My most well known has my Steam account named after it. *points at name*\n\nRandom fact: High ping (e.g. Australia, like me) is okay for anything (tanking, pvp, healing) in this game. You'll still get steamrolled by pro pvpers with 20ms ping though, but those are few and far between.\n\nPS: Forgot to put this in the initial review; EnMasse Entertainment is great support, really friendly bunch. They actually READ your support tickets instead of seeing keywords and copy-pasting a premade reply like most companies and will happily fix your mistakes (oops, discarded/sold a ring I was actually using! D:) if you ask them.", "timestamp_created": 1431151079, "timestamp_updated": 1455546627, "voted_up": true, "votes_up": 1240, "votes_funny": 204, "weighted_vote_score": "0.935517668724060059", "comment_count": 53, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43652305": {"recommendationid": "43652305", "author": {"steamid": "76561198269015840", "num_games_owned": 7, "num_reviews": 2, "playtime_forever": 2068, "playtime_last_two_weeks": 0, "last_played": 1532132426}, "language": "english", "review": "Xigncode they use for anti-cheat is malware that logs all programs and files you used in the last 48 hours and sends them to god knows where. Complete invasion of privacy, disgusting.", "timestamp_created": 1532132531, "timestamp_updated": 1532132531, "voted_up": false, "votes_up": 236, "votes_funny": 19, "weighted_vote_score": "0.912923932075500488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38678339": {"recommendationid": "38678339", "author": {"steamid": "76561198066178712", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 22154, "playtime_last_two_weeks": 133, "last_played": 1551566351}, "language": "english", "review": "As someone who has been playing TERA for the past four to five years, I can tell you a lot of things about the game. I'm played all of the classes, but have just stuck with only a handful, so my views may be slightly biased.\n\nBut long story short: you want to kill time? Here's an option.\n\nAnyways, here's my long summary of TERA which will have a TL;DR at the end for you guys that don't care.\n\nTERA's mechanics are relatively okay, although the option to link attacks just makes it so that people rarely have to move their hand to press the actual attack buttons themselves. It's just hitting space bar multiple times, while your character does some fancy-smancy attacks, that look oh-so-difficult to use to non-TERA players. (HAH.) Battle tends to differ, obviously, from class to class, but for the most part, it's relatively fluid. (Although, sometimes little incidents will occur and it's usually gracefully hiliarious.) Honestly though, if you're new to games such as these, TERA is actually easy to pick up and even with the recent nerf patches, it's also very forgiving.\n\nSpeaking of which, TERA can easily be played solo, never ever joining a guild, or in a group. Either way, you're pretty much set—until you get to level 65, which is the current level cap. Unfortunately, one of the larger quests is to complete a very big raid where 100 players have to kill 4 dragons, all at the same time or they will be re-set. Because of the large amount of players, it's almost absolutely necessary for players to join an active and medium-sized guild to complete this. Not only that, there is obviously certain equipment that one needs to join these raids. Even with those in guilds, you have to have this equipment, which can be crafted through drops of other other level 65 dungeons. (Mainly from Lilith's Keep, the worst dungeon to ever exist. If you like constantly dying, this dungeon is the one for you. I hate it, mainly because I've gotten stuck in that one for a few hours after our only healer decided to ditch.)\n\nContinuing on: dungeons. Dungeons actually happen to be my favorite part of TERA, mainly because you have a chance to party up with a random set of other people of varying classes to clean out a dungeon. Dungeon queue times tend to range from a minute to about twenty minutes, depending on the difficulty and level of the dungeons, which isn't half bad, although it is annoying to wait around for that long. You're also free to solo dungeons. Dungeons also happen to be split between raids and dungeons. Raids, although there's only I believe two of them (possibly three; I don't really know that part ha), which basically means there's more people and a slightly longer dungeon. A bit of an excitement in somewhat of a meh game.\n\nWith TERA's lore, the only thing I can say about it is: horrible. If you're looking for some more in-depth and less cheesy, TERA isn't the thing for you. Honest to god, they've spiced it up and changed the beginning portions throughout the years, but it's just simply boring. The tutorial is okay, but personally, only when you near the level-cap is where things become a little bit more interesting and even that just gets eh. Definitely not a game for those lore lovers, unless you like cheese. It's pretty dang cheesy.\n\nWhich brings me to grinding. TERA grinding isn't half-bad when you're simply following the quests. There's a few areas that make me want to stab something in pure frustration, but past that, not bad at all. Dungeons, on the other hand, can be an incredible pain. In some of the dungeons, there are in-dungeon quests that you must complete to continue the storyline. Fun Fact: Dungeon monsters are extremely difficult to kill. Another Fun Fact: Your party members that you randomly joined probably have already completed or are ignoring the story quests. Have fun solo-ing that quest and dying multiple times, getting completely ignored by your party members! (You'll usually have to start the quest immediately as you get into the room.) On the other hand, grinding for items is just. No. No thank you. If you've managed to save up quite a bit of gold by selling and brokering (selling to other players) and doing quests, then that part may help you a little bit in getting the items necessary for crafting. But mainly, crafting items have to be earned through quests and occasionally, it just takes too dang long to grind for certain crafting items which will push people to use the cash shop. Even then, though, it may not sometimes be guranteed that you'll get the crafting item.\n\nAnd with the cash shop comes the fun extras. With TERA, it only seems to hover around that point of ALMOST pay to win once you've hit the level cap. (Grinding is still an option.) If anything, you can still get certain things like clothing skins and crafting materials through in-game drops or fashion coupons. (Fashion coupons are also drops that have recently become slightly more difficult to get. But they tend to be dropped from larger monsters.) It's not too bad.\n\nAnother thing that's a bit interesting about TERA, since recent patches, they've attempted to balance out most of the classes and they did pretty well. (We're going to ignore the whole race issue. Come on. No one can lie about that. Elins are top dogs, sorry, it's horrid, I know.) They took away some abilities that I'm going to miss, re-organized when you get each ability, and etc. Before that, ninjas were extremely over-powered, with them easily carrying dungeon parties and cleaning house under 10 minutes, alongside gunners as well. Now, it's a bit more grindy and all classes seem to push out less damage, which is fine by me. Although there's some issues I have with these nerfs, for the most part (and most classes), it isn't half-bad.\n\nTERA graphics. What...are graphics? Ha. TERA is run on an older engine, which not only makes the loading in slow, but causes FPS to either remain low or jump around. The visuals in some areas, though, are gorgeous. My personal favorite actually happens to be Heartwood. For the most part, a little bit on the dry side. However, if my old toaster laptop can run TERA, then for all of you fellow toasters out there, here's a game to look at!\n\nAnd with that comes bugs and glitches. Sometimes, you can get stuck in certain parts of the map that are absoutely freaking ridiculous. One can usually unstick themselves with ease, but there is an official Unstuck button available to those that are utterly stuck. Yes, I know getting stuck in certain items is a common thing, but the reason I mention it here is that it can actually get you killed if you get stuck in certain areas and getting stuck in certain areas of the map is a constant. Not only that, there seem to be more bugs popping up throughout the game. Monsters will not return to their positions after they've been out of their zone for too long, certain monsters won't properly trigger, monsters that you've triggered on different floors will suddenly pop out of no where in your face, and not to mention the dreaded elevators that if you don't get on right, you'll literally fall through the floor and to your death. I do think this is because the lack of attention En Masse has been giving to TERA and Bluehole...? I'm not sure what they're doing anymore. (En Masse is currently working on two other games. One that recently came out, while the other's open beta has just begun.)\n\nIn my own personal opinion, I do think TERA will come to an end in the next two years or so, or maybe hang on for a little bit longer due to the small but very active fanbase. So play while you can but don't get seriously into it.\n\nTL;DR\n+ Relatively Easy to Pick Up Gameplay\n+ Plenty of content to do or re-do\n+ Still plenty to do before the paywall\n+ Solo or Party\n+ Classes all different\n\n- Graphics/Old Game Engine\n- Lore\n- Gender/Race Walls\n- Bugs, Glitches\n- Maybe ending soon\n\nCONCLUSION: You want to waste time? Sure. You in for the long haul? No.", "timestamp_created": 1514249015, "timestamp_updated": 1514249015, "voted_up": true, "votes_up": 53, "votes_funny": 0, "weighted_vote_score": "0.84612959623336792", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45031297": {"recommendationid": "45031297", "author": {"steamid": "76561198044251993", "num_games_owned": 148, "num_reviews": 1, "playtime_forever": 273911, "playtime_last_two_weeks": 0, "last_played": 1549123609}, "language": "english", "review": "I have 4000hrs in this game. I may not have witnessed the rise but I am witness to the fall. Avoid this game at all cost. They have injected Xigncode into their game to stop hackers, which didn't stop the hackers and it's malware that is against the law in the EU. Xigncode is against privacy laws in the EU. This company has pushed away it's members, and would not listen to the pleas of its people when they protested Xigncode. The community warned them that it did nothing to stop hackers. They lost a good number of their player base due to their disregard. They recently merged the servers to hide their dwindling player base. Recently Enmasse has gone to the extremes of shuting down a community that kept their game alive, that gave stability to many people due to their unoptimization. If you want to play this game download it from the EU site. Play on the EU Servers, they do not have xigncode. I have made many friends on this game, made many memories and it's sadden me to witness their actions over the past 48hrs. I repeat if you want to play this game download from the EU Site DO NOT SUPPORT NORTH AMERICAN SERVERS.", "timestamp_created": 1538349993, "timestamp_updated": 1538349993, "voted_up": false, "votes_up": 119, "votes_funny": 12, "weighted_vote_score": "0.885174870491027832", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15894341": {"recommendationid": "15894341", "author": {"steamid": "76561198132002173", "num_games_owned": 1665, "num_reviews": 17, "playtime_forever": 48683, "playtime_last_two_weeks": 0, "last_played": 1461625035}, "language": "english", "review": "yes", "timestamp_created": 1432002600, "timestamp_updated": 1462140305, "voted_up": true, "votes_up": 830, "votes_funny": 107, "weighted_vote_score": "0.911062419414520264", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16571569": {"recommendationid": "16571569", "author": {"steamid": "76561198021651894", "num_games_owned": 179, "num_reviews": 9, "playtime_forever": 167482, "playtime_last_two_weeks": 0, "last_played": 1541205755}, "language": "english", "review": "Best F2P model I've ever seen. Absolutely gorgeous graphics and art design. Combat is much more satisfying than any MMO I've played. Great fun classes.\n\nThe whole Elin obsession thing is still pretty weird to me but to each his own since I do love playing badass female characters, I just don't see what the Elin appeal is, I think the majority of it is players just want to have a badass cutsy character.\n\nThe story to me is pretty bad but I've been somewhat spoiled coming from SWtOR where they actuall tell you the story. Characters that seem important seem to pop up out of nowhere and there is little in the way of character development. Although when you get into the overall story of fighting the war it is pretty cool but smaller side things are confusing, cutscenes are LESS than mediocre.\nMissions and quest are equally bad, 90% kill fetch quests, although the kill quests are somewhat offset by the combat being so much fun. Crafting is overly complicated, tedious, time consuming and boring, you literally cant do ANYTHING while crafting but stare at your screen, may as well alt tab out for about 10 minutes. however again this is offset somewhat by the fact that you can craft end-game gear and make VERY good money from crafting.\n\nThe subscription model is just OK, could be a ton better but it definately has it's perks especially during leveling.\nI haven't really run into a great number of toxic players and most times I've been matched in a dungeon players have been polite and helpful, the general chat is of couse garbage, haven't been in an MMO yet where it hasen't been, but this  is typically a small percentage of morons who have nothing better to do than spit vomit in chat, the people actually playing the game don't bother.\n\nConstant news and stream from the publisher and the devs seem ok at keeping up with the community, not 100% but better than some games I've played.\n\nAll said and done I'd give it a 8/10 fun game and awesome to look at, great combat. Some tedious things in the game that seem they could be easily improved on though.\n", "timestamp_created": 1434856092, "timestamp_updated": 1434856092, "voted_up": true, "votes_up": 226, "votes_funny": 13, "weighted_vote_score": "0.893158257007598877", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43912335": {"recommendationid": "43912335", "author": {"steamid": "76561198271884883", "num_games_owned": 103, "num_reviews": 15, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1472647317}, "language": "english", "review": "Deploys XIGNCode malware on your computer. More information found here https://www.reddit.com/r/TeraPC/comments/8ot680/psa_upcoming_tera_na_patch_files_not_yet_deployed/ and confirmed by the Tera devs themselves here (in a thread where they deleted everyone's comments) https://forums.enmasse.com/tera/discussion/27159/xigncode3-and-tera-pc/\n\nDon't let game devs get away with this disgusting behavior. You have a right to privacy that companies are constantly trying to deny you. Stay informed.", "timestamp_created": 1533313284, "timestamp_updated": 1533313284, "voted_up": false, "votes_up": 212, "votes_funny": 15, "weighted_vote_score": "0.90215688943862915", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15786293": {"recommendationid": "15786293", "author": {"steamid": "76561198003959610", "num_games_owned": 176, "num_reviews": 23, "playtime_forever": 3676, "playtime_last_two_weeks": 0, "last_played": 1432646643}, "language": "english", "review": "Aesthetically an  archetype Korean MMO. Technically a quite innovative MMO escaping the \"tab and click combat\".\n\nPROS:\n- Addicting combat system (the main sellign point of this game)\n- Beautiful world\n- Streamlined but still complex gameplay, fun for both casual and hc gaming\n- Cash shop is purely cosmetics\n\nCONS:\n- Not for you if you don't like the K-styled games (perfect lean elven bodies, sexualized armor designs, over the top badass muscular males, lolis, pugs and pandas, etc)\n- The community grew into something weird with Steam release and FTP model (spam chat, not much RPing)\n- Questing is boring and doesn't make use of the awesome world design, you click through quests without reading much into the lore (which is surprisingly dark and interesting if you actually invest time to get into it)\n\nSUM:\nI would recommend trying this game if you like MMOs and want to try something new. Definitely recommended for Monster Hunter or even Dark Souls players, the combat system is so fun. The main thing to get over are the aesthetics. It's not for everyone.\nMy personal opinion is that if the design wasn't so over the top, the combat wouldn't be so flashy and fun.", "timestamp_created": 1431346841, "timestamp_updated": 1431346896, "voted_up": true, "votes_up": 245, "votes_funny": 15, "weighted_vote_score": "0.925059735774993896", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15705002": {"recommendationid": "15705002", "author": {"steamid": "76561198002872566", "num_games_owned": 195, "num_reviews": 2, "playtime_forever": 665561, "playtime_last_two_weeks": 0, "last_played": 1492407028}, "language": "english", "review": "Tera was released in May 2012, and it went Free To Play in February 2013.\n\nThe game has stood the test of time, and still has a decent-sized, dedicated player base. It is also frequented by many players who MMO hop looking for anything free to entertain them. That's what I used to do, until Tera got me hooked.\n\nTera initially had 8 classes, and has since added two new classes, and had an official expansion (Fate of Arun) on top of multiple content updates (Fane of Kaprima, Wonderholme, Wounded World, etc.)\n\nThe biggest strength of Tera and what sets it apart from other MMOs is its action combat.  There's no tab-targeting here, most skills require you to understand their hitboxes in order to land (the exception being some lock-on skills). Every class has a reticle in the middle of your screen so you know where you are aiming.\n\nTera runs in Unreal Engine 3, but the developers did a fantastic job to create the vibrant fantasy world of Arborea. The first time I entered Heartwood around level 40, it totally blew me away with how beautiful it was.\n\nThe developer of Tera, Bluehole Studios, is based in South Korea - and Tera is distributed with many publishers around the world. However, for this version of Tera (NA Tera), one of the best parts about Tera is the publisher, En Masse Entertainment. They do a good job of listening to the feedback of their players and adjusting the game to keep everything as balanced as possible.\n\nA lot of current players get asked the question \"It Tera worth it? Is it worth my time having already been released for so long?\" I highly recommend everyone spend a little time playing Tera, it is worth your time.\n\n[edit to fix typo - Fane of Kaprima]", "timestamp_created": 1430862339, "timestamp_updated": 1430886710, "voted_up": true, "votes_up": 554, "votes_funny": 40, "weighted_vote_score": "0.903207659721374512", "comment_count": 40, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15962849": {"recommendationid": "15962849", "author": {"steamid": "76561197960568825", "num_games_owned": 193, "num_reviews": 6, "playtime_forever": 14807, "playtime_last_two_weeks": 0, "last_played": 1441570721}, "language": "english", "review": "TERA is:\n    NOT Pay2Win\n    NOT stiff or clunky\n    Fun\n    FREE\n    Easy to get into\n    Balanced (at least as far as PVE goes)\n\nBut really, The game's good. Unlike other MMOs like say, WoW where you can pump stats  and become practically untouchable as you stand still while the game dictates whether you dodge or not. You actually have to evade attacks yourself. The stats only control your damage output and some damage mitigation as well as resistance to knockdown (your worst enemy for any class). You want an XP boost? either get it from the game store OR the in game vendor that takes federation bills, which you get 5 of each day.\n\nA few things about certain classes:\n\nBERSERKER- If you're making a Berserker, fighting BAMs will be the most annoying thing to deal with at early levels, since you'll spend most of the fight blocking, though it depends how fast and mobile the particular BAM is, but yeah, its better to team up with someone that can distract the BAM so you can get the maximum damage out (Berserkers have the highest single hit burst damage in the game, properly specced out you can take a solid chunk out of a boss's health bar, compared to the steady bits going away when the entire group's beating on it. Also, if all goes right, bring someone to tears in PVP). I say this because zerkers lack real mobility like the other classes have, so you'll notice it takes longer to down a BAM solo,  compared to other classes. \n\nWARRIOR- If you want a challenge, try learning to be an evasive tank on Warrior. Their offense is excellent, I'd even say easy, but trying to tank when you know the boss/room full of minions can blow you up since you're wearing leather, plus dishing out damage is a nice balancing act.\n\nMYSTIC- send pet, use damage spells, pet dies, put enemy to sleep, resummon pet and repeat. Personally I only find this class fun in dungeons since you can't use the tanking pet in there (unless you're soloing a group dungeon), it screws up the Tank's mojo and also pulls extra aggro when you're trying to be sneaky.\n\nGUNNER- I'd have to say this is the easiest class in the game. You get dodge on a 5 second timer that has a chance to not trigger the cooldown timer, plus a rocket jump for extra mobility, a grenade that stuns, a bot that heals you and a proximity turret. Believe me, this is the most newbie friendly class in the game. and one of the few classes that can take advantage of \"more damage from behind\" bonuses when standing right in front of the enemy.....When you see their moveset, you'll see what I'm talking about.\n\nREAPER- The stunlock king. You get 3 stuns, a counter attack, an attack that spaces you quite a ways away from the target AND the ability to cheat death. So unless you're going after some really mobile and hard hitting BAMs you can go from fight to fight with little to no breaks in between.\n\n*haven't tried archer,  priest or Lancer and retired my sorcerer early to make the mystic\n\nI can't stress it enough, if you like MMOs and action games, you'll love this. They don't keep the good stuff behind a pay wall, it's completely optional unless you like to customize or collect mounts/pets.", "timestamp_created": 1432374147, "timestamp_updated": 1432374147, "voted_up": true, "votes_up": 279, "votes_funny": 19, "weighted_vote_score": "0.895959794521331787", "comment_count": 20, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44904127": {"recommendationid": "44904127", "author": {"steamid": "76561198115270300", "num_games_owned": 152, "num_reviews": 19, "playtime_forever": 27753, "playtime_last_two_weeks": 0, "last_played": 1539115494}, "language": "english", "review": "Another amazing title ruined by spyware, Devs hushing anyone who even mentions the fact theyve been caught multiple times selling information from their players hard disks including passwords, Had to delete the damn thing from my pc after I had multiple of my outside of tera accounts have suspicious logins which they had never had previously. Don't support this game until the devs stop being greedy corrupt piles of garbage, 100$ says bluehole adds this to pubg too.\n\n\nEdit in post: People seem to be under the impression that im attacking this game because: A) Im a cheater who was caught and B) Because im just jumping on the band wagon.\n\nFirstly No I have never been banned, just as i have never used cheats, Ive always played tera fairly, the only time ive really abused the game was with the old buddy up benifits because it was a quick way to earn 30-60k for very minimal effort, which they have removed now.\n\nAnd B no I love enmasse, I also loved their new game closers, but i completely and wholeheartedly disagree with alot of the choices they have made in the past year and its the icing on the cake.\n\nThose who are coming here to troll whining evidence evidence just no, youre making yourself look like an ass, if you have a constructive comment to add to the conversation then post away but dont be an ass, dont be a milkman.\n\nAlso evidence of his trolling just incase I do disable comments because of his idiocy: http://tinypic.com/r/2dwalqw/9\n\nAnd the link to his steam account, Normally I dont witch hunt but this guy is a true gem, treat him with care gents hes special: https://steamcommunity.com/profiles/76561197974445873\n\nComments closed until im done binge playing WW3, dont have the energy or time to baby it, comments will reopen in a few days.", "timestamp_created": 1537751920, "timestamp_updated": 1539976056, "voted_up": false, "votes_up": 105, "votes_funny": 6, "weighted_vote_score": "0.854144394397735596", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16045246": {"recommendationid": "16045246", "author": {"steamid": "76561198092746592", "num_games_owned": 129, "num_reviews": 6, "playtime_forever": 14471, "playtime_last_two_weeks": 0, "last_played": 1492468582}, "language": "english", "review": "I think after 200 hours, I have an opinion on this game.  The combat is fun and punchy, similar to the likes of Monster Hunter (for readers who are familiar with that series), as the player must move about the battlefield avoiding attacks and striking when necessary.  It really does make for some pretty wild action at times.  There are several different classes, however the \"gunner\" class is restricted to female high elves and castanics (dark elves, essentially) and the reaper class is only available to the \"elin\" race when another character on the player's profile is at level 40.  The classes all handle their roles quite well, and even the mystic and priest (support) classes are perfectly worthwhile to play as.  The mystic and priest aren't quite as fun to play as solo since they're limited for damage-dealing abilities, but they're a blast to play as in dungeons or when partied up with friends. \n\nThis game also has a crafting system, in which players can craft armor, weapons, combat buff charms, and potions.  The game doesn't do a very sound job of explaining this system however unless you talk to a few scattered NPC's around Velika (the hub town) and even then, they give you a very basic tutorial of the system.  The crafting system IS worthwhile, as some of the best endgame equipment can only be made through this system.\n\nThe quests are pretty basic, save for some level 61-65 quests at endgame that get a bit more interesting.  The story quests really aren't that bad, and they even have some pretty nice looking cutscenes for more key points in the story.  Sadly they're not very complex quests and don't ask much of the player, so if you go into this game expecting something along the likes of what an MMO such as \"The Secret World\" has to offer, you may be disappointed.  \n\nAside from that, I find the \"final\" story quests of a particular region's questline to be particularly irritating.  The final quest is almost always a dungeon raid in which you need to gather up 4 other buddies and- of course- raid the dungeon.  These dungeons are incredibly difficult for a person to do alone on \"normal mode,\" but often can be completed with the collaboration of a DPS class and a support class.  The story quests spill over into these raid dungeons and must be completed to finish up that particular region's storyline.  Forcing people to either convince their friends to try out an MMO or team up with randoms is incredibly annoying.  Especially since there is a \"Solo mode\" which tones down the dungeon so a single person can raid an albeit shorter version of the dungeon.  Why a person can't just complete the questline on \"solo mode\" is just annoying.  Aside from that, that's the worst thing I really have to say about quests in this game.\n\nThis game is also free-to-play, meaning it has a cash shop (obviously).  The only \"pay to win\" item in the store per-se is a scroll that will allow a person to reach level 60 instantly.  For a game like this, this item really is made for people who are already familiar with the game, as a newbie who uses this item will find themselves using a class that they have no idea how to use, which is key for mastering this game's combat.  Most of the other items in the cash shop are also tradeable ingame, including items like \"name change vouchers\" or keys for strongboxes.  Otherwise, this game puts an emphasis on cosmetics and making your character look cool.  Ultimately, the cash shop and the way it was implemented isn't something to lose sleep over and isn't an element that ruins the experience.\n\nFor those interested in how the cash shop works, if you have \"elite status\" (a subscription service), you get a discount for the credits you can buy for the store (I'm not sure how much of a discount).  Otherwise the prices aren't totally unreasonable, but some of the items in the cash shop can go close to around $50-$60 without the elite status.  There are also elite status \"vouchers\" that can be traded ingame, and 1-day vouchers can be earned at certain levels (I believe it's one per character).\n\nNow here's the tricky part- the community.  TERA has several different servers (3 PVE, 3 PVP), and moving a character between them costs a fair amount of money ($20 USD I believe).  So I'm not sure how the other servers fare for their communities, but I tend to stick to the \"Celestial Hills - Roleplaying\" server, since RP servers are often more laid back than others.  Most people you meet in open or crowded areas aren't generally so bad, but the global chat is like flossing with razor wire.  Sometimes it can be tolerable and laid back, but at other times it gets filled up with spam and people trying to offer \"favors\" for ingame cash, or just being lewd in general.  It sounds amusing at a glance, and it was amusing for maybe the first 10 minutes.  200 hours later and I have to say it's probably one of the most irritating things I've seen in an MMO.  Thankfully there's the option to just disable the global chat, so don't let it stop you from trying this game out!\n\nThe other issue with the community really isn't the community's fault.  Earlier in this review I stated how irritating it could be trying to get in a group of randoms to raid a dungeon - and the game has an interesting solution.  There's a \"matchmaking\" function that will set a player up in a party that's seeking to raid a region's dungeon.  Unfortunately, most parties are often well-off for DPS classes and not near as many people take the time to play as a support class such as the mystic or priest.  I honestly don't blame people for not wanting to make a party of 5 DPS'ers, but it's difficult to get into a party if you're not a support class.\n\nUltimately, this is a game worth playing.  It has fun combat, good dungeon raids (despite the aforementioned nitpicks), a competent challenge, and the graphics are pretty sweet.  I'd say give it a try- but turn that global chat off!", "timestamp_created": 1432850023, "timestamp_updated": 1432850374, "voted_up": true, "votes_up": 103, "votes_funny": 5, "weighted_vote_score": "0.873817384243011475", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31617006": {"recommendationid": "31617006", "author": {"steamid": "76561198012620833", "num_games_owned": 168, "num_reviews": 2, "playtime_forever": 36599, "playtime_last_two_weeks": 0, "last_played": 1482894272}, "language": "english", "review": "As someone with hundreds of hours in this game (most of which are undocumented, as I play through their launcher directly and do not launch Steam) I cannot, in good faith, recommend this game to people any longer. I suggest finding another MMO to play, as the game is poorly optimized and the new staff will punish you for trying to fix it yourself.\n\nRecently, the publishers for the North America region have been banning people for innocuous FPS and optimization tweaks to improve performance. Something as small as a line in your .ini file to reduce the resolution of shadows or decrease the number of rendered particles is now a punishable offense, and are being answered via [b][u]permanent bans from the game.[/u][/b] \n\nTERA has been out for five years now, with our pleas for optimization and bug fixes going unanswered by both EnMasse Entertainment (the NA publisher) and Blue Hole Studios (the game developers.) Even a high-end machine has trouble running the game over 30fps on high settings. In those five years, the community has developed mods, guides and tweaks in order to help allieviate the pains of running a game at disgustingly low FPS and high ping. Then, out of nowhere, banwaves were issued for 'exploiting / malicious intentions' - a scapegoat to blanket ban thanks to the actions of one person using a cheat engine (which is by all accounts a malicious mod) to hack the in-game rewards store. Developers of FPS-boosting mods were banned from the game without warning and even a popular author who merely wrote class and dungeon guides was banned for the same reason.\n\nThreads on the EnMasse Entertainment forums regarding the bans and use of performance mods were (and still are) being deleted en masse (hue), silencing the community that only wants clarification on what is and isn't allowed. Appeals are being rejected by those who felt they were wrongly targeted for their bans, when they only wanted to make a poorly-optimized game playable.\n\nEME has proven to be out of touch with their community, with the new Community and Project Managers showcasing their incompetence on a daily basis. (The CM thinks people in Australia get 40 ping?? When the servers are hosted in Chicago??? :thinking:). \n\nIf the staff straightens up and starts focusing on the game and community again instead of just making their $$ CASH MONEY $$ on hyper sexualized costumes for anime loli waifus, maybe my views will change. But for now, I urge you to find another MMO to waste your time and money on.", "timestamp_created": 1494209165, "timestamp_updated": 1494209165, "voted_up": false, "votes_up": 183, "votes_funny": 12, "weighted_vote_score": "0.861986935138702393", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45454941": {"recommendationid": "45454941", "author": {"steamid": "76561197994343912", "num_games_owned": 438, "num_reviews": 3, "playtime_forever": 4937, "playtime_last_two_weeks": 0, "last_played": 1477443096}, "language": "english", "review": "Due to the recent events regarding Enmasse and their \"anti-cheat\" software, which turns out to be malware, [b]avoid this game at all costs [/b] if you don't want your information being stolen and sold off to unknown identities. \n\nThis may be hypocritical, but please do not acknowledge this game and the company.", "timestamp_created": 1540592667, "timestamp_updated": 1540592691, "voted_up": false, "votes_up": 52, "votes_funny": 3, "weighted_vote_score": "0.803366541862487793", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15960248": {"recommendationid": "15960248", "author": {"steamid": "76561197969791827", "num_games_owned": 207, "num_reviews": 27, "playtime_forever": 749, "playtime_last_two_weeks": 0, "last_played": 1434067393}, "language": "english", "review": "Crowded quest boss. No one can finish the quest.\n\nSomeone suggest to line up and take turns.\n\nWe ACTUALLY line up and take turns.\n\n11/10 That would never happen in WoW.", "timestamp_created": 1432357072, "timestamp_updated": 1432357072, "voted_up": true, "votes_up": 1895, "votes_funny": 1899, "weighted_vote_score": "0.869643688201904297", "comment_count": 122, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16440507": {"recommendationid": "16440507", "author": {"steamid": "76561198165714442", "num_games_owned": 42, "num_reviews": 6, "playtime_forever": 30499, "playtime_last_two_weeks": 0, "last_played": 1524957101}, "language": "english", "review": "Used to be an avid WoW player - But decided to give Tera a try.  I absolutely love how much we can customize our characters in the main screen.  The crafting and gathering aspect of the game are probably one of my favorite - It isn't something you need to farm for hours (At least at the lower levels, currently at 300 for most of my proffesions).  Beautiful scenery, great story line.  I also REALLY enjoy the fighting style, in WoW we select our target (And  can scroll through via the tab button) but here it's all point and shoot at the enemy which is a GREAT break from what I'm used too.\n\nThe only downfall is it does have a cash shop and I tend to get sucked into buying fashion items for my toons ;).  Elite status is amazing for this game - you can teleport to any city basically, which is really nice. BANK space in this game though is a huge issue, but they have items in the cash shop that you can buy to help with that.  I believe you can also spend in-game currency for items as well.\n\nOver all I Love this game :)", "timestamp_created": 1434452107, "timestamp_updated": 1434452107, "voted_up": true, "votes_up": 78, "votes_funny": 5, "weighted_vote_score": "0.84360802173614502", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30233520": {"recommendationid": "30233520", "author": {"steamid": "76561198077544950", "num_games_owned": 42, "num_reviews": 4, "playtime_forever": 147720, "playtime_last_two_weeks": 0, "last_played": 1546702379}, "language": "english", "review": "I've been playing tera a decent amount recently so i understand the point of certain complains people have about this game.\n\nFirstle, NEGATIVES, if any of these issues should bug you, you probably would NOT enjoy Tera's experience :\n-The game is poorly optimised. You would hear many people saying they lag in dungeons even with good pcs with gtx 960s and above. Even if you have very good specs theres no guarantee you would get 60 fps in velika or in rooms with tons of mobs. However if you can get passed this the experience isnt unplayable whatsoever and you can tweak the settings to see which allows you to have a playable experience.\n\n-Desync. There are often times in pvp you cast a skill to point A, and it hits a player at point B. This can be frustrating if some random guy manages to hit you after missing his skill in pvp.\n\n-Class/Gender lock. The recent classes namely reaper/gunner/brawler/ninja have all been locked to a specific class AND gender. Theres also news that the upcoming Lunar Dancer will be locked to female castanic only. If you want to swag up a badass cool looking guy this may be a bummer for you. Also not everyone wants to play as a 12 year old loli.\n\n-Mundane questing. As you start to get more alt characters, you would have to continue leveling from 1-65 over and over. Basically, it gets boring as heck and quests can be a pain to do. You can however skip some quests and do dungeons only or battlegrounds to level up which isnt so bad and is a great way of learning your class properly instead of going from point A to B doing quests.\n\n-Small player base. There are not alot of players online most of the time, with only more during certain events. This only really affects certain dungeon queues and battlegrounds. If you dont pvp as much, you wont really notice a lack of queue for most dungeons.\n\n-RNG. There are a few things in Tera are that RNG based. Biggest thing is gear. Enchanting ,Masterworking or Awakening gear from +9 to +15 takes alot of tries and rng to pull off which may lead you to rage filled suicidal moments that prove you are in fact very salty and are considering to uninstal the game. Small problem for the most part as most gear aren't that hard to enchant unless your rng is 0% in every single game played which then you should probably re-evulate your life choices and quite gaming.\n\n\n\n\nNow if you dont mind any of the negatives stated above, you may want to consider the POSITIVES for this game.\n\n-100% not pay2win. There are some items like innerwear which are supposedly cashshop exclusive purchase but you can still buy these items through gold or tokens. The game is very playable and enjoyable even without having you spend a penny on it. You still get an enhanced experience if you wish to pay with real life cash.\n\n-Large variarity of cosmetics. If you wish to make your character look blink or swag or sexy, you can do so in Tera. You dont even need to spend real life currency to do so. With enough gold, you can make your loli elin cute af and afk at highwatch without any complains.\n\n-Combat System. Of all games i have played Tera is one with one of the best combat systems. Its fluid, flashy and never gets boring (unless leveling alts over and over). You get to pick one of 12 classes(currently, more in future) that are unique in their own ways. Furthermore the animation of many skills are quite impressive and it definitely isn't some point and click game. Each skill has a unique function (althought some classes might have similar skills with one another) and it definitely takes time to master each class. Naturally, don't expect to nail everything on the first dozens of hours you play.\n\n-PVP. Another thing i really like about tera. Fast paced pvp that really allows you to learn more about your skills. PvP is a way to improve more in the game. Also skills used in pvp aren't always the same as in PvE against monsters so overall there is greater variation in playstyle of each class. Sadly pvp battlegrounds are dying due to small player base but duels against players will always be there.\n\n-Dungeon Rotations. Twice or thrice a year, level 65 dungeons get rotated out of the game and replaced with newer dungeons (or dungeons from way back). This ensures that the end game isnt stuck with the same old dungeons which makes the game pointless at some point. Plus you will have to master new dungeons once the patch hits which is quite refreshing.\n\n-Beautiful scenery. Like many other mmorpgs out there, Tera shines in its beauty. The landscape is nothing short of stunning as long as you are not on lowest graphics settings.\n\n-Satisfying gear progression. While some long time players may argue that getting new gear each patch is repetitive and boring, I actually find it satisfying and nice to farm and work towards new gear each patch at level 65. You can also grind tons of gold only to fail on +15 enchantment and go back to square one.\n\n-Mounts and pets. Tons of mounts to choose from, also have pets which aren't as useful but they are there. Many mounts grant you passive HP/Mana regen while mounting and others even flight. Pets are there with auto loot, extra storage or even auto gathering abilities(albeit not neccessary). Sadly, you will only have enough gold saved once level 65 and after having played a decent amount to buy these items but it doesn't take too long to get to max level. (took me 10hours to max level an alt but you can do it more quickly with more experience)\n\nTL;DR, Game is still fun, enjoyable. Many of the complains mostly affect veteran players and not so much to newer players. Furthermore there are many guilds out there with friendly people that are willing to help out  newer players so i would definitely recommend this to someone wanting to try it out for the first time. Get ready for some days where you will log in for 12 hours straight, and some days you don't even log in, its pretty normal. Despite the complains ive had, the game isnt far from fun and recommendable and thats just a little nitpicking.\n\nEdit: Nut Weab Geme(maybe)\n\n10/10 if you are a lolicon.", "timestamp_created": 1488254997, "timestamp_updated": 1500389114, "voted_up": true, "votes_up": 43, "votes_funny": 3, "weighted_vote_score": "0.827533543109893799", "comment_count": 3, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "41165655": {"recommendationid": "41165655", "author": {"steamid": "76561198032576544", "num_games_owned": 78, "num_reviews": 2, "playtime_forever": 57162, "playtime_last_two_weeks": 0, "last_played": 1522450179}, "language": "english", "review": "The dream that pulled me in to Tera- soaring through a gorgeous sunset on a winged horse, surrounded by guildmates on the way to an adventure. Everyone dressed fantastically, and no race was the same, but it all fit together..... \n\nWell anyway dreams of flying have to hit the ground sometime. I've spent around 1,000 hours in this game, including alot of time in end-game content with one of the top guilds.  Although it is getting a bit aged, there are many good things here- but also some, that for me, are nagging bad and add up over time. First, let's get the Elin thing out of the way- what other game lets you fight as a pre-teen girl while flashing everyone your underwear? Take that how you will, but if you play an Elin you can count on some other players, particularly women, with giving you grief. But you gotta realize that Elins, and all of their pay costumes, are the largest revenue drivers for the game.\n\nSecond, getting good at the game is really driven by gear-grinding; if you dont mind becoming addicted to a game then that's fine too- most of the really good, top-tier players I knew were on all the time, including middle of day and night, and weekends. Hanging out in guild is a lot like hanging out at a bar from end of work to closing time- which is also a personal choice.\n\nThe game is free to play, but you will realize really quickly that paying the monthly fee for 'elite' status is pretty important for character progression. The gambling side of this is also something you should be aware of- a lot of useful stuff as well as the best costumes and mounts either are expensive or are in pay loot boxes. The company doesnt publish the odds of winning from a loot box, but they DO have server-wide annoucements whenever anyone gets a good loot-box prize. This creates an illusion that people can win, and supports the gambling addiction in this game I see from many players. The worst of this to me is the kids that play- they tend to have a lot of envy towards the adults who are always blowing money on loot boxes- one breaking point for me was talking ingame to a teen who was upset he couldn't keep up on loot box gear as his guild mates did, and who said \"I cant wait to get a job so I can spend a couple hundred a week on loot like everyone else\". Hearing that was a heart-wrencher.\n\nThe last straw for me was oddly, a professional one. I work as a medical statistician, and am the sort who is fascinated with odds and how people deal with risk.  Improving your gear in the game is always a probabilty, and runs from 100% at base down to under 10% at the top. Getting materials for attempting gear improvement can take days at the top, and many players have a more-than religious belief in the almighty Random Number Generator (RNG)- (much like habitual gamblers at Vegas worshiping Lady Luck).   The probabilities of success are stated with each try, and Tera tries to make it look objective- but across all my time playing, I've kept track of sucesses/failures, and the stated probabilities from the publisher dont hold water.  Some types of gear improvement are much better than stated (for mid-tier gear); for top tier, sometimes it is much worse. I have trouble playing a game that doesnt feel 'fair', or where I feel exploited by the publisher- and in this case, don't expect much sympathy from Tera support staff.\n\nSo if you play Tera, go fly a dragon for me, as I'm done.", "timestamp_created": 1522452415, "timestamp_updated": 1522453100, "voted_up": false, "votes_up": 245, "votes_funny": 13, "weighted_vote_score": "0.85262686014175415", "comment_count": 19, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42521190": {"recommendationid": "42521190", "author": {"steamid": "76561198025076015", "num_games_owned": 194, "num_reviews": 11, "playtime_forever": 1047, "playtime_last_two_weeks": 0, "last_played": 1496827983}, "language": "english", "review": "Great game held down by one of the worst publishers of an MMO I have ever seen. Had to find out from hackers that Xigncode would be coming to this game rather than from the publishers themselves.", "timestamp_created": 1528251155, "timestamp_updated": 1528251155, "voted_up": false, "votes_up": 67, "votes_funny": 1, "weighted_vote_score": "0.820033788681030273", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34686723": {"recommendationid": "34686723", "author": {"steamid": "76561198073659380", "num_games_owned": 88, "num_reviews": 7, "playtime_forever": 124025, "playtime_last_two_weeks": 2556, "last_played": 1551833466}, "language": "english", "review": "I've been playing this game for a few years now and I think it's pretty good. A few pros and cons:\n\nPros:\n-The game is actually free. While you can spend money on a subscription or in the shop to decrease the time it takes to do things or increase travel speed, none of that is necessary, and the downsides to not doing it are really minimal. Travel already doesn't take a long time, and other features of purchasing a subscription can be acquired simply by grinding gold which is not hard to do.\n-The combat is a lot of fun, and there are a lot of different classes to choose from whether you like melee/ranged dps, tanking, or healing.\n-The game can be played very casually and is great if you're looking for a game to hang out in now and then and you just want to get into some action quickly. You can teleport to the areas where you want to fight and get into a fight within seconds rather than the time wasting often seen in other MMO's. \n-They have streamlined questing so that you are really only doing the main story quests now. While the main story isn't the best, if you read it at least you have a coherent story to follow and most of the quests are quickly completed without feeling like the 'kill x rats' quests. \n-The expansion areas (60+) are actually quite good and even have cinematic story included.\n-You can fly. For free. Without grinding a million hours of crap.\n-There are a lot of costumes and outfits to choose from to visually customize your character. They can be purchased with cash through the shop or are usually found on auction for gold. \n-There is some customization of the abilities using glyphs so that you can empower your favorite abilities in different ways.\n-Combat tends to feel more fluid. While there are optimal rotations, for new players the combat feels very situational and different monsters need to be approached differently. I never feel like i'm bored with the combat, which is a great thing.\n-To me personally, the game doesn't feel overly grindy and is 'honest' with you where it is grindy. The grinds aren't hidden away; you know exactly what and where they are.\n-There's a great amount of solo content, and a LOT of progression can be done solo. Most of the game is fully soloable up till late end game.\n\nCons:\n-There are gender and race locked classes. If you are okay with playing those genders/races, then it won't be a problem for you. Personally this did not bother me much but other people might not like that.\n-Your class has a set skill base, so you can't get different abilities from others who are playing the same class, although they can be customized with glyphs. This is not as big a con as it seems though due to the dynamic feeling combat. \n-Gear upgrading is RNG based using an enchanting system. While this is annoying to some degree, I still feel a sense of progression because acquiring gold leads directly to additional enchant attempts and you will eventually succeed. The gear itself is easy to acquire, but enchanting is key to increasing your power.\n-It is difficult to find modest/non-sexy outfits in this game. This may or may not be a problem for you depending on your views, but some players won't like this. Most of the outfits are showing a significant amount of skin. \n-You have to do maybe 3 dungeons while leveling, preventing you from going solo the ENTIRE time. You can skip this by doing repeatable dailies called vanguards, so it's possible to solo past them if you don't mind that grind. All in all, we're talking 45 minutes of mandatory group content in the entire 1-65 leveling process though, so this is a minimal con. \n\nSummary:\n\nAll in all, this game has a great F2P system. It's not intrusive, it doesn't feel abusive. The game is extremely casual and solo friendly if you are looking for something to just do now and then and want to jump into some action combat quickly. There are a few limitations on customization with gender and race locked classes, but if you are open to playing more of the races this won't really present a problem. I've found it to be a great go-to game when I don't want to pay a sub, and when I'm playing it as my main game I'll even sub to get some of the time savings offered given that the sub price is comparable to other MMO's out there. I would definitely recommend this game!", "timestamp_created": 1504362804, "timestamp_updated": 1504362804, "voted_up": true, "votes_up": 47, "votes_funny": 0, "weighted_vote_score": "0.806926906108856201", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17102798": {"recommendationid": "17102798", "author": {"steamid": "76561198061696667", "num_games_owned": 193, "num_reviews": 15, "playtime_forever": 1403, "playtime_last_two_weeks": 0, "last_played": 1496869940}, "language": "english", "review": "Another Great game that has helped protect my virginity", "timestamp_created": 1437198420, "timestamp_updated": 1470377511, "voted_up": true, "votes_up": 98, "votes_funny": 420, "weighted_vote_score": "0.821530938148498535", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42519561": {"recommendationid": "42519561", "author": {"steamid": "76561198163059382", "num_games_owned": 74, "num_reviews": 9, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1495742361}, "language": "english", "review": "En Masse Entertainment has announce that this game will officially recieve a software known as Xigncode.\n\nhttps://forums.enmasse.com/tera/discussion/27159/xigncode3-and-tera-pc#latest\n\nThis software is said to be very malicious towards your computer's CPU usage as well as unauthorized scanning and sending of files.\n\nPROCEDE WITH CAUTION!", "timestamp_created": 1528243287, "timestamp_updated": 1528244514, "voted_up": false, "votes_up": 175, "votes_funny": 16, "weighted_vote_score": "0.841579198837280273", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32100074": {"recommendationid": "32100074", "author": {"steamid": "76561198027447537", "num_games_owned": 406, "num_reviews": 13, "playtime_forever": 10469, "playtime_last_two_weeks": 0, "last_played": 1542729116}, "language": "english", "review": "TERA is an MMO for those who aren't as focused on story as raw gameplay, and that becomes more obvious as it goes on. The storytelling itself is good, but it's certainly nothing to write home about as it involves some storytelling cliches about as old as the dawn of time. It can also get lengthy as sometimes you have to actually walk from place to place(This can be solved mostly by teleportals and pegasi rides, but those aren't always available) and unless you have something to kill along the way it might drag on a little. But where the game Excels and why many enjoy this so much is the fast-paced combat system. While similar to other MMOs of this kind, TERA allows the player to string abilities together to form fast, powerful combos where skills can be executed more quickly than if they were cast seperately. this culminates into a pseudo-Dynasty Warriors fighting system that is satisfying to pull off especially as some of the more melee-oriented characters like the recent Valkyrie class. While there are some arbitrary restrictions on some of the classes, each one offers a unique fighting style that works well when combined with groups of other, varying types. On top of all this, newer players getting the game on steam have the option of getting a free starter pack that gives them plenty of goodies like a seven day XP booster and a free green hood. Overall, TERA's strong point is the combat mechanics while everything else is good, but not great. While those looking for a deep, intricate story on the same level as Guild Wars 2 might shy away, Those looking for a fun, viceral combat experience are more than welcome to play this game.", "timestamp_created": 1496291933, "timestamp_updated": 1507927375, "voted_up": true, "votes_up": 46, "votes_funny": 1, "weighted_vote_score": "0.815838932991027832", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35746048": {"recommendationid": "35746048", "author": {"steamid": "76561198061408720", "num_games_owned": 144, "num_reviews": 8, "playtime_forever": 7175, "playtime_last_two_weeks": 0, "last_played": 1550076572}, "language": "english", "review": "This used to be my favorite game, the combat mechanics made being my favorite class (healer) fun because I didn't have to 'meter fill'. I could actually look up and interact with the world and be apart of the fight rather than skimming the interface to crowd control heals. . I leveled a brand new character to experience all of this fresh on this update to max (65) this was my experience. \n\nThis most recent update has streamlined the gear to be less complicated for returning players to know where to get their gear etc however. The positive ends there. \n\nTera has become strictly pay to win. And I'm not using that term lightly. You can win without money. But you can login right now and use cash shop items to get highest tier as well. And boy do I love swiping my visa to get to the content fast, so I did! I swipped maybe 200$ in items to get 14,000 worth the exchangeable currency to make my gear fancy. Now with the sparkles on my back what do I do? \n\nThe dungeon queue is now an eternal wait. I sat for six hours on a Saturday and not one dungeon popped for PvP. You can do grind dungeons with people who do not typically speak English. The population seems almost entirely Portuguese not a con, just if you don't speak that language its more difficult to feel apart of any sense of community. \n\nPvP has been removed from the world essentially. They have removed alliance wars so all the regions that used to have players roaming and doing dailies while pvping opposite factions has been eliminated due to exploiters killing account alts to give themselves higher scores in order to recieve the first place killers glowy hat. So all that pvp has been ripped from the game. \n\nYou can no longer PvP until you get to lvl 65, which is max level when you recieve the ability for flagging. Then the only pvp you get must be planned by a guild you create or join. \n\nYou recieve a weapon called the 'Avatar Weapon' that now lets you one shot nearly everything in the game in order to power level you to max level. So, the fun from learning boss mechanics developing reflex skills for your class and all around being knowlegeable about your rotations no longer exist because everthing you touch just dies. No reason to be good at your class to PvE appparently.  \n\nThey took away the guts of the game, everything that gave me the greatest memories, Alliance Wars, BAM fights (they die too quickly to enjoy), The Argon War, (back in the day we used to show up to events to fight argons and get points for that region, then you used those points to purchase high end materials or mounts.) No longer exist.  There were guild wars while you were trying to do events, it was an exciting thrill that used to give you a reason to strive so hard for the top PvP gear. It's all gone, and so is the drive anymore because of it. \n\nThis 'HUGE UPDATE' is you login, get avatar weapon, one shot everything to max level. Then you are GIVEN a -free- set that will evolve into your end game gear because you just press one button to ugrade it all the way through the tiers, No dungeons for PvP will pop anymore the population is too small to get battles going and this was tested on peak hours and days. There really is nobody playing. Which is curious because at login the server says the population is \"High\". That feels like a complete smudge of the truth. At max I saw 15 people in one area. I leveled a brand new character to experience all of this fresh on this update to max (65) Every single zone was empty, only the crickets to laugh at  your jokes.  Highwatch has the highest population of people and they seem to do nothing all day but stand there, it's not interactive or alive anymore. \n\n\nAlso the Kuma mini-game used to require a team effort to accomplish, people wearing good crystals and paying attention to their surroundings, was a challenge and it kept it interesting each time you signed up to play a round.... Then slowly people started digressing into auto quitting if they recieved the Kuma side of the playing field... And it was rare then to get players that wouldn't auto quit the round and ruin the fun for the entire lobby... NOW: Everyone is a Kuma, you don't play your class you just spam a set of kuma skills until the round ends... No strategy involved, streamlined baby playable. \n\nAlso if you're thinking of just joining a PvP guild and doing guild PvP think again, the main guilds you'd be interested in act like elitist. In such a way that an hour after being invited in I logged out to transfer a character, then was promptly messaged through discord saying they had a problem with how much time I spent playing the game that day..... I had only been in the guild for one hour... and wasn't even leaving Tera I was transferring characters to that server... For people to act so elitist on a game that is this Sesame Street, makes me question the age and mental capacity of the remaining population. Naive, and a loss on their part I was always a ranked player and knew my class inside-out.  I typically played 8+ hrs a day and lead battlegrounds nearly every round. Nobody has a right to manage your online or offline time. It's a strange species that is hanging on to the neglected animal that has become Tera. \n\n\nSUMMARY:\n\nThis game has been abandoned and setup to auto-run itself. Streamlined so that any age can play this empty shell of a game. There is no content, no PvP, no Events other than \"buy our stuff from cash shops\".  Sad, poor and pathetic...not even a shadow of its former glory exist... rest in pieces Tera, once arguably the best mechanic system for PvP no longer is used for PvP. \n\nThe publishers aim: To get you to purchase cash shop items. its the only thing still active and running. While they provide you with zero content for PvP. Did they add a new dungeon? Yep, I two manned it with the lowest tier gear and it was intended for a 5 person party. It's been reduced to Sesame Street level of difficulty. Took us 20mins to experience the 'new content' they advertise, It's false promises. My highest recommendation for a DO NOT BUY. \n\nThis game is now the classic example of consumer abuse, they pour glitter on advertisements then what you get is an empty box, they expect you to play with packing peanuts and do micro transactions for making those peanuts pretty.  \n\nAbandon-ware Cash Grab. Reported. Do they add little things here and there, yes, so that they can advertise updates. But the content is bare minimal anything at all. It's an extra 20mins of lame PvE. \n\nAny FUN or ALIVE feeling you may encounter about this game comes from the login spam of advertisements begging you to check out their cash shop items. The people just stand around doing questionably pedopheilia things with underage looking avatars. -FACT not opinion. If you get mad because of that, its because you're guilty and trying to hide it. NEARLY every single load screen you get depicts children doing sexually suggestive, or explicit material. They slap lore on an underage appearance and say pedophilia is O.K. A community I have ignored but now it seems it is all that is left. \n\n\nThis game was not purchased through steam though I have played it since before its release. Since the beggining and took a break for a couple years after being upset about exploiters of the system, and came back to see if they fixed it... and certainly they had. Rather than tweak it to stop the exploit/cheaters, they removed everything to do in the game that was worth a damn to do.  This review breaks my heart. I will always think fondly of the experiences in the beginning... what it has become now... needs to be shot and laid to rest....\n\n\nTAKE NOTE OF DATES OF POSITIVE REVIEWS: Tera was once the most amazing. Now, it is nothing. And its not an opinion of a small change.. This is a fact, they have gutted all the content and added hot dog stands and cash shop items calling it content. Like going to a carnival with no rides and there only being put the ring on the duck games.", "timestamp_created": 1508070024, "timestamp_updated": 1508360022, "voted_up": false, "votes_up": 245, "votes_funny": 11, "weighted_vote_score": "0.864806294441223145", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15720175": {"recommendationid": "15720175", "author": {"steamid": "76561198014163253", "num_games_owned": 288, "num_reviews": 289, "playtime_forever": 2307, "playtime_last_two_weeks": 0, "last_played": 1448158592}, "language": "english", "review": "[b][u]-Quick Review-[/u][/b]\nTERA is an MMORPG developed by Bluehole Studio and released in North America in 2012. You play TERA in third person view, have a choice between 9+ Classes, 7+ playable races, and level 60+ content (level cap increased to 65 for Fate of Arun Update).\n\n[b][u]-Detailed breakdown review-[/u][/b]\n[b]Story:[/b] You can go look up the official plot given on the TERA website, here's what most experienced mmorpg players will get while playing the game: \"blah blah blah, go kill that thing because he looked at my friend weird. Blah blah blah, pick all of these things off the ground. Blah blah blah, go talk to that guy over there, because my kneecaps are broken.\"\nIf you skip the quest-text, the story is still pretty good; there are a few cutscenes that break up the monotony of the quest and NPC grinding. The basic story that you will already find out for yourself after getting out of the starting area, is that; you're a new hero who's just \"helping out\" and gets suckered into the wild-and-beautiful-lands that is TERA.\n\n[b]Game Play:[/b] I fancy myself a fairly well versed MMORPG player, naturally there are many more hardcore MMORPG gamers out there, but I feel like I can consider myself as a bit of an authority on run-of-the-mill MMORPG mechanics. [i](And of course, an Achiever)[/i]\n\n[u]What does TERA do the same as other MMO's[/u], in terms of mechanics? Tank, healer, Range/Melee DPS, roles. Much of TERA is played very much like other MMORPG's out there; items, potions, crafting, auction house, mail, dungeons, PvP, duels, quests, daily quests, friend list, and many other features - many Keybindings are the same as they are in other MMO's. \n\n[u]What does TERA do differently?[/u] The game does what I feel an MMO must: [i]it makes you feel small, and makes the world feel big[/i]. There have been many moments while playing TERA that I said \"WOA, that HUGE monster almost squashed me, good thing I dodged just in the nick-of-time!\"\nTERA does not support tab-targeting and auto-firing, in other words, if you're an archer; you need to point your character in the direction you want to shoot and [b]aim[/b] at your target. Melee it's similar in that you need to face the direction you intend to attack, and healing you need to similarly aim at your target.\nWhat does this feature mean? It actually forces players to be more aware of their surroundings and environment. Instead of tab targeting and watching health bars, you need to know where you are in proximity to your allies and enemies.\n\n[b]Achievements:[/b] There are no Steam achievements for TERA, however like all good MMORPG's, TERA has it's own achievement reward system... it's the achievement hunters paradise; there are many achievements in game that award titles, mounts, and various other items and aesthetics.\n\n[b]Price[/b] Now we come to the best part, this game is free to play, you are limited on character slots per server, auction house items you can post and a few other features. I've played a few MMORPG's that are Free to Play, but normally they; make progressing grindingly slow, limit your currency, level cap, or all of the aforementioned!\nThere are many things you can purchase from the TERA store for aesthetics or character slots, or even purchase some of these through Steam. I personally would suggest showing support for the game if you enjoy it!\n\n[b]Conclusion:[/b] There are really only a few more things to mention before my conclusion: be mindful TERA is quite a large download, so that could steer some people away from it, due to hard drive or internet speed restrictions. Additionally, the graphics and game environment is quite dazzling if you can run TERA on higher systems. \n\nWho would this game appeal to most? The best stereotype would probably be MMORPG and RPG gamers, but I think that a free-to-play like TERA would be a good introduction for anyone who is new to MMORPG games. The UI can be a bit daunting at first, but there are guides available to explain what does what and even a built in tutorial/help menu.\n\nI highly recomend this game, and will personally be spending many hours playing it.\n\n------Edits and updates------\nEdit/Update May 08, 2015:\nadded \"Quests\" to \"Same as other MMO's\"", "timestamp_created": 1430958377, "timestamp_updated": 1431110826, "voted_up": true, "votes_up": 153, "votes_funny": 14, "weighted_vote_score": "0.860408961772918701", "comment_count": 16, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15707794": {"recommendationid": "15707794", "author": {"steamid": "76561198025410218", "num_games_owned": 446, "num_reviews": 14, "playtime_forever": 4203, "playtime_last_two_weeks": 0, "last_played": 1440962232}, "language": "english", "review": "TERA has exactly what you would expect from a Korean MMORPG, which is not really a bad thing depending on your preferences of course.\n\n1. Great combat system. Yes, the famous true combat system that the TERA developers and fanbase brag about all the time. Is it good? Well, yes, it's the best in its class (at least until other KMMOs like Black Desert step in and try to dethrone it from the NA market). Other MMOs only try to match TERA fluid combat system. The only other games I know of that exist right now that can even come close are RaiderZ (combat is the only thing going for that) and C9. So what is the system? No tab-targetting, aimed attacked, combos, dodging, fluid transitions between skills, ooohhhhh it's really something you have to try for yourself.\n\n2. Lots of grinding. Well, it's a Korean MMO after all and where would a Korean MMO be without lots of farming and grinding. That's definitely something that puts the combat system to the test now isn't it? Something I really like about TERA is the enemy variety within a single area. You'll have enemies where you'll be bursting down, then dodging while waiting for cooldowns just to burst again moments later.  You'll have enemies you can beat in only one string of skills. There's a third kind which dies in generally one hit. REALLY, JUST ONE HIT!!!!!! Considering nowadays most MMOs consist of you repeatedly ripping into enemies while fun numbers appear of their heads over and over until they finally die and you're left exhausted and bored,  grinding in TERA is a breath of fresh air. So farm to your hearts content, because it's way better than in most games.\n\n3. Waifus? Well again, Korean MMO, so obviously you'll be trying to make the sexiest character possible. There's some presets as always, but then comes the sliders for adjusting ears and nose bridges and mouth position and all that stuff you either love or dread at the start of an MMO. Essentially, there's decent customization for your waifu making pleasure. Lots of armor sets, again focused towards making waifus which I'm sure you would have expected by now. \n\n4. Cash shop are usually handled moderately well in most Korean MMOs, at least the ones that I've played (except for the post-2010 p2w deathtrap known as Maplestory among others). Lots of cosmetics, you know, to enhance the waifu experience of course. You could become an elite member where you pay a fee and get more XP and discounts at the EMP store if you want, but that's not anything p2w. Leveling isn't that hard that this XP boosts become unfair, and 2x XP events aren't that uncommon either. They also sell the usual, character slots, gender changes, facial changes, some keys to open chests (praying to RNGesus for days), mounts, pets. But nothing bad nothing to ruin any f2p players experiences.\n\n5. PvE vs. PvP server: The PvE server is your traditional MMO server where you aren't beating noobs to a pulp as they try to do quests. You can play in PvP matches separately from all the PvE content just like your typical MMO. PvP servers, watch out noobs because some people just like it best when your precious waifu is dead on the floor while they laugh and wait for more noobs come. Yeah, you can see how that's turning out. It's a real fun and different experience worth checking out once you've hit max level in a PvE server or think you're good enough to meet the challenge.\n\n6. Endgame content? Well, they have more quests, PvP, dungeons, grinding for end game gear, the usual stuff. Enough content to keep players going but I won't go in-depth on that mainly because I never focus on doing endgame content in MMOs aside from dungeons and a bit of PvP from time to time. They have a great little guide on endgame content over on the TERA website for you. \n\n7. Economy-wise, I don' think making money is too difficult in TERA. Even at early levels, you'll be finding items you can sell for like 100 gold (uses the copper, silver, gold currency system) at the brokerage (basically an auction house, trading post, nothing new here). You'll easily be able to afford anything you require at your level until you start looking for rarer items. You think 100 gold is a lot? Well, when a guy walks around with like 50,000 gold then you'll see how insignificant your stash is. However, you'll never feel like you're ever lacking funds, until you start looking for rarer stuff.", "timestamp_created": 1430880768, "timestamp_updated": 1430880967, "voted_up": true, "votes_up": 212, "votes_funny": 29, "weighted_vote_score": "0.878152847290039063", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42065773": {"recommendationid": "42065773", "author": {"steamid": "76561198267257028", "num_games_owned": 36, "num_reviews": 3, "playtime_forever": 30338, "playtime_last_two_weeks": 0, "last_played": 1530881357}, "language": "english", "review": "I have several hundred hours (probably a few thousand) in this game outside of Steam. I recently came back to the game and downloaded it here instead. I won't be updating this review so some things may not apply to the current patch.\n\nI RECOMMEND THIS GAME TO:\n• Any MMORPG lover who loves grinding and action combat\n• Weebs (trust me)\n• Lonely guys / perverts (head to Celestial Hills)\n\nPROS:\n+ Amazing combat; hands down the best you can find in any free to play MMORPG\n+ Dungeons in this game are a lot of fun; lots of mechanics and a fair loot system even if you're soloing\n+ Good character creation; hair styles etc are a little limited, but everything on your characters face is customizable\n+ A lot of character customization through cosmetics; the cosmetics in this game are awesome and make any character look unique (you can buy them with gold as well, not just real money)\n+ Amazing graphics; not much else to say here, the game looks gorgeous even if you have to play on minimum settings\n+ 100% free to play; cash shop only has cosmetics and things for lazy people who can't be bothered to level up / grind\n+ Easy to pick up as a new player; there's a small \"tutorial\" area that serves as a starting area to new players to get you started\n+ Good/Easy friend recruitment system; gives some neat limited time rewards and items like mounts, pets, consumables, costumes and a Village Atlas that you can use to teleport everywhere without using your in-game currency\n+ Events are held often with nice rewards; group up with friends or do them alone\n+ Many achievements to get with laurel / title rewards (even permanent mounts); unlike other free to play games Tera has some nice achievements that are fun to try and complete\n+ Partying up has many benefits; Vanguard quests etc can take a long time to do so partying up with someone really speeds things up. While leveling you get extra experience in dungeons as well\n\nCONS:\n- Hard to learn (can be a pro if you love challenge); dungeons can get overwhelming and learning your combos can be difficult as a first time player if you don't have any friends to show you how to play the game\n- I didn't find myself being particularly interested in the story at any point (bad?); if you're someone who enjoys the lore part in MMO's this one might not be the best one you'll ever experience\n- Questing is lackluster; at some point you'll just start spamming dungeons (around lvl 20-30), because the quests get boring (I suggest doing the red story quests if you're gonna do any questing at all and leave the yellow ones unless you need extra experience)\n- Crafting isn't the best; only reason to level any of the crafting skills is to make your own materials for your end game gear (no crafting your own gear or potions for example)\n- Soundtrack isn't the best; it's not bad, but it's missing something\n- PvP is kinda... dead; I don't play much PvP myself, but currently there's not much world PvP going on (if at all) and BG's are coinflip to the point where your ranking means absolutely nothing\n- Limited character slots in the beginning; when you start Tera for the first time you only have 2 slots per server\n- Race/Gender locked classes; for example Gunner class can only be Elin, Castanic female or High Elf female\n- Community can be toxic; you meet nice people most of the time who are willing to help you out, but be prepared to find a lot of angry and salty elin healers (especially in dungeons)\n- Time consuming to get anywhere without real money; the stuff you can buy in the cash shop really helps out a lot and a lot of the times it can feel like a pay to win game if you're not used to grinding daily\n- System requirements can be too much for some laptops; if you're a laptop player that does not have a laptop meant for gaming you might not be able to play at all\n- Long maintenance times; just yesterday (5/15/2018) we had to wait around 7 hours to log back in", "timestamp_created": 1526474808, "timestamp_updated": 1537169814, "voted_up": true, "votes_up": 58, "votes_funny": 15, "weighted_vote_score": "0.807062387466430664", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44573188": {"recommendationid": "44573188", "author": {"steamid": "76561198123642348", "num_games_owned": 79, "num_reviews": 7, "playtime_forever": 1401, "playtime_last_two_weeks": 0, "last_played": 1492833705}, "language": "english", "review": "XIGNCode  crap\nhttps://www.reddit.com/r/TeraPC/comments/8ot680/psa_upcoming_tera_na_patch_files_not_yet_deployed/", "timestamp_created": 1536096601, "timestamp_updated": 1536096601, "voted_up": false, "votes_up": 45, "votes_funny": 5, "weighted_vote_score": "0.76930469274520874", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22828361": {"recommendationid": "22828361", "author": {"steamid": "76561198059970118", "num_games_owned": 53, "num_reviews": 9, "playtime_forever": 3353, "playtime_last_two_weeks": 0, "last_played": 1498300241}, "language": "english", "review": "TERA is a great game that gets really boring as it goes. I am recommending this game. But it does not mean I love it. I'm actually mixed about it but more on the \"Recommended\" side. So here are it's Pros and Cons\n\nPros:\n-Incredible Combat (Actually one of the best I have experienced)\n-Exciting Bosses or as they call it BAMS (Big Ass Monsters)\n-Very nice graphics\n-Very big map (Actually mixed about this too, but I can say it is a pro)\n-Raids are EXCITING\n-Not P2W\n-Very exciting PVP (But because the game appears dead, get ready for 20 minute queue times)\nCons:\n-The game appears dead \n(Atleast for me in NA servers I think the big map contributes to this thats why I was mixed about it)\n-Quests are VERY ANNOYING TO DO (This is actually it's biggest con yet)\n-Like I said, gets boring FAST\n-Useless crafting system\n-A grind\n\nOverall, It is a good game that is very grindy. Especially in quests. If you ask me if it's one of the best MMOs out there, it is, for most people. But, not for me. It falls flat on this repetitiveness in quests and shortage of things to do but overall a great game that is very fun to play with friends especially in dungeons and raids.\n\n7.8/10 \n", "timestamp_created": 1462549206, "timestamp_updated": 1462549206, "voted_up": true, "votes_up": 45, "votes_funny": 3, "weighted_vote_score": "0.767552495002746582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44247438": {"recommendationid": "44247438", "author": {"steamid": "76561198016052219", "num_games_owned": 85, "num_reviews": 19, "playtime_forever": 4448, "playtime_last_two_weeks": 0, "last_played": 1528347398}, "language": "english", "review": "I really loved TERA. It was the first MMORPG I really got into and the only one that ever stuck around to continue playing. I'd tried WOW and Neverwinter before and they just felt awful and clunky. TERA however was different. I'll split this review into 3 parts. What was great, what sucked, and my final thoughts on it.\n\nIf you're too busy or lazy to read everything, skip to the bottom for my final thoughts and opinions.\n\nSo what did TERA do well?\n\nWhat initally brought me to TERA was that it was listed under MMORPGs that moved the camera with your mouse similar to a 3rd person shooter. Of course after looking at the game, I downloaded it and decided to play. The camera in the game feels great and really does make the action feel more \"actiony\" and \"awesome\". \n\nThe game is stunning. I literally have a folder of screenshots I took ingame because exploring the maps would occasionally reward me with a spot that was just way too pretty. If your computer can handle it, the game will look like a modern AAA title (at least in the model department. terrain is forever doomed to look so-so).\n\nThe TERA community is pretty large and generally friendly (With exceptions I'll get into later), which means getting help or organizing raids isn't really that hard.\n\nTERA has an global market which is absolutely amazing. Absolutely everything can be aucitoned off or bought. This includes items such as actual paid premium and new character slots (albeit both are exceedingly expensive)\n\nAnd sadly that's pretty much where my praise ends. I have 3 characters at level 65 (max level) and one character almost there, but it wasn't the gameplay which made me stick around. In fact, I was pretty much ready to leave it before even hitting level 65. So we'll get into the main issues with the game.\n\n\nWhat sucked?\n\nThe game is an RPG with many different races and two genders to pick from. You may think this would mean there's a lot of customization, but you'd be wrong. Character customization suffers greatly from a lack of any content and the race skills for any race besides Humans (PVP), Amani (crafting ), and Elins (faster walk and clear 100% aggro) are pretty much useless. This leads to most characters looking pretty samey so it's hard to make an identity for yourself unless you shell over some real money to get some of the better cosmetics (though you can buy everything with ingame money including actual premium)\n\nStory is a huge letdown. I generally look forward to the lore of games because that's my butter and toast. However TERA's lore is a huge letdown. In addition, the lore isn't easily obtained and a lot of it sits behind dialogue. The issue with this of course is that the dialogue is primarily useless garbage that wouldn't help the player or progress the story. This means you either read everything or nothing.\n\nThe community is a toxic cesspit at times. While people are usually willing to help, if you play anything that isn't DPS, be prepared to get some pretty bad verbal abuse. The amount of harassment I've gotten for \"being a shit healer\" in low tier dungeons is awful, and it only gets worse once you reach tier 10 and onwards. People stop being friendly about the time you reach level 59 and god forbid you be anything but perfect. In fact, I've actually had entire raid groups sit around for 2 minutes JUST to kick someone who wasn't playing good enough according to them. I was kicked off just because I wasn't constantly healing our DPS with skills but was instead giving him motes while I focused on the tank. The community in high level play is god awful and jesus christ if you dare play support, you're going to get some of the most creatively vile thing said to you. Of course TERA has basically no censor so it's not like the system is going to give you a way to stop them.\n\nThe game is incredibly easy. The only difficulty is artifical and comes from enemies doing excessive amounts of damage and having excessive amounts of health. This is an issue when reaching tier 10 because guile equipment is going to be nowhere near good enough to even let you survive 1 hit from a tier 11 boss. This difficulty spike isn't actually difficulty, it's bad design. If you know what you're doing though, you can max a character in a single play session.\n\nEXP is awarded in the worst possible way. Instead of your EXP coming from both quests and dunegons, the only awards of substance come from dunegons. In fact, quests give you so little reward wise and lore wise that I'd reccomend actually skipping all side quests in their entirety. This is especially annoying because about all of them are either fetch quests or \"hey interact with this thing X times and come back to me\".\n\nPVP is easy to break. This is obvious if you've ever played a lancer and bothered to use the sockets that allow you to slow someone's cast time. It took an archer a little over 10 straight minutes to fire off one of his skills and while one of the most amusing things I have ever seen, i can also see it as an absolute nightmare for skills that can't be cancelled. Oh yeah and Mystics and Ninjas are brokenly overpowered and will never lose in PVP except against eachother. This is not a complaint, this is experience from someone who has a high leveled ninja and mystic.\n\n\nSo those are all my complaints. After all that though, you may be wondering what I think of the game and why I have 74+ hours in it. So I'll explain it all here.\n\nTERA was fun. I played it and enjoyed it as my very first MMORPG and have since played a bit with Riders of Icarus, Blade and Soul, Mabinogi, and some chinese one that I forget the name of. However I didn't get my playtime because TERA was this amazing game. In fact, I played it because I made a friend through it. I spent a bunch of time religiously playing this game during my honeymoon phase and even spent 17 straight hours ingame at one point, but the flaws began showing and it was hard to ignore them. But in the end, it was really fun to play cause I was playing it with a friend and I really enjoyed their company. The game's a simple easy game that's full of acton and is flashy as hell. In all honesty, it's a great game to just turn off your brain and chill out while playing. If you're a hardcore RPG fan, you're going to hate this game a lot. However if you're just wanting a game to chill out with and just have a few fun sessions in, TERA's worth a shot.\n\nThough only after they remove the malware \"anticheat\". That wasn't very nice of you Enmasse. Actually that was very annoying because now I can't play the game because I don't want a program scanning my computer and reporting its contents to god knows where. In fact, the negative portion of the review is exclusively to protest against this act of anti-consumerism. I really loved my time playing TERA and would otherwise gladly reccomend it.", "timestamp_created": 1534668431, "timestamp_updated": 1534668431, "voted_up": false, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.782356083393096924", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15866030": {"recommendationid": "15866030", "author": {"steamid": "76561198060162844", "num_games_owned": 364, "num_reviews": 6, "playtime_forever": 3827, "playtime_last_two_weeks": 0, "last_played": 1512350405}, "language": "english", "review": "You will quickly learn that MMORPG actually stands for \"Mostly Men Online Role Playing Girls\"\n\n10/10", "timestamp_created": 1431842410, "timestamp_updated": 1431842410, "voted_up": true, "votes_up": 1203, "votes_funny": 4138, "weighted_vote_score": "0.830378115177154541", "comment_count": 53, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45461431": {"recommendationid": "45461431", "author": {"steamid": "76561198100585731", "num_games_owned": 163, "num_reviews": 4, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1432295558}, "language": "english", "review": "Comes with spyware and the dev shuts down any discussion about the issue. 'Nuff said.", "timestamp_created": 1540632536, "timestamp_updated": 1540632536, "voted_up": false, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.748299002647399902", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15924506": {"recommendationid": "15924506", "author": {"steamid": "76561197988735037", "num_games_owned": 599, "num_reviews": 21, "playtime_forever": 25454, "playtime_last_two_weeks": 0, "last_played": 1452096585}, "language": "english", "review": "After playing so many MMO's previously among WoW for 7 years, Ever since i started TERA at CBT roughly 3+ years ago? and is still my go-to MMO fix today. It has been the only MMO i keep returning to and i could never play the typical target combat system MMO ever again. Game has excellent graphics, challenging, fluid & fun combat and best of all, FREE!\n\nAnd no, game is not P2W at all, heavily recommended.\n\n10/10 tho, go for it.\n\nThanks Enmasse Enternainment <3", "timestamp_created": 1432199508, "timestamp_updated": 1432199508, "voted_up": true, "votes_up": 100, "votes_funny": 5, "weighted_vote_score": "0.843223392963409424", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15944746": {"recommendationid": "15944746", "author": {"steamid": "76561198019009246", "num_games_owned": 249, "num_reviews": 18, "playtime_forever": 18846, "playtime_last_two_weeks": 0, "last_played": 1493199302}, "language": "english", "review": "The only game where you would not want to be a human unless you're pvp-ing.\n\nPay2win? No. Play4Free? Yes. Thank you En Masse for releasing it on Steam. I've been enjoying it so far. :)", "timestamp_created": 1432322803, "timestamp_updated": 1432322803, "voted_up": true, "votes_up": 163, "votes_funny": 12, "weighted_vote_score": "0.838827669620513916", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32832477": {"recommendationid": "32832477", "author": {"steamid": "76561198063304200", "num_games_owned": 132, "num_reviews": 5, "playtime_forever": 16696, "playtime_last_two_weeks": 0, "last_played": 1522986408}, "language": "english", "review": "[h1]EDIT AS OF OCTOBER 1ST 2018: Blueballs Studio decided to put spyware on their game. Don't download it.[/h1]\n\nBefore I say anything else: although I’ve clocked in over 200 hours into TERA, I think this game stands as a good short-term MMORPG. It’s good to experience it once if you’re interested in these types of games. \nHere are a short list of pros and cons.\n\n[h1]PROS:[/h1]\n- Combat is fast paced, fun. \n- You can level how you want, XP boosts aren’t super necessary.\n- There is a good number of cosmetic items to choose from, they’re completely optional and sometimes events will give you outfits temporarily. Some events give you a chance at permanent accessories. \n- The game is visually very pretty; the environments can change dramatically from one zone to another. \n- Fun to play with friends\n\n[h1]CONS:[/h1]\n- Recent patches are slow, new content is usually dungeons or new classes/class revamps. \n- Things like getting higher item level gear is hard to figure out to get unless you look at outside resources or find a good guild.\n- Leveling up might be considered too fast to some. \n- SOMETIMES you’ll run into TERA elitists that buy a lot of cosmetic items or think that founder status is special, when you can just buy it off sites such as amazon or G2A. \n- Most things in the game are very grind oriented, as usual.\n\nAlthough I enjoy this game, I can’t recommend it as of recent because of the amount of fanservice that they give to the player base. The game originated in Korea, which most likely has a more male dominated gaming community. There have been 4 gender-locked and race locked classes, two of which belong to the dominant race of the TERA world, the Elin/loli.\n \n[b]Valkyrie[/b]: Female gender locked and Castanic race locked\n[b]Gunner[/b]: Female gender locked and Castanic, High Elf race locked\n[b]Reaper[/b]: Female gender locked and Elin race locked\n[b]Ninja[/b]: Female gender locked and Elin race locked\n\nAll the original classes are available to all races and genders, but don’t expect any new content to go to male characters besides cosmetic items. Cosmetic items can be bought in the auction house and of course, they will be less expensive to buy when events are going on or when new classes come out, but the cosmetic items will only pertain to the new content (which is usually female character related). \n\n[u]Leveling[/u]\nIn terms of leveling, it’s super easy and you could complete 1-65 in one day if you wanted. You can level in any way you want, you can quest, or combine questing with dungeons, or completely level up only grinding dungeons. You can take as much or as little time as you want when you’re leveling. It’s very flexible. The combat is super fun and kind of addictive when it comes to fighting big mobs. The original classes get more of a challenge when fighting monsters, but the newer classes are so over powered that fighting is a breeze and you can solo dungeons for the most part. You’re playing a multiplayer game, right?\n\n[u]PvP[/u]\nPvP is obviously very confusing if you’re new, they don’t really give you much information in how Corsair Stronghold works, which is one of the first PvP maps that they introduce you to. You’ll have to look up outside information to understand how the PvP works in TERA. They recently got rid of Alliances, which were quite fun besides the constant adjustments they were making to this feature. Not many people participated because of how unrewarding it got. You joined one of the three alliances, and every week you would go into an instanced PvP zone and do quests for points. There was a leader board for who got the most points. They had runner ups, but the points would reset every week. So to keep your status up you had to spend countless hours grinding for points, only to have your rewards last for one week (you got a special mount, title, and accessory item for your off week). \n\n[u]Community[/u]\nThe TERA community from my personal experience hasn’t been super kind, you get ignored unless you look ridiculous or you’re decked out in the cosmetic items you bought using real money. Basically it’s a fight to be the cutest Elin in the general vicinity. Since 2014 I’ve had barely any player to player interaction, and that can make the game go sour pretty fast. Sometimes you can find a good, active guild that can help you, but for the most part a lot of the guild and players in the community stand around, AFK, and are pretty snobby if you try to interact with them.", "timestamp_created": 1498514548, "timestamp_updated": 1538376781, "voted_up": false, "votes_up": 115, "votes_funny": 5, "weighted_vote_score": "0.826959371566772461", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15794014": {"recommendationid": "15794014", "author": {"steamid": "76561197970555024", "num_games_owned": 793, "num_reviews": 98, "playtime_forever": 383320, "playtime_last_two_weeks": 0, "last_played": 1542666033}, "language": "english", "review": "I have hundreds and hundreds of hours on the game but I have only just downloaded it on Steam. It used to be available on Steam, then they took it off, now it is back on! Most of my play was while the game was not available on Steam, so please ignore the fact that Steam only says I have a few hours on the game. I have a lot, lot more! \n\nComing from an FPS background, Tera suits me down to the ground. It is a fantasy mmo with FPS controls. The scale of the game is enormous and the graphics are simply glorious. This is an ideal game for FPS players who would like to branch out in to fantasy mmo. \n\nThe depth and detail in the game is just staggering. It is one enormous open-world that you can freely wander about in, and it's absolutely breathtaking.\n\nThe highlight of the game tends to be the spectacular artwork and the combat system. Gameplay is actually pretty simple and repetative although the end-game dungeons are much more inventive than the main game itself. By the time you get to the end-game, you are pretty much bored to death of the rinse-repeat nature of the quests. \n\nThere is a comprehensive gathering and crafting system, but these days it is largely broken. \n\nThese is a very large achievement system with some very exclusive rewards. Of course there are exclusive items that need real money, but it's nice that you can obtain some genuinely desirable items through dedicated play. There are some really nice items that can won in a matter of hours and of course tons that can be obtained with in-game gold on the traders. \n\nUnfortunately, there are some aspects of the game that you will either love or hate. The costumes and rides are simply amazing, albeit you must be prepared for outfits that are very much out-of-character and really do change the atmosphere of the game. Police, nurse, maid outfits and so on. You can even be a pink bunny and fight with a giant carrot if you want. Also the game is generally much more sexist than we are used to in the West. Particularly with the Elin character the game borders on the edge of unacceptable.  Also, there is a very strong RNG elemtent to everything. From scoring damage all the way to buying items. Many of the highly exclusive items can not be dirrectly bought, but are in RNG boxes. This also applies to gear, in that gear \"enchanting\" ( which is esential ) is all based on RNG.\n\nOf course mmo's are really about the community and the community with Tera is generally good, albeit there are a lot of school kids playing the game because it's free. \n\nThere are a few downsides though. The first is that it has a very limited end-game. Once you have completed the main game, then there are a half dozen or so dungeons and fifteen or so dailies and that's it. It quickly becomes incredibly repetitive. So try to enjoy the game as much as you can while levelling, because once you are there you might give up pretty soon after. \n\nThe second problem, in my opinion, is that the end-game dungeons largely rely on leader selected parties, and unless you happen to be a top player, you are very unlikely to be ever selected for a party. I can honestly say that everyone I have seen leave the game has left it for this one reason alone. \n\nFinally, the EU version of the game is managed by Gameforge and they have completely wrecked the in-game economy. They have effectively made it Pay-To-Play, sapping every ounce of enjoyment out of the game unless you are a serious spend-a-holic. For that very reason the servers are much emptier than they were just a few short months ago, and everyone has been moving to Tera NA  ( North America ) where the game is managed so, so much better. \n\nRecommended?  Well, and here comes the surprising part -  the Steam version IS the American run version. So, no matter where you are, you get the very best the game has to offer. People outside the US can expect a larger ping, but don't worry, it's fine for most countries. So..YES...try it. There are issues, but the wonderful graphics and exciting game-play are a must try.", "timestamp_created": 1431389528, "timestamp_updated": 1481900757, "voted_up": true, "votes_up": 118, "votes_funny": 8, "weighted_vote_score": "0.828499078750610352", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32221627": {"recommendationid": "32221627", "author": {"steamid": "76561198098285134", "num_games_owned": 175, "num_reviews": 11, "playtime_forever": 3055, "playtime_last_two_weeks": 0, "last_played": 1530596105}, "language": "english", "review": "Found out how to gain 70 fps in the game.  Disable in game sounds.", "timestamp_created": 1496761861, "timestamp_updated": 1496761861, "voted_up": true, "votes_up": 104, "votes_funny": 72, "weighted_vote_score": "0.807125210762023926", "comment_count": 14, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43920730": {"recommendationid": "43920730", "author": {"steamid": "76561198101198719", "num_games_owned": 50, "num_reviews": 4, "playtime_forever": 1491, "playtime_last_two_weeks": 0, "last_played": 1516054260}, "language": "english", "review": "i think tera is a fine game, but with this Xigncode3 shit i dont think ill play until it is removed, ive tried to look up how to stop it from scaning my pc 24/7, but i dont know how to do anything no matter how much i read (i cant find a video to help me though it either) https://www.reddit.com/r/TeraPC/comments/8ot680/psa_upcoming_tera_na_patch_files_not_yet_deployed/\nthis sums up what Xigncode3 is. (if you dont know, of course) and how to fix it for people who know what they are doing\nif you have a link to a video that shows how to do this, i would realy appreciate a link, thank you", "timestamp_created": 1533353891, "timestamp_updated": 1533353891, "voted_up": false, "votes_up": 59, "votes_funny": 2, "weighted_vote_score": "0.786701679229736328", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48296323": {"recommendationid": "48296323", "author": {"steamid": "76561198165034918", "num_games_owned": 138, "num_reviews": 5, "playtime_forever": 64138, "playtime_last_two_weeks": 0, "last_played": 1550481227}, "language": "english", "review": "I have been playing Tera since the launch, and have seen this game go through so many drastic changes, from being pay to play, then to free to play. Cosmetics, classes, races, everything. While it is one of my favorite MMO's to this day, it is admittedly dying, and I have found queing for certain dungeons a hassle, as the wait times can vary from 15 minutes all the way to an hour depending on the time of day. HOWEVER. Despite all that, the game is still very lovely, and I would definitely give it a try! Sure the character customization is a tad more limited to that of ffxiv for instance, but for something free to play, it's top notch. The combat is still the best I have seen in ANY mmo, and the community is actually quiet friendly, and guilds very socialable. I have met a wide array of friends through Tera. I also find the races nice to look at, armor is decent, and cosmetics fantastic. Classes are exciting, and each one is so unique from one another, that it never feels like you are leveling the same character, and the game is not grindy, so if you wanted, you can easily try out each class. Though, one class per character, and unfortunently there are some race/gender locked classes, however I have heard those are changing and more races/genders are getting mutual classes to balance that out. Overall, I reccommend this game to anyone trying to find a new and exciting MMO to play. 10/10", "timestamp_created": 1547356300, "timestamp_updated": 1547356300, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.732963442802429199", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22687049": {"recommendationid": "22687049", "author": {"steamid": "76561198082456017", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 35243, "playtime_last_two_weeks": 0, "last_played": 1537875971}, "language": "english", "review": "So I bounce around between MMOs quite often. I've tried ESO, Aion, Rift, Runescape, WoW, Guild Wars, Blade and Soul, ect. But the one I keep coming back to is TERA. There's just something abut this game that the combat and story and world all comes together in somethng just right. So for those of you on the fence about this game here's how it goes:\n-The story is about as interesting as you can get in an MMO storyline, exactly how you want it. Mindless enough that you can grind for hours and not forget really where you are storyline wise.\n-The community is the friendliest I've ever seen (Keep in mind I really only play PvE) and we are all so helpful to each other. When questions are asked in world chat by new players they get legitemate help from everyone.\n-Dungeon runs are fun! The combat makes them fast paced and intense, I've ran through with full groups fairly easily or put up a real challenge and had only 2 of us go through a 5 man dungeon.\n-Weapons are class-bound, the weapon style you start with is what you get the whole game. Don't think of this as a negative though, when you're the priest in the party and that legendary staff drops then it's all yours.\n-Now the real bread and butter: the combat. The True-action combat is what makes this game. Sure games like Blade and Soul and ESO could be a little faster but the combat in TERA stays true to what it promises. If you miss your dodge or block, you will be punished for it. If you dodge roll into a powerful counter attack, it will do serious damage. Skill combo(ing) is up to you as a player and you'll discover certain skills flow better with others as far as animation timing goes. The combat is also freaking fun. You aren't simply trading blows with goblins for a few min then moving on, you're engaged and avoiding attacks and timing your own. \n\nTo sum it up: This game is free and I've sunk in almost 600 hours into it. There's a reason for that. The game is fun, fast-paced, and has a lot of replay value with so many classes. It's continued to keep my personal interest as developers are constantly working to update the game for us. I highly recommend it.", "timestamp_created": 1461846017, "timestamp_updated": 1461846017, "voted_up": true, "votes_up": 62, "votes_funny": 2, "weighted_vote_score": "0.797069251537322998", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22489757": {"recommendationid": "22489757", "author": {"steamid": "76561198027710310", "num_games_owned": 97, "num_reviews": 2, "playtime_forever": 6128, "playtime_last_two_weeks": 0, "last_played": 1461460035}, "language": "english", "review": "TERA is a good bit of fun, but in spite of how long it has been out, there are one or two apsects of it that could use some work, in my opinion.  Here is a short breakdown of what do and dont like about the game.\n\nPros:\n-Good character customization\n-Fairly graphically impressive\n-Unique/distinctive races and classes\n-The game rewards players for playing their class correctly\n-TERA sports a pretty well executed player-driven economy, which is helpful both making profits AND speeding along gear advancement\n\nCons\n-Some really cool classes are gender-locked, and even gender/race-locked.\n-Cosmetic items and faster mounts are hard to come by, although I can't really fault the devs for wanting to pay the bills.\n", "timestamp_created": 1460937224, "timestamp_updated": 1460937224, "voted_up": true, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.752083778381347656", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40270264": {"recommendationid": "40270264", "author": {"steamid": "76561198034075101", "num_games_owned": 130, "num_reviews": 4, "playtime_forever": 71172, "playtime_last_two_weeks": 0, "last_played": 1546739908}, "language": "english", "review": "Start New character, do quest until level 20 on irrelevant world, instance match until 60 if you're a tank or healer meanwhile DPS will atempt and end up grinding on irrelevant world anyways, Reach 60 and maybe do boring story quest to 64 then/or continue to grind Instance Dungeons or Grinding on Irrelevant World until 65, Reach End Game, Get End Game Gear on a limited selection of dungeons that commonly get recycled as a sad attempt to \"keep things fresh\" with the occsional new dungeon that feels no different than the others and question how the hell did you jump from tier 5 to tier 14ish gear, Grind to enchant your end game gear, 6-10 months later new update = soft end game gear reset because now a new tiers of equiment has been released litterally making a previous tier obselete and moving the others in their place (explains why Tier 6-1x doesn't exsist), Repeat from \"Grind to enchant your end game gear\" and slowly wither away as you question your life desicions up to this point.\n\nI regret everything including accidentally hitting the recommend button.", "timestamp_created": 1519197708, "timestamp_updated": 1519197708, "voted_up": true, "votes_up": 121, "votes_funny": 238, "weighted_vote_score": "0.782724976539611816", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23105263": {"recommendationid": "23105263", "author": {"steamid": "76561198048872732", "num_games_owned": 64, "num_reviews": 6, "playtime_forever": 260114, "playtime_last_two_weeks": 11202, "last_played": 1551862286}, "language": "english", "review": "Going for a honest and a crazy review\n\nThe Pros\n[list]\n[*]Fast paced combat, you have to actually aim the skills to cause actual damage\n[*]No paid items to get powered gear (You have to actually craft them, do dungeons, bribe/beg people to leave you drops, get reputation credits to earn them)\n[*]Friendly/crazy community (Way better than CS:GO, Dota or LoL)\n[*]Constantly getting updated (New class at least every year and or balancing on classes)\n[*]Cosmetics/Elite are the only thing that cost real money, you can sell them on broker to get money from other users to get other items at a really reasonable ratio\n[*]Fast queues on Instance Matching between servers\n[*]Support team will help you to recover wrongly used items (Hard to acquire designs when tried to broker it) / Ban bot users (Also boosters that want exarch for feeding the enemy intentionally)\n[/list]\n\nThe Cons\n\n[list]\n    [*]WHERE IS THE DAMN OPTIMIZATION?! \n    [*]Awakening Enchanting is a bitch (110 attempts and im still stuck with +12 -__-)...\n    [*]Instance Matching can be horrible (get queued with noobs/low geared/unskilled users/low DPS)\n    [*]Class balancing can be horrible\n    [*]Publisher is known to be quite a liar sometimes with their events...\n    [*]Elins are getting too much attention (Pedo alert detected)\n[/list]\n\nThe Lulz\n\n[olist]\n\n[*]Start the game as a High Elf\n[*]Started to hate Elins (lolis) at LV 65 (too many Elins annoy me!)\n[*]Went onto a Elin massacre at lowers-mid areas\n[*]Got Elin raids after me attempting to kill me (15 and yet cant kill me LOL)\n[*]Got killed by a bunch of Elins\n[*]Now im known as a Elin Hitler for murdering their kind\n\n[/olist]\n\n9/10 Would REMOVE ELINS again", "timestamp_created": 1463780598, "timestamp_updated": 1466485212, "voted_up": true, "votes_up": 78, "votes_funny": 131, "weighted_vote_score": "0.786398589611053467", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17214866": {"recommendationid": "17214866", "author": {"steamid": "76561198150797156", "num_games_owned": 106, "num_reviews": 21, "playtime_forever": 2286, "playtime_last_two_weeks": 0, "last_played": 1433016210}, "language": "english", "review": "Pros:\n-Absolutely free, there is no paying for advantage. \n-Cosmetics looks nice\n-Graphics are alright. some parts are awesome\n-(Very important) Fun with friends\n-Combat is nice\n\nCons:\n-Can get extremely boring without friends, after 40 hrs for me\n-Almost no story\n-Weapons and armors are kinda identical in terms of function\n\n7/10\n\n", "timestamp_created": 1437796222, "timestamp_updated": 1437796222, "voted_up": true, "votes_up": 54, "votes_funny": 4, "weighted_vote_score": "0.784741878509521484", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33633721": {"recommendationid": "33633721", "author": {"steamid": "76561198006172932", "num_games_owned": 135, "num_reviews": 2, "playtime_forever": 62190, "playtime_last_two_weeks": 0, "last_played": 1486012252}, "language": "english", "review": "I have been playing tera for a very long time,\nThe game first introduced to me in 2013 or 2014 and I put it down because of technical limitations and Real Life; I played again in 2015 and again because of real Life I was forced to put the game down.\n\nAnd I didnt play again until 2016 where I started to play more seriously and reach end-game content.\nI have thousands of logged hours in Tera outside of Steam (because of all the techinal issues presented while playing Tera through steam)\n\nBy no means am I an expert or \"Pro Elite Player\" I am just a normal average player with history playing this game.\nhere is my review for this after playing heavily for the last 2/3rd of the year.\n\nI'll break this down between the Pros and Cons:\n\nPro: \n1. Its free. \n2. If you are just getting into MMO type games Tera is a nice game to start with because it is very teamwork oriented and if you are not used to playing with others as a team or working with in-game mechanics in a team you will learn how to do this with this game. \n3. action combat!\n4. If you only care about cosmetics and stuff like that, Tera is a perfectly fine game for it.\n\nCon:\n1. Tera is unstable server wise. Every single thing you do effects your ping even using things from your inventory or putting things into your inventory will have a slight noticable ping related lag spike; which effects you in Dungeons especially. (example: there is an item called Noctinium infusions that 1 will be used depending on certain skills you use, while you have them active. Every single time you use the skill that uses 1, the game checks your entire inventory, every. single. Time.)\n\n2. If you do not live in the midwest Your ping will probably be somewhere between 70 and 300 consistently.\n   2a. Everyting in this game is ping reliant.\n\n3. [NOTE: 3rd party programs are against the Terms Of Service.]\nThe server stability and ping spiking is literally so bad that people who play the game have had to go out of their way to program 3rd party mods in order to play the game functionally the way that the game is supposed to be played. (ie: it removes ping reliance from all classes skills.) \n   3a. Skills are effected by Ping\n   3b. Skills are effected by FPS\n   3c. Eventually how well you can play depends on your Ping and FPS not on your actual skill and proficency at playing the game.\n\n4. Theres no Optimization or at least evidence of optimizations being made for the game. Even if you have the most beastly pc ever built on this planet You'll be lucky to see 40FPS and stay at 40FPS consistently. \n\n5. For some reason the Developers at Blue Hold Studios have stripped a ton of the content out of the game. \n    5a. They removed Most of the crafting options making it basically useless. except for 1 slightly newer branch of crafting.\n    5b. Gathering supplies (ore, plants, essence) is mainly used to level up guilds now and the yeild from it is pretty useless and not worth anything.\n    5c. Every content patch means your favorite dungeon goes away and a bunch of recycled ones come in.\n \n6. Guilds get virtually nothing. \nThe only content guilds have working for them besides simply leveling up the guild for extremely minor stat perks, and questing (for very tiny amounts of guild fund), is that once a week every saturday there is an optional PVP event that very few guilds actually participate in on any of the servers. Anywhere from only 5-15 guilds on any server actually participate and it has caused the ability for one guild on every server to monopolize the event for all of its worth almost completely uncontested or if contested it is like a bunch of flies against a swatter because that guild has the most players with the best gear and it does not matter at all how good they are at PVP if they have enough healers and classes with Pulling skills. (guilds used to have stuff such as reign over a region in which they could set a tax or simply remove the tax completely. or after that was removed they could own property in the game (sky castles) that you can see pointlessly floating all over the world still like a bunch of worthless lag inducing decorations. People used to be able to use those and hang out there.)\n\n7. Almost every single newer class that were not already defaults in the game have skills that will lag/desync everybody else simply because of their positioning and use or etc. (valkyries rune burst, ninjas 1000 cuts)\n\n8. More than 20 players in an area at once will cause everyone in that area FPS drops and ping spiking regardless of how good their computer runs anything else.\n\n9. in PVP the player with best ping wins everytime. \n     9a. in pvp when you initiate a duel you and your duel partner are more than likely to desync regardless of how good your Ping is or not.\n\n10. Most of the playerbase has abandoned this game.\n      10a. Most of what remains of the playerbase is bored, and so they parse in Tera more than any other game I have ever seen because theres just simply nothing else for them to do; as a result this has bred a slightly toxic environment that is not inviting or encouraging or helpful to new players trying to learn the game or improve. No one  has the patience or wants to accept someone that is \"new\" for their dg runs because of the constant parse. (literally i have seen people beg to reset a boss in DG simply because they didnt do a skillchain perfectly not even in score runs just in regular instances and dungeon queues)\n \n11. Levelling was updated to be made too easy so everyone reaching level 65 for the first time with a class they have never played barely knows what they are doing with it and most guides on the primary (3rd party) guide site is outdated.\n\n12. Gear \"stat rolling\", one of the most core parts of gearing currently is completely unexplained by the game and it is taught player to player only.\n\n13.theres a huge rift between the remaining supporting player base and the hosting company for NA. And the companies actions make it look extremely lazy. Things like, Getting a huge major update, and only applying those updatest to the steam version that people will download by default a week or several weeks later (causes steam to \"update\" and download the old version). Completely disregarding all support tickets because they had \"too many\", Not performing server maitenance on servers that are too old (or perhaps too cheap) to not be reset each week.\n\n14. Glitches and errors in the game that have been there for months and months or even YEARS are still there. (ex. A world boss named Humedras does not respawn. Ever. Except after Server resets. even after an update that forces almost all world boss to respawn every 2 hours except for 2 others which are on random 2-12 hour timers.)\n\n15. demand for unusual and ugly censorship of almost all of the default armor sets for Elins but putting them in teeny tiny spagetti string bikinis for cosmetic purpose are perfectly acceptable. (Google: Elin Censorship, to see how stupid it actually is)\n\n16. In dungeons if your ping is higher the \"safe zones\" during red aoe mechanics (in and out, pies etc.) are really more like a chance of luck and guessing. You might not get hit. But you probably will unless you're a safe 2m from the edge of any AOE.\n\n17. Most classes except for the new ones have so many skills that you will probably end up buying a mouse with 2-5 more buttons on it just so that you can use them all correctly.\n    17a. You have to pretty much rebind all of your default hotbar keys in order to play functionally.\n\n18. Organically getting gold in this game is really hard. None of the higher up BAMS drop gold so you cant grind for it. You can grind for it through Questing and dungeons in minor amounts. Getting gold is best done through the playerbase Market (trade broker) So anyone new in the game who doesnt want to spend real money to sell something off the cash shop will have a hard time gaining starting support funds that they will need for a variety of things.", "timestamp_created": 1500396627, "timestamp_updated": 1500397683, "voted_up": false, "votes_up": 117, "votes_funny": 5, "weighted_vote_score": "0.791682779788970947", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16264208": {"recommendationid": "16264208", "author": {"steamid": "76561198023054846", "num_games_owned": 110, "num_reviews": 12, "playtime_forever": 4790, "playtime_last_two_weeks": 0, "last_played": 1472879081}, "language": "english", "review": "You get a lot of bang for no buck at all.\n\nSeriously, this game has a lot of content. The combat system is incredibly complex and strategic for an mmo, and the game is very far from P2W. The F2P model here is similar to league of legends where you don't have to pay for anything at all, but you're given the option to pay for fashion and some minor conveniences.\n\n", "timestamp_created": 1433789204, "timestamp_updated": 1433789204, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.668571233749389648", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15716554": {"recommendationid": "15716554", "author": {"steamid": "76561198119670876", "num_games_owned": 204, "num_reviews": 4, "playtime_forever": 39610, "playtime_last_two_weeks": 0, "last_played": 1513288702}, "language": "english", "review": "Do I recommend this game?  Do I recommend the soul-sucking monster of an MMO that has, effectively, ruined my life?  Yes, I do.  I started playing Tera over a year ago- January of last year, actually; I just checked- and while I've had brief breaks during that time, I've still been playing through the majority of the time that I've had the game downloaded.\n\nFor the first several months, I was absolutely a casual player, slowly leveling up my main.  (Who was, at the time, a warrior-class Castanic; now I main an Elin reaper, though as of the gunner's release, I'm liking it an awful lot.  Oh lord.  But I digress.)  I really didn't know much about my class at all, and looking back, there're some things that I [i]really[/i] wish I'd known.\n\nEventually, however, after shuffling servers for a bit (before returning to my main server- VoT), I hit level 60, which was the level cap at the time.  It was pretty damnably satisfying, I have to admit.  Then I decided to work on my reaper, and I think that's about when I changed from very casual, to playing the game a hell of a lot more than I had been before, almost exclusively on my reaper.\n\nThe gameplay is addictive- while the initial grind to the level can get tedious, it's most definitely doable within a few weeks, if you're playing fairly casually, and within a few days if you're really working on it.  For example, I made my gunner earlier today, and so far I've gotten her to level 31; the class came out around 24 hours ago, as of writing this review, and I know that people have already gotten their gunners to 65.  Of course, they were racing in order to get an achievement, but still, the point stands- it's possible to go a long way, solo, in a fairly short span of time.\n\nBut once you hit the level cap, that's really where most of the harder PvE content begins, and honestly, where you really start to learn your class.  Not that you learn [i]nothing[/i] before then, but you definitely learn quicker what you should and shouldn't do when you're getting oneshotted repeatedly, due to using a dodge skill before it was really necessary.\n\nThis is something I've learned the hard way, unfortunately.\n\nAdmittedly, there [i]is[/i] a definite tendency for the same enemies to be re-colored, and used over again, without really changing the mechanics of the fight at all.  But at the same time, it's important to note that there's no tab-targeting in this game, and- as far as I'm aware- there aren't a whole lot of lock-on skills either.\n\nFor a comparison of how the controls work (at least for moving your character- the skills are another story entirely), think Skyrim.  You have the WASD pad, and a free-moving third person camera, and a menu that pulls up when you hit ESC.  (Or rather, it [i]was[/i] where you hit ESC and it pulled up.  Now you have to go into the UI Options in order to set it to do so, which I'd honestly recommend, because otherwise the screen looks cluttered, and it's not like you can click on it without hitting ESC anyway, since the mouse controls the camera.)\n\nThen the skills are on a fairly standard scheme, where you have one row of skills as the number keys just above the keyboard, and another row as the F keys above that.  This can also be changed, and easily.  Just find keybinds that work for you, and work out which skill you want to put on which key as you go, since you get more skills as you level.\n\nAnyway, I'm rambling.\n\n\n\nGraphics:\n4/5 - They're [i]gorgeous[/i], but I have to deck a star due to the fact that, generally speaking, you have to turn the video settings down in order to not have a whole lot of graphical lag.  And even then, you might still get an only half-decent framerate.\n\nCharacter creation/customization:\n4/5 - Again, there're some seriously gorgeous characters that you can make with this game.  But then, you can also make some of the most horrifying, hideous, eye-searing, Lovecraft-worthy abominations you can imagine.  Just try hitting the randomize button.  Trust me.  Then, some of the facial types/adornments tend to look better than others, though fiddling with the sliders tends to work wonders on almost any of them.  (Almost.  There are some that not even I can save.)\n\nAnd the costumes.\n\nOh my god, the costumes.  Since the initial publishers tend to make most of their revenue off of costumes for Elins, along with female Castanics/Elves, the costumes tend to be more focused around them.  And generally, I have no complaints, since those are also what I tend to play as.  One of the most recent batches of costumes is absolutely [i]glorious[/i], except for a pretty glaring bug on some of the dresses.  Ahem.  They really should've caught that.  [b]But anyway,[/b] if you're going to be playing as a race other than a female Elin/Castanic/Elf, and costumes are something vital to your experience, just note that your choices are going to be more limited.\n\n(On the bright side, however, you can also get dyeable costume versions of basically all any and all of the armor in the game- with things called fashion coupons- for any race/gender/class out there.)\n\nGameplay:\n5/5 - Like I mentioned, the initial leveling process can be a bit tedious, but I'm still giving gameplay- in general- five stars, due to the fact that the combat in general is the best I've come across, in any MMO.  PvP is extremely fun, as are the hard-mode dungeons, and that's not even mentioning open-world PvP on three of the servers, and the battlegrounds, which are, in essence, two teams of players pitted against each other.  In Corsairs' Stronghold, for example, you have two raids of twenty people each, trying to beat each other.\n\n(The goal is either to defend a crystal/break the crystal, with one team on offense and the other on defense, for the first round, and then the roles are reversed- the team that was defending the crystal has to do slightly more damage than the other team managed in the last round, within the same amount of time, or less, and the other team has to attempt to keep them from getting that much damage, until the time of the match runs out.  It's ridiculously fun, but I'd definitely recommend looking up guides on Corsairs' Stronghold before you actually try it, so that you're not running around like a headless chicken, with no idea what you're doing, or where you're going.  Corsairs' Stronghold is unlocked at level 30, by the way, with the rest of the battlegrounds unlocking at 65, I think?)\n\nSo, yeah.  The PvP is phenomenal.  Just note that if you decide to play on a PvP server, it's best if you switch off of the main channel while you're leveling, and until you have at least decent gear.  (Oh, and if you're planning on doing PvP, [i]save the boxes you get.[/i]  The next cycle of highest-tier gear will require materials that come from the boxes, so it would be a good idea to save them from the start, if you can stand it.)\n\nAtmosphere:\n4/5 - While some of the costumes can be immersion-breaking, if that's something you're concerned about, I honestly think that the atmosphere of most of the areas in the game more than make up for it.  If you get a chance, check out the location called Scythera Fae.  Just be careful not to go too far outside of the town, seeing as it's a high-level area.\n\nCommunity:\n?/5 - It really depends, honestly.  There're nice people, fantastic people, really ridiculously rude people, and straight-up asshats- along with everyone in between- just like anywhere else.  Really, though, I haven't had a bad experience with the other players at all, which is pretty nice.  (It helps that En Masse has excellent support, and that the block system is easily implemented if there's someone that's really grating on your nerves.)\n\nOverall:\n5/5 - After the time I've spent playing this game, I think it would be dishonest to give it anything less.  Even if it has its flaws, it's fun and graphically gorgeous, with the best combat and PvP that I've seen to date.", "timestamp_created": 1430938272, "timestamp_updated": 1430938272, "voted_up": true, "votes_up": 49, "votes_funny": 4, "weighted_vote_score": "0.775415360927581787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25429894": {"recommendationid": "25429894", "author": {"steamid": "76561198112303240", "num_games_owned": 59, "num_reviews": 2, "playtime_forever": 88261, "playtime_last_two_weeks": 0, "last_played": 1474402955}, "language": "english", "review": "(Note: I had tera for a year before it came out on steam, so my steam hours are off)\n\n(CURRENT PATCH: Guilds have been fucked in the ass. They are, once again, rehauling an entire system, and doing it poorly. They've gone and introduced a new way to grind. This time they are removing what we already had (Guild bank) and offering it as a \"reward\" if your guild grinds enough. PLEASE DON'T PLAY THIS GAME)\n\nNot enough room to rant about the \"Reward System\", have a look for yourself.\nhttps://tera-forums.enmasse.com/forums/general-discussion/topics/A-Journey-into-Money\nNote: I could buy a full year or two of college tuition with the amount of money it takes to reach the final tier. I'm not joking.\n\nForum Players Reply to \"Is this game worth coming back to\"(Note that players on the forums are usually part of the most active group. I mean, they actually use the forum for the game): http://forums.enmasse.com/tera/discussion/7552/is-the-game-worth-coming-back-to\n\nA year or two ago, I might have recommend this game. Now? No, Never.\n\n\nThe first 100 hours or so are enjoyable, but, barely.\n\nThis game is going down hill very very quickly. BlueHole Studios has turned it into an RNG cash grab with many many MANY female only items. I would say gender locked, but that would imply that males get locked items too.\n\nClasses, Inner Armor, Skills, emotes you name it, it has a female only gender lock.\n\nThe balancing in this game is the worst I have ever seen. They do not care about PVP. Once a new class comes out it dominates PVE and PVP. They want you to buy items for it and play it. Once about a month or two goes by they nerf the living FUCK out of it. It becomes one of the worst classes in it's category. (DPS/TANK). BlueHole does not care about decent content or its players. They only care about getting your money.\n\nJust recently they had to merge 3 servers into a single server. Why? Because they don't have enough players for 3 servers. EME (En masse) had huge layoffs earlier this year due to the game becoming unprofitable for them. Because many of the players who joined years ago couldn't take the crap that BHS was feeding them. Want an example? Go look up \"Tera +15 Gear\". The dungeons are rarely ever something new. 2 bosses then big boss. Best gear requires you to farm the same dungeon 50+ times. 150+ times if you are using LFG. The progression is boringly linear.\n\nThe community can be decent, but if you play on the rp server prepare to see a lot of guys playing as chicks trying to get free items. Females doing the same. If you play on a PVP server there is more salt than the dead sea. PVP rewards are also terrible. The desync/frame drops in battleground are absurd.\n\nAnd don't get me started on FPS. You have a gtx 1080 + 6700k? Cool, here's 30fps in a dungeon. \nBHS response to this? \"Meh, give us money\"\n\n\nThe fps problem has been around since CLOSED BETA. FOUR YEARS AGO.\n\nWhile I'm on the topic of poor optimization I might as well point out some other things.\n\n1) They had an issue with windows built in defender cause the game to lag and stutter like crazy. It's still a problem\n2) It is EXPECTED that patches make the game super buggy on release. Every player knows that patch day is:\nRandomly Downed Servers\nRandom Hotfixes\nHorrific bugs\nPotentially worse(And permanent) FPS Drops.\n\nIt's gotten to the point that even events are painfully obviously marketed at players to just return to the game. One such event was ran months ago and to \"participate\" you had to log in, and increase your hours played. That's it, you literally just had to play. No special quests, no fun exploring. Just logging in and afking in lubetown.\n\nGear progression is the same every single patch with little to no attempt to improve it. Even worse, the patches are coming at such a rate that players who got the BIS(Best in Slot) gear one patch have only two or three months before a new set is released. That's if you are full grinding every day non stop.\n\nGoing to put in big bold letters here\n=======================================\nTHIS IS NOT A GAME FOR CASUAL PLAYERS. YOU WILL BE EATEN ALIVE BY TOXIC VETS, GEAR PROGRESSION WILL MAKE YOU QUIT ON THE SECOND TIER AT 65(Disco/Schisma/Slaughter ect). RNG GODS HAVE FORBIDDEN US FROM GOOD ENCHANTMENTS. GOLD ENCHANTER HAS BEEN REMOVED FROM THE GAME. YOU MUST PUT IN A MINIMUM 4-6 HOURS A DAY FOR GOOD STEADY (but cringe worthy) GEAR PROGRESSION.\n=======================================\n\nThere is such a drastic gap between the first and second set of gear, both in enchantment mats and power that most *casual* players will never see hardmode or true final dungeons. As they will not have the gear to run it.\n\nThis studio doesn't care about the players, and doesn't care about the game. Just let this game die already.\n\nIf you have any questions about something specific comment here, I will try to answer the best I can.\n\n================================================\nBelow is a forum post i created many moons ago on the tera forum page. Many Many of these points still stand and they did NOTHING (Other than the creation of a \"player concial\" that, well doesn't do much)\n\nLink to page(With many replies to forum post): https://tera-forums.enmasse.com/forums/general-discussion/topics/Recent-shenanigans-Revised\n\nTo tera players, below is information that has been collected over the year from both BHS and EME. \n\nThese are things that the companies did or did not do outside of the game.\n\nI have read through the rules prior to posting this. I have read through them CLOSELY, so this should be fine to post.\n\nBHS is a business and they will make items with the lowest cost to profit ratio. What does that entail?\n\nElin only costumes.\nFemale Classes.\nFemale only costumes/Items\nRe-skined mounts.\nPoor designed/implemented cosmetics. (non-animated wings that don't even sit on the back correctly)\n\nWith larger profits from the above items they lose the incentive to create:\n\nBug Patches. (large bugs)\nMale costumes.\nMale Classes. \nNew animated cosmetics\nand finally Optimization patches.\n\nWith them pushing out low cost to profit content (Such as female only classes, and bad cosmetics) they are leaving larger issues, like desync/UI/Improper coding behind.\n\nBelow are some things i have noticed, that are easy to fix but have yet been fixed.\n\nExamples:\n1) Gathering resources at resource cap continues to pop up message/when already mastered a craft notice that \"this cannot increase your crafting level\" still pops up. \n\n2)Improper string(or words, for those who don't program). The other day i saw a post that a gunner was alerted they do not have enough \"resolve\" to use a skill. Why did this happen? Most likely because the willpower/rage system is based on the RE system and they didn't change one of the strings in the code.\n\n3)Poorly implemented ScaleForm api that most likely suffers from stovepiping (Wiki : https://en.wikipedia.org/wiki/Stovepipe_system | More: https://sourcemaking.com/antipatterns/stovepipe-system)\n\n4)Glyphs that are no longer used, are still in Vanguard glyph boxes. I opened a box and got a glyph that said \"this is no longer used\". Just remove the item ID from the array that the program uses to select the item to be received?\n\n5) Queue estimation times are improperly handled and don't represent your individual queue type, or just don't exists.. (Dps, Heal, or Tank times)\n\n6)Gunner passive using the SAME text as the reapers. (Will brawler too? how many classes can the shadow save?)\n\nwith lack of proper content I can see this game becoming more and more unbearable and boring to play. I'm not saying it's going to die. Too many people have dumped money into the game. I am saying that it will get to the point that players consider the game a chore with a social aspect attached.", "timestamp_created": 1473444877, "timestamp_updated": 1476029591, "voted_up": false, "votes_up": 115, "votes_funny": 9, "weighted_vote_score": "0.778102695941925049", "comment_count": 30, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17870491": {"recommendationid": "17870491", "author": {"steamid": "76561198080604772", "num_games_owned": 135, "num_reviews": 20, "playtime_forever": 19993, "playtime_last_two_weeks": 0, "last_played": 1547527586}, "language": "english", "review": "I'm a 6'5 male, but some part of me always wanted to be a tiny loli with bunny ears. Thanks Tera, for making my dreams come true.", "timestamp_created": 1441328420, "timestamp_updated": 1441328420, "voted_up": true, "votes_up": 260, "votes_funny": 695, "weighted_vote_score": "0.80318450927734375", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16052189": {"recommendationid": "16052189", "author": {"steamid": "76561197963831500", "num_games_owned": 368, "num_reviews": 11, "playtime_forever": 880, "playtime_last_two_weeks": 0, "last_played": 1433119044}, "language": "english", "review": "So I went in to this with low expectations, mostly due to it being free but hey, I was in the mood for an MMO so why not go with a free one? I wasn't too impressed with the tutorial line of missions at the beginning and was considering putting it down after going some ways past the tutorial along the story line where up until that point it had just been nothing but killing piss easy enemies and playing errand boy when a member of the guild I joined told me to just ditch the shitty quest and start making my way to some place called Devian Silva. So I did and what do you know, the game actually started getting fun. \n\nThe game really shines when you're fighting enemies a couple levels above you. I thought the stuff in the description about \"true action combat\" was a load of crap but when you're fighting tougher enemies mashing attack no longer becomes the most viable strategy. I had rolled a lancer and found myself actually blocking, dodging, and being fairly methodical when it came to chaining abilities and combos together, especially when it came dealing with enemies around 3-4 levels higher than me. Hell, it actually gave me some dark souls vibes and I found myself having genuine fun. Incidentally I was gaining much more XP this way than just picking some flowers for some random NPC. \n\nIt's an MMO that rewards you for pushing your character as far as you can (although there is a limit. Tried taking on some much higher level enemies outside the main city and I couldn't even damage them. They ended up killing me in one hit) with fun and challenging combat and punishes you for trying to take safer routes (i.e. taking on enemies lower or equal to you or just running through a bunch of fetch quests to level up) for character progression with boredom and tedium. \n\nAside from the frequent spouting of 4chan memes, \"lel\", and talking about waifus, the community doesn't seem half bad either. The people in my guild seem pretty chill and I've sat around campfires in towns with random groups of strangers and just shot the shit and cracked jokes. It's nice to see a F2P MMO where people use chat for more than just spamming trade offers.\n\nI'd definitely recommend it.", "timestamp_created": 1432885494, "timestamp_updated": 1432885494, "voted_up": true, "votes_up": 42, "votes_funny": 10, "weighted_vote_score": "0.794329941272735596", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21147575": {"recommendationid": "21147575", "author": {"steamid": "76561198072201859", "num_games_owned": 434, "num_reviews": 27, "playtime_forever": 64937, "playtime_last_two_weeks": 0, "last_played": 1544564711}, "language": "english", "review": "Tera have one of the best combat sysrem in mmo's and a very nice community that is very importent in those kind of games.\nThe dungeond are nice too. One thing i don't like is the quests they are a bit boring for me.\n\nSorry about my English :(", "timestamp_created": 1455270616, "timestamp_updated": 1535538468, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.714869320392608643", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15892108": {"recommendationid": "15892108", "author": {"steamid": "76561198025653291", "num_games_owned": 14301, "num_reviews": 17, "playtime_forever": 16159, "playtime_last_two_weeks": 0, "last_played": 1540821458}, "language": "english", "review": "Free MMO - so try it out. \nIf you are a fan of World of Warcraft you will most likely like this game too.\nMuch like World of Warcraft you take quests from quest givers and participate in guilds (if you chose)  and party raids and dungeons.\nYou can design your character and how it looks with good detail. \nVery good graphics and controls for movement. \nYou can team with others to finish quests. Or play solo - it is your choice. \nVery enjoyable game.", "timestamp_created": 1431990069, "timestamp_updated": 1431990069, "voted_up": true, "votes_up": 220, "votes_funny": 23, "weighted_vote_score": "0.779960930347442627", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45353839": {"recommendationid": "45353839", "author": {"steamid": "76561198006884378", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 11978, "playtime_last_two_weeks": 0, "last_played": 1540026659}, "language": "english", "review": "Butchered the game for the past 3 years. \n\nSpyware.", "timestamp_created": 1540030039, "timestamp_updated": 1540030039, "voted_up": false, "votes_up": 68, "votes_funny": 7, "weighted_vote_score": "0.777193725109100342", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15820627": {"recommendationid": "15820627", "author": {"steamid": "76561198069848552", "num_games_owned": 505, "num_reviews": 5, "playtime_forever": 9517, "playtime_last_two_weeks": 0, "last_played": 1457631765}, "language": "english", "review": "I haven't seen my family and friends in days.\n\n10/10 Best game", "timestamp_created": 1431580127, "timestamp_updated": 1431580127, "voted_up": true, "votes_up": 225, "votes_funny": 481, "weighted_vote_score": "0.80445176362991333", "comment_count": 8, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319431": {"recommendationid": "25319431", "author": {"steamid": "76561198037516046", "num_games_owned": 56, "num_reviews": 5, "playtime_forever": 5606, "playtime_last_two_weeks": 0, "last_played": 1544727913}, "language": "english", "review": "Alright, with a good mixture of both negative and positive reviews, I think this game is worthy of a recommendation. A light one, but still a recommendation. \n\nLet's start with the cons, so you can know immediately what's wrong with the game and if there's any deal breakers for you. \n\n-Loli/Female locked classes: There are certain classes specific to the Elin, or just female characters. It's not that big of a deal, but I can see why some people wouldn't like it. Ninja, Brawler, and Reapers are only female/loli characters. \n\n-Story is underwhelming: Honestly, some of it is good. Better than average at some points. But a lot of the story is meh, and having to replay the intro with every new character you make is rather annoying. The quests once you're level 60 are better, but still lackluster. \n\n-So you hit max level! What now?: Hitting level 65 feels good at first, gives you new PVP maps, and even dungeons for higher level gear. But that's barely satisfying. It takes a while to amp up your gear to even do the dungeons, and also a lot of in game gold. It's not super hard to obtain gold, however it could be a bit easier.\n\n-Lack of armor/weapon creativity: The female characters are basically lewd and most armors cater to that. Male characters? Oh hey, we look OP but all basically wear the same S---. Beyond character creation, the customization through in game armors and etc is lacking. You either pay cash for decent stuff, or grind to get an unimaginable amount of gold for costumes. Mostly negative, but at least you DO have the option to get nice stuff with in game currency. \n\n-------------------------------\n\nThe pros! Now you can know why I give this a recommendation! \n\n+The fighting is epic: The chaining of combos and quick pace has never been this good in most MMOs I've played. Similar to Blade and Soul, the fighting is fluid and makes you feel like you are IN CONTROL of your fight. Although be warned, it takes skill for PVP. Even some of the bosses can kick your S*** in. Although that's not a downfall, is it? A challenge is always good. \n\n+Leveling isn't as grindy as you think: This game makes leveling easy depending on how you go about it. Raids and Daily Quests give you more XP than normal quests, and could be more fun. You could grind if you choose- but in 3 days time I got to max level (65). Made me enjoy the game because I didn't have to grind for a ridiculously long time, or have dead end spots where it was difficult to grind. \n\n+The community: As far as some negative reviews go, I've never actually experienced a bad time that often. Maybe once or twice my raid group got antsy or a bit rude, but overall most people have been chill. I feel like they caused their own bad times, honestly. If you're chill- the people are chill. If you're an a--, then they are. Not that hard to realize.\n\n+Great with friends: Playing with friends is awesome. Or even online friends. I've been able to be in groups of 5 or more and all take on dungeons or raids. It's an MMO that allows you and your friends to build the ideal composition and take on difficult bosses together. Also dueling... Well, assert your hilarious dominance among them as well.  \n\n+Dueling is fun to both watch and be part of: I've seen duels in front of me in many areas, and you can make a friendly wager- or just duel for fun outside of PvP arenas. It's interesting for high levels to go at it, and fun to watch everyone do. It's interesting to see which class is the underdog, and also see how they can outplay another class witha certain strategy. \n\n\nIN BETWEENS - THINGS THAT MAY OR MAY NOT BE BAD/GOOD.\n\n-/+ Customization: Requires fashion coupons- which are easy once you're a higher level, or lots of gold. Again, gold is not THAT hard to obtain, but it still requires a ridiculous amount for decent aesthetics. This is \"pay to look decent\" or \"grind to look decent\" kind of game.  \n\n-/+ Replayability is lacking: Replaying? Nah. Story isn't good enough, but the classes? Well, those provide enough action or change of gameplay to give me a reason to start a new character. This could be a drawback, but it could also be good. A new class with a whole new playstyle could make you want to play all over again. But that's up to you.\n\n-/+ can get boring: The game has its pros and cons with story and gameplay, but depending on how hardcore of a fan you are for MMOs, it can get boring. Trying out duels, maxing gear or learning new tricks is a good way to keep this game fun, but if you're not willing- it might die out for you. \n\n\nThis review points out my pros and cons, as well as in betweens. I'm no expert, but I enjoyed the game enough to share my thoughts and I hope you could use this review as a way to determine whether or not it's worth it. \n\nAs far as a first playthrough is concerned, I think a general player will enjoy the action enough to play for a while. If you do play and decide you like it, I'm on Ascension Valley as Koimaomai. Thank you for reading~", "timestamp_created": 1472886510, "timestamp_updated": 1473108017, "voted_up": true, "votes_up": 43, "votes_funny": 2, "weighted_vote_score": "0.822262287139892578", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16959229": {"recommendationid": "16959229", "author": {"steamid": "76561198048236140", "num_games_owned": 132, "num_reviews": 13, "playtime_forever": 3499, "playtime_last_two_weeks": 0, "last_played": 1523307957}, "language": "english", "review": "As a veteran MMO player (wow, eve, guildwars2, swtor, etc.) Tera is one of my favourites. the game has many of the same things you find in most mmos and free to play mmos such as a subcription model that provides benefits to those willing to pay monthly, thankfully this does not take away from the free to play side unlike most mmos that offer subscription options, Dungeons and Raids, PVP to a crazy extent, etc.. The micro transactions are not game breaking from my experience and most things can be purchased with in game gold from the player market. \nMy favourite aspect of Tera and the main reason to choose it over other free to play option on the market is the combat, they dont lie when they promise true action combat, using your skills plus generic attack feels fluid, dodging/blocking in combat are both key. all in all best mmo combat I have experienced. \nLast word, dont wanna make this a long read but if you are looking for a fun, hack and slash mmo with fun monsters and decent depth Tera is for you.\n\nEdit- 04/25/2017\nOk, havent played the game in a while but with latest update and new classes thought I would come back for a bit as the combat is still one of the best I have seen implmented by an MMO. Now this next part is gonna sound sexist but I am actually asking for equality. There are a ton of new classes, Reaver, Gunner, Brawler, Valkyrie, etc. They each look pretty sweet however they have all been made gender specific to female. I like to play male as I feel more immersed(sounds odd, I know) as such despite all these new classes offering new experiences they seem closed off to me. If this does not bother you I still recommend this game as mentioned in my earlier review, however I feel somewhat neglected that all the new classes since this game has been available on steam are gender specific(all female). Once again I appologize but that is my honest opinion.", "timestamp_created": 1436454676, "timestamp_updated": 1493159853, "voted_up": true, "votes_up": 37, "votes_funny": 3, "weighted_vote_score": "0.712910175323486328", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26406815": {"recommendationid": "26406815", "author": {"steamid": "76561198035529717", "num_games_owned": 183, "num_reviews": 1, "playtime_forever": 1226, "playtime_last_two_weeks": 0, "last_played": 1478301552}, "language": "english", "review": "I install it once a year, play relentlessly for a couple weeks, and uninstall again. It's simple, satisfying, generally palatable. Once I stop reading the text, I realize how much of a grind TERA can be, which is why my binges only last a few weeks.", "timestamp_created": 1478211203, "timestamp_updated": 1478211203, "voted_up": true, "votes_up": 33, "votes_funny": 8, "weighted_vote_score": "0.75663524866104126", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31190341": {"recommendationid": "31190341", "author": {"steamid": "76561197995204251", "num_games_owned": 1651, "num_reviews": 29, "playtime_forever": 12886, "playtime_last_two_weeks": 0, "last_played": 1492888914}, "language": "english", "review": "Hmmm... how to rate this one?  Well, it's got a few fun hours in it, I'll give it that, but it seems less and less fun every time I come back to it.  I will admit though, Tera has the best combat system of all MMOs I've played and that's one major reason why this game even sparks any interest in me anymore.  Aside from that, I really gotta tell ya, En Masse Entertainment has done an absolutely excellent job at eliminating any sort of actual randomness, fun, or individuality from this game.  It's Free to Play so they must also think that means \"Free of any fun to play\".\n\nI came back this latest time to try out the newest class, the Valkyrie.  The last time I played, I started just as they were introducing the Gunner.  It seems that every time a new class is introduced, it's OP as hell.  So, you can tell that leveling a new Valkyrie was about as fun and challenging as stomping on an ant hill.  I'm still not all the way to 65 with her yet (yes, \"her\"... the Valkyrie is limited to Castanic females only.... also similar to the Gunner which is limited to Castanic or High Elf females, or the Reaper which is limited to Elin, a race of all females... not sure what to make of these race/gender limited classes yet) but I'm not sure I want to continue.  Things have been so cut and dried in this game it's not really that fun leveling anymore.\n\nFor one, there are no random loot drops anymore.  Anything that does drop is either currency, mats for enchanting, and maybe a surprise lock box.  I haven't opened any lock boxes yet because I figure I'm just going to be disappointed... and because the keys aren't cheap.  But the point is that there used to be at least a few gear items that would drop so you could at least swap out pieces of armor or weapons here and there, or even use those weapons and armor to help gear an alt or even use those extra pieces to create a unique look or something.  But nope... all of that's gone and what's left is a field full of cookie cutter sameness amongst everyone leveling.  Boring.  Costumes are available which allow you to turn what you're wearing into something that looks completely different, but most of those are $$$.... did I mention this game was F2P?\n\nThere's also the lack of anything to do besides leveling while you're out in the field.  Sure, you can hunt things, but once again... no loot drops... so why?  Well, for that almighty experience that is.  Because the devs want you to get to endgame to do more grinding for actual gear drops in dungeons.  This appeals to me just about as much as sticking icepicks under my fingernails.  Not only because the gameplay has been boiled down to how high you can get your gear score, but because that number is then used by others as some sort of gauge of your skill, which it is not.\n\nLeveling is as simple as \"Kill a few of those creatures\", \"Kill creature for item\" or \"Talk to that person at that place\"... probably to boil down leveling to such basic mundane tasks that you can do these things in as little time as possible.  I mean, hey, it's Free to Play, right?  Why give premium content like \"interesting stuff\" away for free?  There isn't even any real reason to stop to work on crafting skills because by the time you work your crafting skills up high enough to craft the next level of armor or weapon or whatever, you've out leveled it.  But if you examine the crafting system in depth, it's almost like the game is designed to severely discourage you from crafting in the first place.  You have a daily limit of crafting points (which are used up even for mundane tasks like gathering or mining, as well as the actual crafting of items)... once those are used up, you are disallowed from any further crafting and you have to wait until those points very slowly replenish over the next 24 hours.  But you should know better anyway... the devs have made it clear that crafters are weak and stupid and you should really be out fighting and leveling like a good little drone.\n\nBut ya... so if you're one of those \"Gotta get to end game so I can group up with other toxic players to repeatedly run dungeons to gear up my character so I can stand around in a group of all similarly geared characters just to be able to run other dungeons and get more gear to look slightly different until everyone has that gear too!\" then this game is definitely for you!\n\nAt least the overly sexed up girls are something to look at............................................... (until you get bored of that too).\n\nAnd what's with the hands on these female avatars anyway?  You got super hot pole dancer strippers with more curves than an F1 racetrack for avatars, but they have these super huge, unsexy, disproportionate, gangly, mutant, ape man hands!  But I guess it's to be expected when the devs are more concerned with realistic breast physics and how to turn a string bikini into armor.\n\nTERA, where sequened designer dresses are considered \"heavy armor\" and it's totally normal to battle everything in 7 inch spike heels!", "timestamp_created": 1492392171, "timestamp_updated": 1494796009, "voted_up": false, "votes_up": 52, "votes_funny": 15, "weighted_vote_score": "0.741135954856872559", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40243804": {"recommendationid": "40243804", "author": {"steamid": "76561198143212377", "num_games_owned": 66, "num_reviews": 2, "playtime_forever": 214715, "playtime_last_two_weeks": 0, "last_played": 1521395872}, "language": "english", "review": "First of all this game is not friendly to newcomers. Sure, you can grind out the early level dungeons from level 1-65 without having to worry about your equipment, but once you reach level 65 and unlock the endgame dungeons, that's when the community shits on you. Tera endgame community is very elitist. They look at your gear and if it's not up to a certain standard they won't even accept you to the party. I played this game for 3000 hours and I am bored to the death by the endgame dungeons because it's repetitive and people are all about having the highest dps. As a result, I mostly just afk in the game. When I first started that was when I had the most fun. I was drawn in by the combat and graphics. Ignorance to the future community kept me in the game. I never expected to play for this long. After I reached level 65, I found out that there was a lot yet to be uncovered, but I experienced the elitism by not being accepted into parties after getting to level 65. In addition to dungeons, there is a 30-man raid, but good luck getting into one of the raids that can clear. The community is small so a newcomer, who has no connections, would have a hard time getting into one of the top guilds or join a raid. The endgame community is not soft on the casual players. So if you're interested in playing this game and participating in endgame dungeons, expect a lot of grind to reach a certain threshold of gear to be accepted and then get judged for your skills. \n\nTLDR; This game sucks and I suggest you to not play. Game is dead and community is toxic.", "timestamp_created": 1519106171, "timestamp_updated": 1519195849, "voted_up": false, "votes_up": 118, "votes_funny": 9, "weighted_vote_score": "0.763530910015106201", "comment_count": 19, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16013404": {"recommendationid": "16013404", "author": {"steamid": "76561198062096878", "num_games_owned": 76, "num_reviews": 4, "playtime_forever": 19028, "playtime_last_two_weeks": 0, "last_played": 1550365394}, "language": "english", "review": "In a world where clothing for females is as scarce as trustworthy politicians, you learn to actually move during combat in a MMO. 8.5/10", "timestamp_created": 1432659172, "timestamp_updated": 1432659172, "voted_up": true, "votes_up": 139, "votes_funny": 301, "weighted_vote_score": "0.801628232002258301", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42884153": {"recommendationid": "42884153", "author": {"steamid": "76561197997899456", "num_games_owned": 991, "num_reviews": 13, "playtime_forever": 8653, "playtime_last_two_weeks": 0, "last_played": 1527035637}, "language": "english", "review": "A leaked build of the upcoming patch set to arrive on 2018-06-07 confirms Enmasse Entertainment will silently install a rootkit (XignCode3) on all players' computers alongside the patch. It can compromise security by uploading your personal files to a third-party database even while the game is not running and after it is uninstalled.\n\nOther effects include:\n* System instability.\n* Extreme resource usage and FPS drops while ingame.\n* SSD failure due to excessive writes.\n* No warning from most anti-virus software.", "timestamp_created": 1529525859, "timestamp_updated": 1529525859, "voted_up": false, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.694855153560638428", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "47636410": {"recommendationid": "47636410", "author": {"steamid": "76561198086968406", "num_games_owned": 114, "num_reviews": 3, "playtime_forever": 2263, "playtime_last_two_weeks": 0, "last_played": 1545365486}, "language": "english", "review": "If you like strippers and lolis you will probably like this game", "timestamp_created": 1545255009, "timestamp_updated": 1545255009, "voted_up": true, "votes_up": 30, "votes_funny": 49, "weighted_vote_score": "0.717514276504516602", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15705500": {"recommendationid": "15705500", "author": {"steamid": "76561198029077622", "num_games_owned": 632, "num_reviews": 31, "playtime_forever": 6253, "playtime_last_two_weeks": 0, "last_played": 1475538906}, "language": "english", "review": "[THIS REVIEW DOESN'T INCLUDE THE EUROPEAN SERVER, from Gameforge! Only the US server, from Enmasse]\n\n[h1]A lot of people want to know: Is it [b]Pay to Win[/b]?\n\nI say: [b]NO.[/b][/h1]\n\nOf course, you can buy cosmetic items, mounts, even keys that unlocks certain box with dollar and sell it in AH, in-game, for gold, but I don't see it as a P2W feature, because it's not hard to make gold in-game.\n\nThe only advantage you really get using real money is buying the Elite Status, which you give like EXP Bonuses, and that sort of thing.\n\nSo don't be afraid, click PLAY and ENJOY!\n\nI recommend PVE server for beginners, it is focused, as the name speak of itself, on PVE, and the PVP only happens if you invite someone to Duel.", "timestamp_created": 1430865132, "timestamp_updated": 1430871649, "voted_up": true, "votes_up": 190, "votes_funny": 25, "weighted_vote_score": "0.77107536792755127", "comment_count": 15, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42477307": {"recommendationid": "42477307", "author": {"steamid": "76561198156094856", "num_games_owned": 55, "num_reviews": 49, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1432582380}, "language": "english", "review": "===[ Audience: ]=== \n☐ Kids\n☑ Everyone\n☐ Casual players\n☐ Pro players\n\n===[ Graphics: ]=== \n☐ Potato\n☐ Really bad\n☐ Bad, but playable\n☐ OK\n☑ Good \n☐ Beautiful \n☐ Masterpiece\n\n===[ Price/quality: ]=== \n☑ Full price\n☐ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Don't do it\n\n===[ Requirments: ]=== \n☐ 90' PC\n☐ Minimum\n☐ Medium \n☑ Fast\n☐ High end \n☐ NASA computer\n\n===[ Difficulty: ]=== \n☐ Depends on your skill\n☐ You just need 2 arms \n☐ Ez\n☑ Easy to learn / Hard to master \n☐ Hard (first few hours)\n☐ Dark Souls\n\n\n===[ Game time/length ]=== \n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☑ Long ( 12+ hours)\n☐ Endless\n\n===[ Story ] === \n☐ It doesn't have\n☐ There is a story but gameplay isn't focused on it\n☐ Still better than Twilight\n☑  Average\n☐ Good\n☐ Fantastic\n\n===[ Bugs ]=== \n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☑ Few Bugs\n☐ You can use them for speedrun\n☐ Nothing\n\n===[ Pay to Win ]=== \n☑ Yes\n☐ No", "timestamp_created": 1528056085, "timestamp_updated": 1528056085, "voted_up": true, "votes_up": 54, "votes_funny": 17, "weighted_vote_score": "0.753000557422637939", "comment_count": 5, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15876751": {"recommendationid": "15876751", "author": {"steamid": "76561198154963321", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 54614, "playtime_last_two_weeks": 0, "last_played": 1517896681}, "language": "english", "review": "So far im very much enjoying the combat system that Tera has to offer. Alot of fun leveling as well as at max level you get to partake in guild crusades so the game doesnt get boring or no loss of attention at max level. most MMO games its like you get to max level you get gear then your bored til new content comes out. In Tera you get to max level you get your gear then you get to try and rank in pve or pvp crusades for the skycastle every month. you can gain new mounts fun costumes be a part of a guild. Its so much fun. And guess what Achievements for graded laurels and self perks are amazing :D FINALLY a game where achievements are actually worth getting :)", "timestamp_created": 1431891290, "timestamp_updated": 1431891290, "voted_up": true, "votes_up": 47, "votes_funny": 1, "weighted_vote_score": "0.725559711456298828", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48109685": {"recommendationid": "48109685", "author": {"steamid": "76561198255009560", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 5784, "playtime_last_two_weeks": 0, "last_played": 1547157094}, "language": "english", "review": "the game is good but the grinding and re leveling different characters is soul crushing", "timestamp_created": 1546650453, "timestamp_updated": 1546650453, "voted_up": true, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.689995288848876953", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31188821": {"recommendationid": "31188821", "author": {"steamid": "76561198347895231", "num_games_owned": 308, "num_reviews": 2, "playtime_forever": 6490, "playtime_last_two_weeks": 0, "last_played": 1522773125}, "language": "english", "review": "Playing TERA since 2013.-\nAlthough the launcher synchronization with Steam does not work properly it's a very good MMO.\n\nTERA is an excellent game, the graphics are designed to engage you in the adventure with a very good map design, in my opinion, with all the diversity of these, none feels even similar to the other.\nIts graphic design is unique, and although it may consume a lot, and you do not have a PC that is good enough to play at an adequate resolution for its very well made textures, it is still worth it, since, unlike many other MMORPGs, this is not just a bunch of plants and well-made monsters walking from one side to the other.\n\nThe Exiled Realm of Arborea, better known by its initials: ''TERA'', is an MMORPG developed by Bluehole Studio, which started as a paid game in 2011, but this has become a ''Free to play'' in 2013, so we can see that TERA, looks and feels as if it had a higher quality compared to other MMOs, which, from their roots, began as a Free to play.\n\nLet's start talking about your customization of characters.\n\nWhen you start, you can choose between different races, some of which have unique classes belonging to their species, and, in addition, only a few have a selection of genders between female and male.\nOnce a race has been selected, you can customize your character, starting with one of the predetermined models or with a totally random one.\nThe character characterization template of ''The Exiled Realm of Arborea'' is not bad, but neither is it the best.\nAs for the options that the game lets you perform, you can change the color and style of your character's hairstyle, your skin color, and you can also make slight changes to your face. This will not let you change any other physical range, or the height of your character, or your physical condition, among other things, which is a pity, since this leaves something to be desired, because, the more original our character is with the which one we'll play for hours, better, right?\n\nSince we discussed its graphic design, what better to continue with its sound section.\n\nThe soundtrack of TERA is pretty good, it's not a big deal, but it adapts very well to the environment and is pleasant to the ear. Not much more to add, but in what stands out, is in its sound effects.\nIn places of commerce you hear the blacksmiths make their armor, you can witness the sound of nature throughout its vast world without becoming annoying, and the sound effect of when you throw your skills or when battles melee, they fit very well with the fights, turning them into a much more pleasant experience.\n\nNow let's talk about combat.\n\nIf you have already seen a gameplay, or have played at least an hour to the game, you will know that the combat in this game is excellent.\nTERA, has what is possibly one of the best combat systems with which I have played, and this is all that is expected of a good MMORPG that focuses on this.\nEach class has its own unique playing style, being able to choose between supports, tanks and DPS's. And as I mentioned before, each class has a combat style totally different from the other, but maintaining a balance.\nCurrently the game is very balanced, you will not see the typical players using the typical OP classes, but you will find many players with different classes adjusting to their favorite game style, which adds a lot of diversity and comfort to the game, you will not get bored of seeing the same class, and you will not be forced to level up a character just because he is much stronger than the others.\n\nAs the most important part, is ''The Exiled Realm of Arborea'' dead?\n\nAnd yes, if you enter the game forums, read some comments or look at one or another review of this, you will find people who say that TERA is dead, that it is impossible to find players today.\nBased on my experience in the game, I do not think so.\nIn each world you will find approximately 3-4 players, which obviously could be many more, but in my opinion, it is more than good.\n\nAnd as a final question: Is it worth playing The Exiled Realm of Arborea in 2018?\n\nIn my opinion, if you are looking for a good Free to play game, to hang out with your friends or to play it alone, TERA is without doubt one of the best options as soon as we talk about MMORPG'S.", "timestamp_created": 1492384956, "timestamp_updated": 1522611239, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.638818442821502686", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31399945": {"recommendationid": "31399945", "author": {"steamid": "76561198068981406", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 254910, "playtime_last_two_weeks": 0, "last_played": 1547388400}, "language": "english", "review": "5/7 publisher that solved lag issues in a very unique way, by reducing the number of players.\nPublisher turned for the worst recently by turning a deaf ear to the community, would no longer recommend to anyone. Save your time and efforts, you know something is up when players that played for thousands of hours write bad reviews recently.\n\nIt was a good game design, with wonderful combat elements. However, while certain in-game cons could be overlooked, what made me write such a critical comment is the publisher itself. They have 0 intentions of connecting with the community. As of 3rd May '17, the game forums is in such a shambles. They made 1 thread to address the main issue yet does not reply or give a single indication that they have read it, treating it like a garbage dump for all kinds of comments, even constructive crticisms are not replied to. They shadowbanned users, banned users and removed comments/posts that are critical of them, even constructive ones, often hiding behind their tight forum rules that basically disallows criticism on the forums to be carried out against the publisher. It is akin to governments using laws that tackle public peace issues to shut citizens up when they create a uproar to criticize the government actions. How is a community as a whole ever going to have a channel to discuss things with the publisher if all they do is create a thread, stop responding to it and ban every other thread? They can say private emails, but heck, it is the input of community members discussing as a whole that matters, not just one person's perspective. \n\nThis did not accomplish a single thing that will improve the game for all players, the game itself is still the same old mess. In fact, the community itself is even more divided than ever. The community manager himself has shown to be able to actively reply to posts, but he only replies to posts that are neutral or pleasant to reply in (such as the anniversary screenshot thread), and avoids the critical issues, often giving very very vague replies without further discussion/clarification. If he can reply and talk to people posting screenshots, he can talk to people discussing about the critical aspects of the game. But he does not. And that is a very serious issue when the person that supposedly connects you as a player to the publisher and developer does not partake in discussions on critical issues comprehensively and makes sure the concerns of players who spent money in their game are taken care of.\n\nForum aside, the game itself has been very laggy for me and my friends playing since 'Ninja patch' released somewhere around May/June '16. It just started from that period and never recovered to how it was before. A whole year has almost passed and with each single month, no game improvement has been shown. Many players, including those in US, have just given up at this point and accept that laggy servers is part of the NA regional service. While I am personally playing from SEA and have less rights to complain, but if even the US players are complaining. Before you criticise me for complaining because im playing from a far off region, just check the forums from time to time, theres often threads complaining of lag. You can ignore my request, but please, listen to those players in NA. I think this is a critical issue for them to solve ASAP, 1 year is plenty of time already, especially in a competitive game genre with other companies. \n\nOverall, EME has a very big PR disaster to tackle and they very well do so appropriately, lest they lose their players to other regions such as EU, where they have shown to be able to improve their service. EME should really learn to listen to all of their playerbase instead of being on their high horse. I do not wish for the community to be split apart, but it already is :/", "timestamp_created": 1493319918, "timestamp_updated": 1493754467, "voted_up": false, "votes_up": 39, "votes_funny": 6, "weighted_vote_score": "0.655230164527893066", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45346479": {"recommendationid": "45346479", "author": {"steamid": "76561198069681593", "num_games_owned": 57, "num_reviews": 4, "playtime_forever": 640, "playtime_last_two_weeks": 0, "last_played": 1502059310}, "language": "english", "review": "DO NOT INSTALL\nINSTALLS SPYWARE\n\nThe developers use a chinese \"anti-cheat\" that starts up automatically and logs all of your programs, as well as probably every file on your computer, then sends them to some chinese servers.", "timestamp_created": 1539990211, "timestamp_updated": 1539990211, "voted_up": false, "votes_up": 116, "votes_funny": 32, "weighted_vote_score": "0.745075702667236328", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45241540": {"recommendationid": "45241540", "author": {"steamid": "76561198264720318", "num_games_owned": 54, "num_reviews": 8, "playtime_forever": 427, "playtime_last_two_weeks": 0, "last_played": 1544415418}, "language": "english", "review": "This game uses Xigncode3, which is spyware. Don't download it.", "timestamp_created": 1539402585, "timestamp_updated": 1539402585, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.637186050415039063", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39658427": {"recommendationid": "39658427", "author": {"steamid": "76561198150111036", "num_games_owned": 26, "num_reviews": 3, "playtime_forever": 10391, "playtime_last_two_weeks": 0, "last_played": 1549844304}, "language": "english", "review": "I've been playing Tera for a while and have some level 40-50 characters.  Testing out the different classes.  This is a great free to play game that doesn't feel like content is behind pay walls.  Sure, you can make purchases that can boost your XP gain, or gold, or other boosts, but I have yet to come across something that seemed \"needed\" that i had to buy with real money.  Great job at doing free to play right, and not locking tons of content behind purchases.  We will see if this changes at the end game levels though.", "timestamp_created": 1517069864, "timestamp_updated": 1517069864, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.662949562072753906", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38220729": {"recommendationid": "38220729", "author": {"steamid": "76561198064586699", "num_games_owned": 119, "num_reviews": 7, "playtime_forever": 3537, "playtime_last_two_weeks": 0, "last_played": 1492975486}, "language": "english", "review": "Neat game, neat combat.\n\nToo bad the world is pretty empty and you have to be a little girl if you want to be any of the special classes.", "timestamp_created": 1512939041, "timestamp_updated": 1512939041, "voted_up": true, "votes_up": 15, "votes_funny": 13, "weighted_vote_score": "0.672943651676177979", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18712318": {"recommendationid": "18712318", "author": {"steamid": "76561197997872190", "num_games_owned": 205, "num_reviews": 43, "playtime_forever": 34802, "playtime_last_two_weeks": 0, "last_played": 1451166698}, "language": "english", "review": "Although I just started playing this game, it feels a lot more refined than other MMOs in terms of combat mechanics. Starting character customization is somewhat lacking with limited hair color and eye color options but there is a modest selection of hairstyles and facial complexions. The real customization comes in costumes and armour selection. There's multiple slots for costumes allowing for mixing and matching of different costume sets. No two players are the same as everyone tends to find their own personal way of mixing costumes.\n\nMost MMOs I've played tend to pan handle you in terms of where you can go. In Tera, my personal favourite is climbing the mountains that are littered across the landscape. Took me a while to realise but I was enlightened to discover I could go on top of mountains in an area that otherwise looked inaccessible. However, with freedom of discovery comes glitches. Avoid waterfalls as my character got stuck inside one behind all the rocks.\n\nLevel balancing seems a little funky, NPCs two levels above are god-like and difficult to take down. NPCs two levels below are weaksauce to the point of boredom. However, levels matching you are well balanced so there's that. But I'm finishing story quests so fast that I reach NPCs several levels above me... I welcome the challenge, however. I don't PVP much, I'm more of a PVE-hero player. But I do have limited experience with PVP in this game and I have to say that it's fun and I'll go that far. The guilds are oddly setup, it requires player discretion but that's something you can easily get used to. People are vastly organised in guild/alliance battles and I appreciate that.\n\nFarming is immensely easy. My only gripe is NPCs respawn too quickly. I can cartwheel a small group of NPCs indefinitely or repeatedly take down a mini-boss. World bosses are exceptionally rare and that's something I appreciate more. \n\nServer populations are still very high, 2 servers are dead but that's expected of a game many years old. I'm on Ascension Valley and valkyries are (as of this review) still flying to-and-from Velika like popcorn out of a pot.\n\nAnd to all those people that say Priests can't solo anything: I've solo'd dungeons, mini-bosses, groups of mini-bosses, and BAMs with a Priest. Git gud or go home kiddies.\n\n Finally, I'm a big fan of the anime-style special effects. 7/10", "timestamp_created": 1445959584, "timestamp_updated": 1445959707, "voted_up": true, "votes_up": 38, "votes_funny": 5, "weighted_vote_score": "0.746251344680786133", "comment_count": 4, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31082232": {"recommendationid": "31082232", "author": {"steamid": "76561198261133604", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 27918, "playtime_last_two_weeks": 0, "last_played": 1478045648}, "language": "english", "review": "I really loved this game. I really did. I've played for two and a half to three years, on and off. One of my best friends I met on this game. But, like, once those class and gender locked cookie cutter OP classes started coming out? Once BAMs stopped taking a full party to kill? Once you could spam through dungeons with no plan in 10 minutes? *Shakes my head* I still reminiscent about the good old (hilarious) days, where I'd die to BAMs with a 3-man party, or I'd scream in dungeons as we wiped. And not just end-game dungeons, but like Sinestral Manor or etc. Now as long as you have the gear, it's easy as fk. For a new player, it'll probably still be fun, but as a veteran, it's gotten old. Boring. I'll come back when they release a new class, only to find that it's essentially the same as the other new classes they've released - race and gender locked, with similarities to so and so class just with a different weapon. Sigh. I'm really sad about it. More so, since everyone I played with back then no longer play either :/", "timestamp_created": 1491931751, "timestamp_updated": 1491931751, "voted_up": false, "votes_up": 97, "votes_funny": 3, "weighted_vote_score": "0.723880529403686523", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44361879": {"recommendationid": "44361879", "author": {"steamid": "76561198422507025", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 396, "playtime_last_two_weeks": 0, "last_played": 1525317493}, "language": "english", "review": "DO NOT DOWNLOAD THEY SCAN U COMPUTER ALL THE TIME AND SELL UR INFO TO PEOPLE PLUS IT DRASTICLY KILLS PROFORMANCE AND CANT BE UNINSTALLED\n\nDeploys XIGNCode malware/spyware on your computer. More information found here https://www.reddit.com/r/TeraPC/comments/8ot680/psa_upcoming_tera_na_patch_files_not_yet_deployed/ and confirmed by the Tera devs themselves here (in a thread where they deleted everyone's comments) https://forums.enmasse.com/tera/discussion/27159/xigncode3-and-tera-pc/\n\nDon't let game devs get away with this disgusting behavior. You have a right to privacy that companies are constantly trying to deny you. Stay informed.", "timestamp_created": 1535168653, "timestamp_updated": 1535168653, "voted_up": false, "votes_up": 156, "votes_funny": 15, "weighted_vote_score": "0.75775599479675293", "comment_count": 11, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15707076": {"recommendationid": "15707076", "author": {"steamid": "76561198045601781", "num_games_owned": 192, "num_reviews": 2, "playtime_forever": 47217, "playtime_last_two_weeks": 0, "last_played": 1473354564}, "language": "english", "review": "Steam allows auto login\n\n10/10 Gaben does magic", "timestamp_created": 1430875840, "timestamp_updated": 1430875840, "voted_up": true, "votes_up": 484, "votes_funny": 588, "weighted_vote_score": "0.734494984149932861", "comment_count": 10, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23981445": {"recommendationid": "23981445", "author": {"steamid": "76561198086238920", "num_games_owned": 85, "num_reviews": 3, "playtime_forever": 2558, "playtime_last_two_weeks": 0, "last_played": 1479861534}, "language": "english", "review": "[Disclaimer Regarding Hours] I've played this game since ~2012 and have invested hundreds of hours into the game; I just hardly ever use the steam launcher or have steam running while playing (The game wasn't always available on steam). \n\nI'm recommending this game very hesitantly... Here we go\n\n[h1] Visuals\t[/h1]\nThe visuals for this game are absolutely stunning (if your computer can handle the higher presets). The armor, characters, and scenery for this game are beautiful; consult google images if you need evidence. However, the game is relatively CPU and GPU intensive, so many people (especially laptop users) cannot play on decent settings without experiencing a performance drop. Furthermore, the game is designed to run on only 2 logical processors/\"cores,\" so many people notice a huge fps difference between this game and games of a similar graphical standard. There are many forum posts which claim to offer methods for running this game on 4 logical processors, but they don't actually work (Trust me, I've tried them all). But this isn't really that much of a problem if you have a decent computer. \n\n[h1] Combat\t[/h1]\nUnlike some MMORPGs, there is no lock-on or auto-attack; so you'll have to aim most of your attacks (there are some exceptions). Some people like this, others do not. However, for those who suffer from constant dips in fps, combat may be more difficult, especially in large battlegrounds. The combat animations are pretty distinct. Each combination of class/race/gender has it's own combat animations (some are better than others), and they're pretty fun to watch IMO. \n\n[h1] Leveling\t[/h1]\nLeveling your character is one of the more fun parts of this game (depending on which class you choose - some are more fun than others). Leveling used to be more tedious, but EnMasse now has regular double XP leveling events and grants many xp bonuses in-game. Most people can reach max level by just doing the story quests and a few extra dungeons. You used to be able to level-up fairly quickly by doing battlegrounds, but EnMasse now reserves battlegrounds for people who have hit max level. \n\n[h1] Dungeons \t[/h1]\nThe dungeons in this game are pretty well-designed. Some of them are a little repetative and obvious clones of eachother, but these instances aren't too common. Because the game has less to render within dungeons, most people will experience great increases in performance. \n\n[h1] End-Game\t[/h1]\nThe end-game is pretty tedious. It mainly consists of grinding dungeons and battlegrounds until you can craft/enchant the best possible gear for your character. The tedium is somewhat relieved if you join a guild and regularly engage in guild events. However, all battlegrounds and many dungeons are reserved for characters with max level; so this is essentially when the game is supposed to \"start.\" They recently added a semi-survival mode for players who reach max level (I forget it's name). Some people find it kind of fun, but it's really short (about 3-10 minutes depending on your class/gear). \n\n[h1] Battlegrounds\t[/h1]\nBattlegrounds are perhaps the most cancerous element of the game. The most popular battleground, Corshair's Stronghold, is 20vs20 and difficult for many people's computers to process efficiently. However, most people still play it because if has the shortest queue time of all the battlegrounds and the daily rewards chest is an easy way to get essential end-game materials. \nHere's a run-down of how this lovely bit of torture usually goes: \n1. You enter the arena\n2. (a). Leader is afk absent and you have to kick it. (b) the leader doesn't want to lead and is frantically looking for someone else to lead. (c) leader gives first orders\n3. [Coin flip] There's a 50/50 chance as to whether or not people will follow the leader's orders. If they do, great. If they don't, they probably don't care or don't speak english (so sorry). \n4. By about 4 min into the game, you can usually predict how things are going to go. If things are going smoothly, great! If they aren't, this is usually when people start fighting and barking their own orders in chat... enjoy. \n5. If your team does decent in the first round, expect a fairly smooth second round with full leader support and participation. If you don't, expect a second round with some of your team AFK and everyone barking orders, fighting, and finger-pointing in chat. Welcome to CS :) \n**Note: Game outcome is determined by the overall expense of your team's computers in addition to skill and team cohesion. If most people can play the game with good fps and rendering (in other words, they can actually kill people), then you win. This is known as \"hardware carrying,\" the true pay to win.\n\nOf course there are other battlegrounds you can join, but their wait times are usually longer (and in some cases, indefinite because nobody is queued for them at the time). \n\n[h1] Community\t[/h1]\nThe community is pretty split. There are lots of people with really low IQs and people who get frustrated really easily... In other words, It's a troller's paradise! \"Hey trolls, are you looking for a new internet community to prey on? If so, welcome to TERA! This short-tempered community where about half the people have a homologous chromosome count of 47 is perfect for your evil little perversions!\" But seriously, trolling people is super easy. Sometimes I like to imagine that I'm shortening the lifespan of some of these people by frustrating them and increasing their stress levels, and in essence, crafting a better and more sophisticated internet community. (You're welcome.) \nThe other half of the community is fantastic. There are lots of people willing to help new players and make friends. Also, if you like meeting people from different countries, this game is perfect. I now have lots of new friends from Germany, the Netherlands, Sweden, Denmark, Brazil, the US, Croatia, and the UK as a result of playing. \n\n[h1] Conclusion\t[/h1]\nThe game is fine as long as you can run it. Like most MMORPGs, it has it's problems, but none of them are too major. Go into the game with thick skin and don't expect everyone you meet to be nice to you. The gameplay gets a little repetative at times, but there's enough content to make it worth a playthrough. Just get a character to max level and stop if you don't like it. That part of the game is free, so there's no risk. (Only recommending game because it's free. Would not recommend paying for anything.)\n\n[h1] Personal Note\t[/h1]\nIf you're absolutely horrible at MMOs or games in general and have a crap computer, I recommend gunner for your first character. They are ranged, heavy armor, have lots of combos, can self-heal, can restore their own mana, have a turret and a robot to fight with them, and are really easy to handle at low fps. I used to play warrior/sorcerer on a laptop with intel HD 3000 graphics, and when gunner (and reaper) were released, it was a god-send. (I have a better desktop now.)\n\n[h1] Misc\t[/h1]\nThe game's economy kind of runs on costume purchases, so most people choose to be female castanics/high-elves or elins because...\nElins = Kawaii\nHigh-Elves = Boobs\nCastanics = Booty (And they're just kinda cool)\nHuman females are also pretty popular\n\nNot a whole lot of people play this game using the steam launcher, so you're really not going to see much valid criticism of the game here. Look to other sources if you want better criticism.", "timestamp_created": 1467370989, "timestamp_updated": 1477793752, "voted_up": true, "votes_up": 21, "votes_funny": 10, "weighted_vote_score": "0.716586112976074219", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24535171": {"recommendationid": "24535171", "author": {"steamid": "76561198191019089", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 5275, "playtime_last_two_weeks": 0, "last_played": 1523500968}, "language": "english", "review": "TERA is an MMORPG (Massively Multiplayer Online Role Playing Game) that is very story-based. I am hoping this will help some people enjoy this game like I have.\n\nGood Stuff:\nCombat, If you enjoy Action Combat MMORPGs you have a good chance of liking the combat in TERA because the skills are very fluent and make you look awesome!\n\nCustomization, The Customization (in my opinion) is pretty good! It allows you to be pretty creative, though with a race, there is a chance you will see a person that looks very similar to you. (I believe the only race like this are Elins but I could be wrong).\n\nClasses, In TERA, I believe that there is always a certain class that is for your own play style which means that if you don't enjoy this game, it is very unlikely it is because of the class you chose (if you chose the right one).\n\nStory, I believe the story (after the start) is very well done! If you enjoy the starting quest always depends on you (though I always thought it was too rushed) I like the Story because it actually feels like your improving while the game goes on.\n\nJust The Things You Love, This seems like a weird one but there is only one word for it. BAM's (Big Ass Monsters). TERA makes you challenge tons of BAM's just for the story! The battle's always feel difficult and things could turn south at any minute during them.\n \nBad Things:\nReused Skins, This is about NPC's being reused but this isn't a major problem because you need to understand that they may have had some financial issues so you need to look past these problems, but it becomes a little more common in the higher level areas. This is understandable with the armor and weapons though because of this game being free to play.\n\nStarting Quest, As I mentioned before, I felt that the starting quest and story just felt too rushed. Basically, 5 children that you just meet go into something similar to a coma. If you follow exactly what the story and the quest want, you only talk to 3 out of these 5 children.\n\nUI, Or User Interface can get a bit crowded at times. This is because of when you kill something needed for a quest, it comes up with the story quest your up to, but these quests can be gotten rid of easily.\n\nMail, You get alot of mail in this game. Not a big problem when your not doing anything, though annoying in things like dungeons or boss fights.\n\nGender Locked Classes, Something I really dislike about this games classes are all the new ones are always Gender Locked, which leads men that are very interested in the new classes get forced to make girls and get some hate for it.\n\nI'd rate it an 8/10. I really hope this was useful!\n\n★ ★ ★ ★ ★ ★ ★ ★ ☆ ☆", "timestamp_created": 1469532089, "timestamp_updated": 1469532883, "voted_up": true, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.711431682109832764", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45291761": {"recommendationid": "45291761", "author": {"steamid": "76561198158554599", "num_games_owned": 205, "num_reviews": 7, "playtime_forever": 1854, "playtime_last_two_weeks": 0, "last_played": 1516612358}, "language": "english", "review": "==[PLAYER BASE]==☑☐\n☐ Kids\n☐ Everyone\n☑ Casual Players\n☑ Pro Players\n☐ Hackers\n\n==[ ⚙Graphics]==\n☐ Potato\n☐ Really Bad\n☐ Bad\n☐ OK\n☑ Good\n☐ Amazing\n☐ Masterpiece\n\n==[PRICE/QUALITY]==\n☐ Full Price\n☐ Wait for sale\n☐ Average\n☐ Refund if you can\n☐ Don't do it\n☑ Free\n\n==[ ☣ REQUIREMENTS]==\n☐ 90' PC\n☐ Minimum\n☐ Medium\n☑ Fast\n☐ High end\n☐ NASA Computer\n\n==[DIFFICULTY]==\n☐ You just need 2 arms\n☐ Ez\n☑ Easy to learn/Hard to Master\n☐ Hard\n☐ Dark Souls\n\n==[ 🕒GAMETIME]==\n☐ Very Short (0-2h)\n☐ Short (2-8h)\n☐ Few Hours (8-12h)\n☑ Long (12+h)\n☑ Endless\n\n==[ ♫ STORYLINE]==\n☐ No story\n☐ Still better than Twilight\n☑ Average\n☐ Great\n☐ Harry Potter\n\n==[ ⌭ BUGS]==\n☐ Game itself is a bug\n☐ PUBG\n☐ Lots of bugs\n☑ Few Bugs\n☐ You can use them for speed run\n☐ Nothing\n\n==[ ⌕ OTHERS]==\nSingleplayer: NO\nMultiplayer: YES", "timestamp_created": 1539677170, "timestamp_updated": 1539677170, "voted_up": true, "votes_up": 79, "votes_funny": 26, "weighted_vote_score": "0.755410909652709961", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39996334": {"recommendationid": "39996334", "author": {"steamid": "76561198018212618", "num_games_owned": 93, "num_reviews": 8, "playtime_forever": 760, "playtime_last_two_weeks": 0, "last_played": 1518513690}, "language": "english", "review": "I'm more into hardcore, full-loot MMO's, but there's not much at the moment I enjoy besides EVE, so I've been looking around for something a bit more 'soft core' that I can play that has lots of action, and has the usual levelling up and questing. \n\nI've probably tried about 7 MMO's in the last couple of months, and none have my attention for more than a few hours. TERA is different, I found the environments, monsters and artwork to be gorgeous, and the more I played it the more I started to like the game. \n\nI started off with the Lancer but it felt too rigid, I then tried the Archer and absolutely love the combos, dodging and different attacks you can have on ememies. Levelling up is very satisfactory and there is always something to do. Once I started doing the daily solo and dungeon quests I got my first real taste of MMO bosses that were hard to take down. \n\nThe game even has different tournament and siege modes which are fun to play, and I've had a few duels against other player's which have b een fun. The game's UI and questing systems are excellent, some of the best I've seen in a game. \n\nAll in all this is probably the first non-hardcore MMO I've enjoyed playing. I haven't spent a cent yet, nor have I felt compelled to, but I'm a game developer so I'll definately be supporting this game with a couple of purchases in the item shop to help the devs out.", "timestamp_created": 1518336989, "timestamp_updated": 1518336989, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.665583968162536621", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45226846": {"recommendationid": "45226846", "author": {"steamid": "76561198017492623", "num_games_owned": 319, "num_reviews": 48, "playtime_forever": 1470, "playtime_last_two_weeks": 0, "last_played": 1526683770}, "language": "english", "review": "Steam: \"Please describe what you liked or disliked about this game and whether you recommend it to others.\"\n\nKay. Spyware. Yes, I did validate that fact for myself. Avoid at all costs.", "timestamp_created": 1539318338, "timestamp_updated": 1539318405, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.606600940227508545", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44009719": {"recommendationid": "44009719", "author": {"steamid": "76561198064988945", "num_games_owned": 54, "num_reviews": 10, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1504656804}, "language": "english", "review": "Deploys XIGNCode malware on your computer. More information found here https://www.reddit.com/r/TeraPC/comments/8ot680/psa_upcoming_tera_na_patch_files_not_yet_deployed/ and confirmed by the Tera devs themselves here (in a thread where they deleted everyone's comments) https://forums.enmasse.com/tera/discussion/27159/xigncode3-and-tera-pc/\n\nDon't let game devs get away with this disgusting behavior. You have a right to privacy that companies are constantly trying to deny you. Stay informed.", "timestamp_created": 1533771537, "timestamp_updated": 1533771537, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.606621861457824707", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "43311966": {"recommendationid": "43311966", "author": {"steamid": "76561198001345545", "num_games_owned": 71, "num_reviews": 3, "playtime_forever": 3558, "playtime_last_two_weeks": 0, "last_played": 1531971139}, "language": "english", "review": "Fun combat, but it is terribly optimized. no matter how high end your computer spec is, you will experience frame drops. Even if you follow optimization tweaking guide and fix up engine.ini file or nvidia inspector, it will still have frame drops at certain area and it is unavoidable. If you cannot stand such problem, don't even think about trying this. Otherwise, this game is pretty decent with fun combat system but that's pretty much it.", "timestamp_created": 1530757426, "timestamp_updated": 1530757426, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.621586620807647705", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "44995140": {"recommendationid": "44995140", "author": {"steamid": "76561198259394434", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 119842, "playtime_last_two_weeks": 0, "last_played": 1548045283}, "language": "english", "review": "Do not play this game, as of october, 2018. EME has oficially killed it. People will stop playing. I repeat. Do not commit to this game, it was great, apex skills were amazing, and apex were coming for all classes soon, but they just ruined the game with spyware and taking down our beloved proxy and meters. The game was already dying, but it will definitely die due to this: https://www.reddit.com/r/TeraOnline/comments/9jrwc2/dev_perspective_on_enmasses_recent/?utm_content=title&utm_medium=hot&utm_source=reddit&utm_name=TeraOnline, more info here: https://forums.enmasse.com/tera/discussion/29124/recent-dmca-takedowns-of-third-party-programs-discussion/p5", "timestamp_created": 1538199435, "timestamp_updated": 1538199435, "voted_up": false, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.60159069299697876", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31502874": {"recommendationid": "31502874", "author": {"steamid": "76561198055464101", "num_games_owned": 713, "num_reviews": 5, "playtime_forever": 126806, "playtime_last_two_weeks": 0, "last_played": 1514290707}, "language": "english", "review": "Between not fixing ping tax and not listening to the community, EME and BHS are crippling an amazing game. You're better off playing a different MMO until they fix their game.", "timestamp_created": 1493717382, "timestamp_updated": 1493717382, "voted_up": false, "votes_up": 46, "votes_funny": 3, "weighted_vote_score": "0.719873487949371338", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23050254": {"recommendationid": "23050254", "author": {"steamid": "76561198015116706", "num_games_owned": 258, "num_reviews": 21, "playtime_forever": 6409, "playtime_last_two_weeks": 0, "last_played": 1524294977}, "language": "english", "review": "[b]Playing TERA solo vs. with friends:[/b]\nTERA is extremely boring alone. If you want to play this game make sure you play it with friends. Not only will it make the game less difficult if you are playing a class that isn't good solo, but it will help kill the monotony of the questing/dungeons pre-end game. If you don't have friends, simply join a guild and quest with guildees. If you are tackling the game solo however here are some tips and warnings: \n1. Make sure you are completeing quests in the right order, or else you will have to backtrack to the beginning of the zone to complete main quests you didn't realize you weren't completeing (it is easier to mess up than it sounds).\n2. If you are playing solo make sure you pick a class that is good solo. A lot of classes in this game are balanced very strongly in a tank/dps/healing set-up and a lot of the big mobs in level 30+ zones get incredibly stronger than they were in previous zones. I recommend the brawler class as a great starting class. I played brawler and didn't have any issues with questing (or running dungeons) solo until around level 50+ when the level of the content was catching up with how far ahead my character was.\n\n[b]Zone Questing 1/10:[/b]\nEvery single zone in the game has the exact same leveling experience. 3 differen't locations per zone where you get quest type A. (kill 10 mobs quest), quest type B. (collect 10 items quest), and quest type C. (kill 5 big strong mob quest) once you complete those quests you move on to the next hub. After all 3 hubs in each sub-zone of a region you will get a quest chain to go through a solo-dungeon and repeat the whole thing and then eventually you will finally move on to the next leveled region and start all over again. I was hoping at least the expansion from 60-65 would have changed the questing experience a little, but honestly it was exactly the same. This game has by far the most undesireable questing experience I have ever participated in. I have played WoW, FFXIV, EverQuest, ArcheAge, Black Desert Online, Blade and Soul, Aion, Rift and many other MMOs, but this one takes the cake for the most boring grindy questing of them all. Luckily there are other options to choose from while questing.\n\n[b]End-game Questing N/A score:[/b]\nThis game really has none of it.\n\n[b]Dungeons 2/10:[/b]\nDuneons in TERA are fun at first (literally the first dungeon), but you will soon realize like the questing that they are all exactly the same. A lot of them use the same assets so enemies and layout look exactly the same as the dungeon you just did, but with a differen't coat of paint. Essentially kill 3 rooms of mobs, fight a boss, next three rooms, another boss, ect. If you are using dungeons to get to 65 (that is what I would recommend) then prepare to take a lot of breaks, or put on some music while you do them. I didn't give dungeons a 1/10 simply because some of the bosses actually look pretty damn badass, and the gear you can get in dungeons is pretty awesome. However, dungeon bosses still all lack creative mechanics most you can just tank and spank, as well as any real exciting reason as to why you should want to kill them (until the expansion). Once you hit upper 50 dungeons and the expansion dungeons nothing really changes, but they get more exciting lore wise and you will actually feel like you have a purpose for running them to get geared for raids.\n\n[b]Raids (cannot give honest score):[/b]\nNot a long section. I didn't play much of the raids, but they meet your typical mmorpg \"get geared in dungeons then increase in raid tier\" format. From what I played of them they are pretty fun and challenging, but I had a hard time keeping aggro so I didn't play much of them after getting the first raid tier gear.\n\n[b]Lore 3/10-->7/10 and Classes/Races/Combat 9/10:[/b]\nI don't really have anything to say about the lore for pre-Arun expac, other than it is pretty boring and lacking (imo), but Fate of Arun's story can get pretty exciting esspecially anything centered around the character Zolyn and her friends since they are the only redeeming lore characters in the whole game. As for classes warrior is a pain in the butt I don't recommend playing it if you are new to the game, but most of the classes that I tried seemed fun you purchase skills with money from trainers. Brawler was a blast for me to play and probably in my top 5 favorite classes of mmorpg history. The combat in TERA started the action style combat breaking away from games like WoW so in that regard the combat is fluid and great for the most part. Keeping aggro as a tank seemed to be difficult for me as the only thing, dps pull insanely high in this game, but that could be just because I suck at tanking (most likely). All in all this game is literally known for it's combat and is why it has so many players.\n\n[b]World PvP N/A score vs. Battlegrounds 8/10:[/b]\nI didn't participate in end-game world pvp so I cannot say how fun it is although it seemed pretty fun like most game with world pvp. Prepare to get ganked A LOT when you are leveling though. And yes, this game has pvp AND pve servers so if you have a preference between the two you will be covered either way. Battlegrounds are fun and unique.... for what there is. I gave the battlegrounds a good score in this game, but honestly there are a very low amount of them which can cause boredom to some players very quickly. If you want a more elaborate discussion on TERA's pvp feel free to message me. Also if you want to know about class balance I am the wrong person to ask as I only leveled to 65 with brawler and it was pretty OP at the time (they may have nerfed it by now).\n\n[b]Community 10/10 (biased I know):[/b]\nFirst off this game has a very friendly community you will mostly only encounter assholes in pvp related activities (like when you get that one guy in battlegrounds who thinks he is better than everybody else and he is carrying the team). Secondly, my opinion is a little biased because this game has a huge anime crowd which I do not mind (warning to those of you who do not like anime you are going to be seeing fans of it pretty much around every corner). It only gets a little cringy around people who are huge Elin fanboys I recommend staying away from them anyway (no offense, but look at what you are playing a little more closely and realize why others might want to stay away from you).\n\n[b]Crafting N/A score:[/b]\nIt is your standard MMO crafting much like WoW's so I can't really throw an opinion on this one as it is a hit or miss for most. A lot of players don't care about the crafting at all.\n\n[b]Visuals/Graphics 9/10:[/b]\nGame looks great and the artsyle is very pretty. Some zones have amazing screenshot-picture-perfect areas. Some of the best looking zones I have seen in an MMO (too bad the questing ruins it). \n\nQ. Is the game P2W? (\"Pay to win\" meaning, do you have to pay for in-game shop items with real money to not fall behind other players)\nA. No, this game has the best F2P model I have ever seen. All of the in-game shop items are cosmetics to make your characters look cool. The game has a subscription you can pay, but honestly I found it pretty much worhtless. It doesn't give you anything you cannot get for free except a teleport book so you don't have to take flight paths.\n\n[b]Summary (tl:dr):[/b]\nTERA has a lot going for it in the free to play market and can provide many hours of fullfilling mmo experience. The questing is beyond dull and more than half of the dungeons in the game have been cut out. Dungeons in general are uninteresting and bland until level 55+. Story isn't that great until Fate of Arun at 60, but the combat and visuals of the game are top notch and fun. PvP is lacking in content, but still fun nonetheless. Great game to try for free, but you might get bored fast. I recommend Black Desert Online Instead.", "timestamp_created": 1463551935, "timestamp_updated": 1463961090, "voted_up": false, "votes_up": 166, "votes_funny": 14, "weighted_vote_score": "0.755560457706451416", "comment_count": 12, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "15899968": {"recommendationid": "15899968", "author": {"steamid": "76561198095390131", "num_games_owned": 46, "num_reviews": 38, "playtime_forever": 2337, "playtime_last_two_weeks": 0, "last_played": 1437746761}, "language": "english", "review": "It´s definitely worth trying. Especially if you have 1-2 friends with you on skype.", "timestamp_created": 1432042326, "timestamp_updated": 1432042326, "voted_up": true, "votes_up": 55, "votes_funny": 11, "weighted_vote_score": "0.717324733734130859", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45568642": {"recommendationid": "45568642", "author": {"steamid": "76561198170109234", "num_games_owned": 124, "num_reviews": 6, "playtime_forever": 13250, "playtime_last_two_weeks": 0, "last_played": 1517339892}, "language": "english", "review": "this game was great, it was a ton of fun with a cool world and a enjoyable learning curve. it was. sadly this game has been gutted of everything that made it worthwhile, all the cool and enjoyable nuances that made this game feel like an actual world, all of the loving care that was so present from the developers down to the community has been gutted, all the new classes make the old ones obsolete, there is no longer a need to play with your party, there is no longer a need to join a guild, there is no longer a reason to play this game. this is a tragedy that seems to befall every good mmo, as time passes the devolopers lose what makes this game so special. when i left this game i had two hundred hours and when i came back a month later i could only play twenty. this was a game i lost myself in. now this is just a game i lost.", "timestamp_created": 1541097805, "timestamp_updated": 1541097805, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.643674314022064209", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "48528617": {"recommendationid": "48528617", "author": {"steamid": "76561198106890758", "num_games_owned": 128, "num_reviews": 55, "playtime_forever": 2365, "playtime_last_two_weeks": 0, "last_played": 1512014004}, "language": "english", "review": "i used to have friends and i told them to play this game and i don’t have friends now", "timestamp_created": 1548359661, "timestamp_updated": 1548359661, "voted_up": true, "votes_up": 17, "votes_funny": 43, "weighted_vote_score": "0.684912800788879395", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32165530": {"recommendationid": "32165530", "author": {"steamid": "76561198199137823", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 94385, "playtime_last_two_weeks": 0, "last_played": 1499642469}, "language": "english", "review": "Tera is an addictive and enthralling hack and slash game.  The weapon choices are interesting and the battle style can be as complex or simple as you wish it to be, I especially like the use of defensive moves for the tanks.  While I find the graphics to be not quite crisp enough overall the world is beautiful and diverse.  Great fun.", "timestamp_created": 1496540381, "timestamp_updated": 1496540381, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.709866940975189209", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35068959": {"recommendationid": "35068959", "author": {"steamid": "76561198032256269", "num_games_owned": 139, "num_reviews": 6, "playtime_forever": 85019, "playtime_last_two_weeks": 0, "last_played": 1545811036}, "language": "english", "review": "I've played a long time but have given the game up.  I'm marking this as a positive game only because I've had more positive experiences than negative.  There's little I could say that's not repeated in other reviews... yes, graphics are dated but they have their own unique appeal... the story is meh and cliched, but you can ignore it if you wish... item sets are rinse and repeat thus dull, but at least with some effort you can get the same things others are paying for.  Like so many other MMOs before Tera (and after), Tera suffers all the same fates.  The ultimate fate is there's grass always greener somewhere else.  And those MMOs will have the same exact problems.  I can't down-thumb a game that's got all the same problems as the others.  My thumbs-up is because it left a positive impression on me when i quit.  I don't know what will happen to the game in the future... even Ultima Online is still around, so who knows where Tera will go.", "timestamp_created": 1505842120, "timestamp_updated": 1505842120, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.724094688892364502", "comment_count": 2, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "16008914": {"recommendationid": "16008914", "author": {"steamid": "76561198074310107", "num_games_owned": 2343, "num_reviews": 16, "playtime_forever": 1245, "playtime_last_two_weeks": 0, "last_played": 1435269508}, "language": "english", "review": "Hands down, the best f2p mmo out there. I've spent countless hours before it was on Steam and now I'm enjoying it here. Astonishing combat system.", "timestamp_created": 1432632798, "timestamp_updated": 1432632798, "voted_up": true, "votes_up": 28, "votes_funny": 2, "weighted_vote_score": "0.669476926326751709", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42520397": {"recommendationid": "42520397", "author": {"steamid": "76561197972580313", "num_games_owned": 549, "num_reviews": 12, "playtime_forever": 148119, "playtime_last_two_weeks": 0, "last_played": 1491193352}, "language": "english", "review": "I love Tera, i play it very regularly. But they just announced their going to implement the anticheat program thats malware that constantly tracks everything your pc does for the past 48 hours and its a massive privacy invasion. So dont get this game XIGNCODE3 is a piece of crap that wont stop any \"cheaters\", it just makes the game run worse for any legitimate players. Find something else to play, EME is a horrible publisher.", "timestamp_created": 1528247604, "timestamp_updated": 1528247604, "voted_up": false, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.607786059379577637", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "42875022": {"recommendationid": "42875022", "author": {"steamid": "76561198008360046", "num_games_owned": 176, "num_reviews": 73, "playtime_forever": 3974, "playtime_last_two_weeks": 0, "last_played": 1517784449}, "language": "english", "review": "Was coming back to play, only to read online that the game comes installed with Xigncode. \n\nXigncode is malicious software and severe privacy violation. \n\nI will not reinstall TERA until this issue is resolved.", "timestamp_created": 1529500447, "timestamp_updated": 1529500447, "voted_up": false, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.617959201335906982", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33627963": {"recommendationid": "33627963", "author": {"steamid": "76561198141013903", "num_games_owned": 190, "num_reviews": 4, "playtime_forever": 41780, "playtime_last_two_weeks": 0, "last_played": 1515459844}, "language": "english", "review": "Pros:\nAmazing action-style, non-turn, non-autoaim kind of combat system is fast paced and rewarding.\nThe character design and map design is gorgeous.\nLots of customization both pre-game and once you're in.\nExtensive lore that you can get into if that's your thing.\n\nCons:\nEndgame skill/weapon/armor enhancing is an extremely painful grind unless you have no life whatsoever.\nExtremely grindy on a daily basis, gets more like this as you level up.\nMany consider leveling to max occurs too quick.\nLots of \"go gather x things\" kind of quests that are tedious.\nPretty elitist playerbase that can be hostile at times (or extremely cliquey).\nWill easily tempt you to let it take all of your time.\nPlayer market costs are extremely inflated.\nNew content that isn't new/better classes or dungeons is rather rare.\nMany players find the race/gender lock on many of the classes to be unfair and frustrating.\n\nI personally love it - my beef with it if anything is it is way, way, way too grind-fest. You can grind literally all day and barely make progress on endgame stuff. Crafting or achieving many endgame goals occurs in spans of weeks, months, or more, unless you pay $$$ for stuff in the shop.\n\nChances are lots of folks will like the gameplay but either get bored of mindless quests during storyquesting and/or find the endgame grind awful. If you are tenacious and ready to tackle those things, you may get quite a lot out of this game.", "timestamp_created": 1500377453, "timestamp_updated": 1500377453, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.643344104290008545", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45058262": {"recommendationid": "45058262", "author": {"steamid": "76561198004276366", "num_games_owned": 121, "num_reviews": 9, "playtime_forever": 100760, "playtime_last_two_weeks": 0, "last_played": 1547952219}, "language": "english", "review": "As of October 1st, 2018 EME officially killed the game.\n\nJust spend at least 5min of your time reading their post and player responses...\n[url=https://forums.enmasse.com/tera/discussion/29124/recent-dmca-takedowns-of-third-party-programs-discussion]The reason majority of their playerbase left[/url]\n\nAnd whats funny is that Xigncode is a third party software -_-", "timestamp_created": 1538492633, "timestamp_updated": 1538492857, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.572649598121643066", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31910263": {"recommendationid": "31910263", "author": {"steamid": "76561198095743955", "num_games_owned": 127, "num_reviews": 33, "playtime_forever": 230888, "playtime_last_two_weeks": 2442, "last_played": 1551771360}, "language": "english", "review": "This game has the best combat system for a free to play MMORPG out there.\n\nI'll bet my wand on that!\n\n(Adding some thoughts about the current state of the game)\nIts a good game but it is slowly dying due to the poor content updates.\n#makepvpgreatagainplz\n\n\nAs for the game, I played it for a bit so I think Im entitled for a review right?\nGANDALF STILL APPROVES!", "timestamp_created": 1495500812, "timestamp_updated": 1536102576, "voted_up": true, "votes_up": 19, "votes_funny": 6, "weighted_vote_score": "0.724454641342163086", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "45889790": {"recommendationid": "45889790", "author": {"steamid": "76561198063916687", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 76907, "playtime_last_two_weeks": 1544, "last_played": 1551761540}, "language": "english", "review": "[h1]1,000 Hour Thoughts[/h1]\n\nWhile this game and it's development have certainly not been without hiccups, it's been a very positive experience overall, and I'm glad I picked it up.\n\nLet's start with the game itself: \nI've yet to find an MMO with combat more fun and more dynamic than TERA's, the visceral feeling you get when landing a perfect rotation still feels satisfying after all this time. The non-tab-target combat however, does not rid the game of strategic or tactical planning in place of pure mechanical skill, but rather creates a balance between them both, ensuring that overall player skill will always be the determining factor of the outcome of a battle, and not just button-mashing. The game offers a variety of classes, most of which offer differing ways to play, catering to all players, from slow and deliberate (and punishing), to fast and loose. Content-wise there is plenty to keep you busy, though at lower levels it can definitely feel like a grind. Higher tier dungeons and the like offer more challenging and satisfying mechanics that offer ample rewards for the work put in to learn them. TERA's story is mostly sub-par, though not without its moments (Paesyn and Zolyn made me sad), the story and side quests consist mainly of fetching and killing specified quantities of enemies, and get boring pretty fast. While the lore surrounding the history of TERA's in game world is admittedly quite interesting, not much is done to paint a full or vivid picture of it in the player's mind, and much is left to be desired. Tying into the story is the voice acting, most of which is laughably bad, but thankfully clearly articulate and not without its moments; and the music, which is mostly just your standard fantasy soundtrack produced with digital instruments. TERA's world map is incredibly rich and varied, offering plenty of beautiful vistas to explore. Running back and forth for the repetitive questlines was made a lot easier with the view of the diverse landscapes present on the map. Unfortunately, once an area has been visited, there isn't much reason to return with the exception of world bosses and the rare event or higher level questline. Graphically TERA looks quite nice, though being a 32-bit game limits it to ~3gb of RAM, which can cause the occasional slowdown or crash depending on circumstance. For the better part of year, the devs (EME) had implemented the infamous Xigncode3 \"anti-cheat\" software much to the dismay of the community, followed with the DMCA and condemnation of 3rd party tools such as any proxies or DPS meters. The community was thrown into a frenzy, with many players leaving for the EU version of the game, which offered them a new place to play with a different publisher. Thankfully EME had realized their mistakes and reallowed proxy support to be reinstated, along with the removal of Xigncode3 in an attempt to reconcile with the still angry community. While a step in the right direction, one that is much appreciated, the devs still have a ways to go before the community is willing to forgive them and TERA is brought back into its prime.\n\nNow onto where I believe TERA truly shines, [b]the community[/b].\nEven though the TERA community loves to call itself toxic, as far as video game communities go, TERA's has been one of the most inclusive and laid back communities I have ever encountered. Though as every community does, TERA has it's share of toxic players, but for the most part this toxicity is heavily discouraged, and you'll find a far more rewarding experience if you show some respect. I've made plenty of friends playing, friendships that have extended past the boundaries of the game and into the real world. I've created a guild that has grown to a magnitude much larger of that which I had ever imagined, and I'm eternally to grateful to those who've stuck with me. Some of my fondest memories regarding TERA come from times when the community was brought together, be it from an ingame event or outside issue. There is no better feeling in a video game than to hop into a voice chat channel and to be greeted warmly because of the game you all play, followed by an evening of laughing, friendly competition, and (jolly) cooperation.\n\nOverall, good game, definitely worth a shot if you're in the market for a new MMO, though it does take a definite time commitment in order to keep up.\n\n[b]7 / 10[/b]", "timestamp_created": 1542580261, "timestamp_updated": 1542580261, "voted_up": true, "votes_up": 16, "votes_funny": 3, "weighted_vote_score": "0.690438389778137207", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 22, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 7886, "total_negative": 2343, "total_reviews": 10229}}
